{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "8f9b66a4",
   "metadata": {},
   "source": [
    "# TFM Suministro Global - CREAR RELACION -NECESITA_DE - de dependencia  entre materiales:\n",
    "## Materiales Refinados dependen de Materiales Brutos y y pueden generarse al extraerse/procesarse  otros materiales distintos al actual.  \n",
    "### Ejemplo: el Aluminio depende de la Bauxita, y  se reflejará con una relación adicional   \n",
    "### _AluminioB-[NECESITA_DE]-> BauxitaB)_\n",
    "\n",
    "##    > CREAR relación  MaterialREF--[NECESITA_DE] -->  MaterialB\n",
    "##    > Si aplica, CREAR relación adicional  MaterialB--[NECESITA_DE] -->  MaterialB\n",
    "##    > Si aplica, CREAR relación adicional  MaterialREF--[NECESITA_DE] -->  MaterialB\n",
    "##    > Si aplica, CREAR nodo nuevo con propiedad específica: MaterialB {nuevo: \"SI\"}\n",
    "\n",
    "## _Neo4j - py2neo_\n",
    "\n",
    "**OBSERVACIONES**  \n",
    "Ya creados los nodos ORIGEN y DESTINO\n",
    "Se carga fichero de adicionales para añadir relaciones adicionales para materiales específicos\n",
    "Va a añadir 3 nodos específicos de otros materiales que no están en el estudio pero que completan la cadena de suministro para el caso de los sulfuros (\"Sulphur\"), que depende en parte de la obtención de Gas Natural, o combustibles fósiles"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "fe7813af",
   "metadata": {},
   "source": [
    "## Partimos de la existencia, en paralelo a esta ejecución, de una instancia levantada y accesible de Neo4j  \n",
    "### La primera vez que se quiera usar _py2neo_ erá  necesario asegurar su instalación:  _!pip install py2neo_"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "7b420b33",
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Collecting py2neo\n",
      "  Downloading py2neo-2021.2.3-py2.py3-none-any.whl (177 kB)\n",
      "Requirement already satisfied: packaging in c:\\users\\jucar\\anaconda3\\envs\\rstudio\\lib\\site-packages (from py2neo) (21.3)\n",
      "Requirement already satisfied: urllib3 in c:\\users\\jucar\\anaconda3\\envs\\rstudio\\lib\\site-packages (from py2neo) (1.26.7)\n",
      "Collecting monotonic\n",
      "  Downloading monotonic-1.6-py2.py3-none-any.whl (8.2 kB)\n",
      "Requirement already satisfied: pygments>=2.0.0 in c:\\users\\jucar\\anaconda3\\envs\\rstudio\\lib\\site-packages (from py2neo) (2.10.0)\n",
      "Requirement already satisfied: six>=1.15.0 in c:\\users\\jucar\\anaconda3\\envs\\rstudio\\lib\\site-packages (from py2neo) (1.16.0)\n",
      "Collecting interchange~=2021.0.4\n",
      "  Downloading interchange-2021.0.4-py2.py3-none-any.whl (28 kB)\n",
      "Collecting pansi>=2020.7.3\n",
      "  Downloading pansi-2020.7.3-py2.py3-none-any.whl (10 kB)\n",
      "Requirement already satisfied: certifi in c:\\users\\jucar\\anaconda3\\envs\\rstudio\\lib\\site-packages (from py2neo) (2021.10.8)\n",
      "Requirement already satisfied: pytz in c:\\users\\jucar\\anaconda3\\envs\\rstudio\\lib\\site-packages (from interchange~=2021.0.4->py2neo) (2021.3)\n",
      "Requirement already satisfied: pyparsing!=3.0.5,>=2.0.2 in c:\\users\\jucar\\anaconda3\\envs\\rstudio\\lib\\site-packages (from packaging->py2neo) (3.0.4)\n",
      "Installing collected packages: pansi, monotonic, interchange, py2neo\n",
      "Successfully installed interchange-2021.0.4 monotonic-1.6 pansi-2020.7.3 py2neo-2021.2.3\n"
     ]
    }
   ],
   "source": [
    "##!pip install py2neo "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "6d9f652c",
   "metadata": {},
   "outputs": [],
   "source": [
    "#importar la librería para poder hacer uso de sus funcionalidades y objetos\n",
    "from py2neo import *"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "dc45043b",
   "metadata": {},
   "outputs": [],
   "source": [
    "#acceder a la instancia levantada de Neo4j - en nuestro caso instancia Docker - asignamos credenciales de autentificación -\n",
    "graph_test01 = Graph(auth=('neo4j', 's3cr3t'))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "0bdda4f9",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "Graph('bolt://localhost:7687')"
      ]
     },
     "execution_count": 4,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#que es el objeto - graph_test01\n",
    "graph_test01"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "ae88b5a3",
   "metadata": {},
   "outputs": [],
   "source": [
    "#que es el objeto - tx\n",
    "#tx = graph_test01.begin()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "07d7aa84",
   "metadata": {},
   "outputs": [],
   "source": [
    "#tx"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "id": "b5ee1622",
   "metadata": {
    "scrolled": false
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>name</th>\n",
       "      <th>Ntotal</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>MaterialB</td>\n",
       "      <td>79</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>MaterialREF</td>\n",
       "      <td>80</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Pais</td>\n",
       "      <td>116</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>GrupoAplicacion</td>\n",
       "      <td>88</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>SectorAplicacion</td>\n",
       "      <td>25</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "               name  Ntotal\n",
       "0         MaterialB      79\n",
       "1       MaterialREF      80\n",
       "2              Pais     116\n",
       "3   GrupoAplicacion      88\n",
       "4  SectorAplicacion      25"
      ]
     },
     "execution_count": 7,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#query de conexión de prueba sin errores\n",
    "# verificar existencia de NODOS previos creados\n",
    "#--- cuenta los nodos con diferentes tipos de etiqueta y los une en una única salida, 1 fila por cada tipo (name, cnt)\n",
    "queryPRB= \"MATCH (n)                                    \\\n",
    "RETURN labels (n)[0] as name, count (n) as Ntotal       \\\n",
    "UNION MATCH (n)                                         \\\n",
    "WITH labels (n)[1] as name, count (n) as Ntotal         \\\n",
    "WHERE name IS NOT NULL                                  \\\n",
    "RETURN name, Ntotal                                     \\\n",
    "UNION MATCH (n)                                         \\\n",
    "WITH labels (n)[2] as name, count (n) as Ntotal         \\\n",
    "WHERE name IS NOT NULL                                  \\\n",
    "RETURN name, Ntotal                                     \\\n",
    "UNION MATCH (n)                                         \\\n",
    "WITH labels (n)[3] as name, count (n) as Ntotal         \\\n",
    "WHERE name IS NOT NULL                                  \\\n",
    "RETURN name, Ntotal                                     \\\n",
    "\"\n",
    "graph_test01.run(queryPRB).to_data_frame()"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "27083405",
   "metadata": {},
   "source": [
    "## CARGAR DATOS"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "id": "ae0e1afa",
   "metadata": {},
   "outputs": [],
   "source": [
    "import numpy as np    #datos y operativa álgegra y matrices de n dimensiones (arrays)\n",
    "import pandas as pd   #carga dataset y manipulación de datos  y dataframes"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "id": "4e018e0b",
   "metadata": {},
   "outputs": [],
   "source": [
    "#DATOS: Fichero completo de MATERIAS PRIMAS CRÍTICAS en el suministro GLOBAL - Atendiendo al alcance del estudio - EU CRM 2020\n",
    "#FICHERO: GLMateriales_cargar.csv\n",
    "#CONTENIDO: Materiales \n",
    "#USO: Crear los NODOS de tipo \"MaterialB\" - Material bruto y \"MaterialREF\" - Material Refinado) \n",
    "## -- propiedades de cada material: nombre, abreviatura, familia y subfamilia \n",
    "## -- los datos de suministro -posteriores- fijarán las relaciones entre materiales, países proveedores y usos del material \n",
    "rutaFichero =  \"https://raw.githubusercontent.com/JuanKFD/UNIR_TFM/d10cd756788ce5e4b93f6b5c7ca4d40cb4aed297/GLMateriales_cargar.csv\" \n",
    "dfMateriales = pd.read_csv(rutaFichero, sep=';')\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "id": "a9bde14d",
   "metadata": {
    "scrolled": false
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Material</th>\n",
       "      <th>Mat_Abrev</th>\n",
       "      <th>Mat_Familia</th>\n",
       "      <th>Mat_Subfamilia</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Aluminium</td>\n",
       "      <td>Al</td>\n",
       "      <td>General</td>\n",
       "      <td>Other non-ferrous metals</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Antimony</td>\n",
       "      <td>Sb</td>\n",
       "      <td>General</td>\n",
       "      <td>Other non-ferrous metals</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Arsenic</td>\n",
       "      <td>As</td>\n",
       "      <td>General</td>\n",
       "      <td>Other non-ferrous metals</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Baryte</td>\n",
       "      <td>GBrt</td>\n",
       "      <td>General</td>\n",
       "      <td>Industrial &amp; constr. minerals</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Bauxite</td>\n",
       "      <td>Bx</td>\n",
       "      <td>General</td>\n",
       "      <td>Other non-ferrous metals</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "    Material Mat_Abrev Mat_Familia                 Mat_Subfamilia\n",
       "0  Aluminium        Al     General       Other non-ferrous metals\n",
       "1   Antimony        Sb     General       Other non-ferrous metals\n",
       "2    Arsenic        As     General       Other non-ferrous metals\n",
       "3     Baryte      GBrt     General  Industrial & constr. minerals\n",
       "4    Bauxite        Bx     General       Other non-ferrous metals"
      ]
     },
     "execution_count": 10,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "dfMateriales.head()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "id": "3785a1e2",
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Material</th>\n",
       "      <th>Mat_Abrev</th>\n",
       "      <th>Mat_Familia</th>\n",
       "      <th>Mat_Subfamilia</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>73</th>\n",
       "      <td>Tungsten</td>\n",
       "      <td>W</td>\n",
       "      <td>General</td>\n",
       "      <td>Iron and ferro-alloy metals</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>74</th>\n",
       "      <td>Vanadium</td>\n",
       "      <td>V</td>\n",
       "      <td>General</td>\n",
       "      <td>Iron and ferro-alloy metals</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>75</th>\n",
       "      <td>Yttrium</td>\n",
       "      <td>Y</td>\n",
       "      <td>Rare earths</td>\n",
       "      <td>HREEs-Heavy</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>76</th>\n",
       "      <td>Zinc</td>\n",
       "      <td>Zn</td>\n",
       "      <td>General</td>\n",
       "      <td>Other non-ferrous metals</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>77</th>\n",
       "      <td>Zirconium</td>\n",
       "      <td>Zr</td>\n",
       "      <td>General</td>\n",
       "      <td>Other non-ferrous metals</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "     Material Mat_Abrev  Mat_Familia               Mat_Subfamilia\n",
       "73   Tungsten         W      General  Iron and ferro-alloy metals\n",
       "74   Vanadium         V      General  Iron and ferro-alloy metals\n",
       "75    Yttrium         Y  Rare earths                  HREEs-Heavy\n",
       "76       Zinc        Zn      General     Other non-ferrous metals\n",
       "77  Zirconium        Zr      General     Other non-ferrous metals"
      ]
     },
     "execution_count": 11,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "dfMateriales.tail()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "id": "3c0a0050",
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "(78, 4)"
      ]
     },
     "execution_count": 14,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "dfMateriales.shape"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "id": "7b99516a",
   "metadata": {},
   "outputs": [],
   "source": [
    "nFilas = dfMateriales.shape[0]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "id": "9f85e8c0",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "78"
      ]
     },
     "execution_count": 15,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "nFilas"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "7dc58317",
   "metadata": {},
   "source": [
    "# PREVISUALIZACION DE DATOS - MATERIALES\n",
    "a = Node(\"Material\", name=dfMateriales.Material[i])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "id": "f0f87545",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Aluminium\n",
      "Al\n",
      "General\n",
      "Other non-ferrous metals\n",
      "Antimony\n",
      "Sb\n",
      "General\n",
      "Other non-ferrous metals\n",
      "Arsenic\n",
      "As\n",
      "General\n",
      "Other non-ferrous metals\n",
      "Baryte\n",
      "GBrt\n",
      "General\n",
      "Industrial & constr. minerals\n",
      "Bauxite\n",
      "Bx\n",
      "General\n",
      "Other non-ferrous metals\n",
      "Bentonite\n",
      "GBn\n",
      "General\n",
      "Industrial & constr. minerals\n",
      "Beryllium\n",
      "Be\n",
      "General\n",
      "Other non-ferrous metals\n",
      "Bismuth\n",
      "Bi\n",
      "General\n",
      "Other non-ferrous metals\n",
      "Borate\n",
      "Gbo\n",
      "General\n",
      "Industrial & constr. minerals\n",
      "Cadmium\n",
      "Cd\n",
      "General\n",
      "Other non-ferrous metals\n",
      "Cerium\n",
      "Ce\n",
      "Rare earths\n",
      "LREEs-Light\n",
      "Chromium\n",
      "Cr\n",
      "General\n",
      "Iron and ferro-alloy metals\n",
      "Cobalt\n",
      "Co\n",
      "General\n",
      "Iron and ferro-alloy metals\n",
      "Coking coal\n",
      "GCc\n",
      "General\n",
      "Bio and other materials\n",
      "Copper\n",
      "Cu\n",
      "General\n",
      "Other non-ferrous metals\n",
      "Diatomite\n",
      "Di\n",
      "General\n",
      "Industrial & constr. minerals\n",
      "Dysprosium\n",
      "Dy\n",
      "Rare earths\n",
      "HREEs-Heavy\n",
      "Erbium\n",
      "Er\n",
      "Rare earths\n",
      "HREEs-Heavy\n",
      "Europium\n",
      "Eu\n",
      "Rare earths\n",
      "HREEs-Heavy\n",
      "Feldspar\n",
      "Fsp\n",
      "General\n",
      "Industrial & constr. minerals\n",
      "Fluorspar\n",
      "Fl\n",
      "General\n",
      "Industrial & constr. minerals\n",
      "Gadolinium\n",
      "Gd\n",
      "Rare earths\n",
      "HREEs-Heavy\n",
      "Gallium\n",
      "Ga\n",
      "General\n",
      "Other non-ferrous metals\n",
      "Germanium\n",
      "Ge\n",
      "General\n",
      "Other non-ferrous metals\n",
      "Gold\n",
      "Au\n",
      "Precious metals\n",
      "General\n",
      "Gypsum\n",
      "Gp\n",
      "General\n",
      "Industrial & constr. minerals\n",
      "Hafnium\n",
      "Hf\n",
      "General\n",
      "Other non-ferrous metals\n",
      "Helium\n",
      "He\n",
      "General\n",
      "Bio and other materials\n",
      "Ho, Tm, Lu, Yb\n",
      "HoTmLuYb\n",
      "Rare earths\n",
      "HREEs-Heavy\n",
      "Indium\n",
      "In\n",
      "General\n",
      "Other non-ferrous metals\n",
      "Iridium\n",
      "Ir\n",
      "Precious metals\n",
      "PGM-Platinum Group Metals\n",
      "Iron ore\n",
      "Fe\n",
      "General\n",
      "Iron and ferro-alloy metals\n",
      "Kaolin clay\n",
      "Kc\n",
      "General\n",
      "Industrial & constr. minerals\n",
      "Lanthanum\n",
      "La\n",
      "Rare earths\n",
      "LREEs-Light\n",
      "Lead\n",
      "Pb\n",
      "General\n",
      "Other non-ferrous metals\n",
      "Limestone\n",
      "Ls\n",
      "General\n",
      "Industrial & constr. minerals\n",
      "Lithium\n",
      "Li\n",
      "General\n",
      "Other non-ferrous metals\n",
      "Magnesite\n",
      "Mgs\n",
      "General\n",
      "Industrial & constr. minerals\n",
      "Magnesium\n",
      "Mg\n",
      "General\n",
      "Other non-ferrous metals\n",
      "Manganese\n",
      "Mn\n",
      "General\n",
      "Iron and ferro-alloy metals\n",
      "Molybdenum\n",
      "Mo\n",
      "General\n",
      "Iron and ferro-alloy metals\n",
      "Natural cork\n",
      "GNC\n",
      "General\n",
      "Bio and other materials\n",
      "Natural graphite\n",
      "GGr\n",
      "General\n",
      "Industrial & constr. minerals\n",
      "Natural Rubber\n",
      "GNr\n",
      "General\n",
      "Bio and other materials\n",
      "Natural Teak wood\n",
      "GNt\n",
      "General\n",
      "Bio and other materials\n",
      "Neodymium\n",
      "Nd\n",
      "Rare earths\n",
      "LREEs-Light\n",
      "Nickel\n",
      "Ni\n",
      "General\n",
      "Iron and ferro-alloy metals\n",
      "Niobium\n",
      "Nb\n",
      "General\n",
      "Iron and ferro-alloy metals\n",
      "Palladium\n",
      "Pd\n",
      "Precious metals\n",
      "PGM-Platinum Group Metals\n",
      "Perlite\n",
      "Pe\n",
      "General\n",
      "Industrial & constr. minerals\n",
      "Phosphate rock\n",
      "Phs\n",
      "General\n",
      "Industrial & constr. minerals\n",
      "Phosphorus\n",
      "P\n",
      "General\n",
      "Industrial & constr. minerals\n",
      "Platinum\n",
      "Pl\n",
      "Precious metals\n",
      "PGM-Platinum Group Metals\n",
      "Potash\n",
      "Po\n",
      "General\n",
      "Industrial & constr. minerals\n",
      "Praseodymium\n",
      "Pr\n",
      "Rare earths\n",
      "LREEs-Light\n",
      "Rhenium\n",
      "Re\n",
      "General\n",
      "Other non-ferrous metals\n",
      "Rhodium\n",
      "Rh\n",
      "Precious metals\n",
      "PGM-Platinum Group Metals\n",
      "Ruthenium\n",
      "Ru\n",
      "Precious metals\n",
      "PGM-Platinum Group Metals\n",
      "Samarium\n",
      "Sm\n",
      "Rare earths\n",
      "LREEs-Light\n",
      "Sapele wood\n",
      "GSw\n",
      "General\n",
      "Bio and other materials\n",
      "Scandium\n",
      "Sc\n",
      "Rare earths\n",
      "HREEs-Heavy\n",
      "Selenium\n",
      "Se\n",
      "General\n",
      "Other non-ferrous metals\n",
      "Silica sand\n",
      "Sl\n",
      "General\n",
      "Industrial & constr. minerals\n",
      "Silicon metal\n",
      "Si\n",
      "General\n",
      "Other non-ferrous metals\n",
      "Silver\n",
      "Ag\n",
      "Precious metals\n",
      "General\n",
      "Strontium\n",
      "Sr\n",
      "General\n",
      "Other non-ferrous metals\n",
      "Sulphur\n",
      "S\n",
      "General\n",
      "Industrial & constr. minerals\n",
      "Talc\n",
      "Tc\n",
      "General\n",
      "Industrial & constr. minerals\n",
      "Tantalum\n",
      "Ta\n",
      "General\n",
      "Iron and ferro-alloy metals\n",
      "Tellurium\n",
      "Te\n",
      "General\n",
      "Other non-ferrous metals\n",
      "Terbium\n",
      "Tb\n",
      "Rare earths\n",
      "HREEs-Heavy\n",
      "Tin\n",
      "Sn\n",
      "General\n",
      "Other non-ferrous metals\n",
      "Titanium\n",
      "Ti\n",
      "General\n",
      "Iron and ferro-alloy metals\n",
      "Tungsten\n",
      "W\n",
      "General\n",
      "Iron and ferro-alloy metals\n",
      "Vanadium\n",
      "V\n",
      "General\n",
      "Iron and ferro-alloy metals\n",
      "Yttrium\n",
      "Y\n",
      "Rare earths\n",
      "HREEs-Heavy\n",
      "Zinc\n",
      "Zn\n",
      "General\n",
      "Other non-ferrous metals\n",
      "Zirconium\n",
      "Zr\n",
      "General\n",
      "Other non-ferrous metals\n"
     ]
    }
   ],
   "source": [
    "for i in range(0, nFilas):\n",
    "    print(dfMateriales.Material[i])\n",
    "    print(dfMateriales.Mat_Abrev[i])\n",
    "    print(dfMateriales.Mat_Familia[i])\n",
    "    print(dfMateriales.Mat_Subfamilia[i])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "id": "cb41a203",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "Index(['Material', 'Mat_Abrev', 'Mat_Familia', 'Mat_Subfamilia'], dtype='object')"
      ]
     },
     "execution_count": 21,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "dfMateriales.columns"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "3f7f78e8",
   "metadata": {},
   "source": [
    "# CREAR RELACION _-NECESITA_DE-_ entre nodos  :MaterialB y :MaterialREF"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "488887d6",
   "metadata": {},
   "source": [
    "Consulta patrón CQL-Neo4j para crear la relación buscada\n",
    "MATCH\n",
    "(a:MaterialREF),\n",
    "(b:MaterialB)\n",
    "\n",
    "WHERE a.name = dfMateriales.Material[i] AND b.name = dfMateriales.Material[i]\n",
    "CREATE (a)-[r:NECESITA_DE {SHR_PaisMat: 0.nn, t_PaisMat: m.mm }]->(b)\n",
    "RETURN type(r)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "id": "bd3533a0",
   "metadata": {
    "scrolled": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "QRY [0]> MATCH (a :MaterialB), (b  :MaterialREF) WHERE a.name = 'Aluminium' AND b.name = 'Aluminium_REF' CREATE (b)-[r :NECESITA_DE]->(a) RETURN type(r)\n",
      "QRY [1]> MATCH (a :MaterialB), (b  :MaterialREF) WHERE a.name = 'Antimony' AND b.name = 'Antimony_REF' CREATE (b)-[r :NECESITA_DE]->(a) RETURN type(r)\n",
      "QRY [2]> MATCH (a :MaterialB), (b  :MaterialREF) WHERE a.name = 'Arsenic' AND b.name = 'Arsenic_REF' CREATE (b)-[r :NECESITA_DE]->(a) RETURN type(r)\n",
      "QRY [3]> MATCH (a :MaterialB), (b  :MaterialREF) WHERE a.name = 'Baryte' AND b.name = 'Baryte_REF' CREATE (b)-[r :NECESITA_DE]->(a) RETURN type(r)\n",
      "QRY [4]> MATCH (a :MaterialB), (b  :MaterialREF) WHERE a.name = 'Bauxite' AND b.name = 'Bauxite_REF' CREATE (b)-[r :NECESITA_DE]->(a) RETURN type(r)\n",
      "QRY [5]> MATCH (a :MaterialB), (b  :MaterialREF) WHERE a.name = 'Bentonite' AND b.name = 'Bentonite_REF' CREATE (b)-[r :NECESITA_DE]->(a) RETURN type(r)\n",
      "QRY [6]> MATCH (a :MaterialB), (b  :MaterialREF) WHERE a.name = 'Beryllium' AND b.name = 'Beryllium_REF' CREATE (b)-[r :NECESITA_DE]->(a) RETURN type(r)\n",
      "QRY [7]> MATCH (a :MaterialB), (b  :MaterialREF) WHERE a.name = 'Bismuth' AND b.name = 'Bismuth_REF' CREATE (b)-[r :NECESITA_DE]->(a) RETURN type(r)\n",
      "QRY [8]> MATCH (a :MaterialB), (b  :MaterialREF) WHERE a.name = 'Borate' AND b.name = 'Borate_REF' CREATE (b)-[r :NECESITA_DE]->(a) RETURN type(r)\n",
      "QRY [9]> MATCH (a :MaterialB), (b  :MaterialREF) WHERE a.name = 'Cadmium' AND b.name = 'Cadmium_REF' CREATE (b)-[r :NECESITA_DE]->(a) RETURN type(r)\n",
      "QRY [10]> MATCH (a :MaterialB), (b  :MaterialREF) WHERE a.name = 'Cerium' AND b.name = 'Cerium_REF' CREATE (b)-[r :NECESITA_DE]->(a) RETURN type(r)\n",
      "QRY [11]> MATCH (a :MaterialB), (b  :MaterialREF) WHERE a.name = 'Chromium' AND b.name = 'Chromium_REF' CREATE (b)-[r :NECESITA_DE]->(a) RETURN type(r)\n",
      "QRY [12]> MATCH (a :MaterialB), (b  :MaterialREF) WHERE a.name = 'Cobalt' AND b.name = 'Cobalt_REF' CREATE (b)-[r :NECESITA_DE]->(a) RETURN type(r)\n",
      "QRY [13]> MATCH (a :MaterialB), (b  :MaterialREF) WHERE a.name = 'Coking coal' AND b.name = 'Coking coal_REF' CREATE (b)-[r :NECESITA_DE]->(a) RETURN type(r)\n",
      "QRY [14]> MATCH (a :MaterialB), (b  :MaterialREF) WHERE a.name = 'Copper' AND b.name = 'Copper_REF' CREATE (b)-[r :NECESITA_DE]->(a) RETURN type(r)\n",
      "QRY [15]> MATCH (a :MaterialB), (b  :MaterialREF) WHERE a.name = 'Diatomite' AND b.name = 'Diatomite_REF' CREATE (b)-[r :NECESITA_DE]->(a) RETURN type(r)\n",
      "QRY [16]> MATCH (a :MaterialB), (b  :MaterialREF) WHERE a.name = 'Dysprosium' AND b.name = 'Dysprosium_REF' CREATE (b)-[r :NECESITA_DE]->(a) RETURN type(r)\n",
      "QRY [17]> MATCH (a :MaterialB), (b  :MaterialREF) WHERE a.name = 'Erbium' AND b.name = 'Erbium_REF' CREATE (b)-[r :NECESITA_DE]->(a) RETURN type(r)\n",
      "QRY [18]> MATCH (a :MaterialB), (b  :MaterialREF) WHERE a.name = 'Europium' AND b.name = 'Europium_REF' CREATE (b)-[r :NECESITA_DE]->(a) RETURN type(r)\n",
      "QRY [19]> MATCH (a :MaterialB), (b  :MaterialREF) WHERE a.name = 'Feldspar' AND b.name = 'Feldspar_REF' CREATE (b)-[r :NECESITA_DE]->(a) RETURN type(r)\n",
      "QRY [20]> MATCH (a :MaterialB), (b  :MaterialREF) WHERE a.name = 'Fluorspar' AND b.name = 'Fluorspar_REF' CREATE (b)-[r :NECESITA_DE]->(a) RETURN type(r)\n",
      "QRY [21]> MATCH (a :MaterialB), (b  :MaterialREF) WHERE a.name = 'Gadolinium' AND b.name = 'Gadolinium_REF' CREATE (b)-[r :NECESITA_DE]->(a) RETURN type(r)\n",
      "QRY [22]> MATCH (a :MaterialB), (b  :MaterialREF) WHERE a.name = 'Gallium' AND b.name = 'Gallium_REF' CREATE (b)-[r :NECESITA_DE]->(a) RETURN type(r)\n",
      "QRY [23]> MATCH (a :MaterialB), (b  :MaterialREF) WHERE a.name = 'Germanium' AND b.name = 'Germanium_REF' CREATE (b)-[r :NECESITA_DE]->(a) RETURN type(r)\n",
      "QRY [24]> MATCH (a :MaterialB), (b  :MaterialREF) WHERE a.name = 'Gold' AND b.name = 'Gold_REF' CREATE (b)-[r :NECESITA_DE]->(a) RETURN type(r)\n",
      "QRY [25]> MATCH (a :MaterialB), (b  :MaterialREF) WHERE a.name = 'Gypsum' AND b.name = 'Gypsum_REF' CREATE (b)-[r :NECESITA_DE]->(a) RETURN type(r)\n",
      "QRY [26]> MATCH (a :MaterialB), (b  :MaterialREF) WHERE a.name = 'Hafnium' AND b.name = 'Hafnium_REF' CREATE (b)-[r :NECESITA_DE]->(a) RETURN type(r)\n",
      "QRY [27]> MATCH (a :MaterialB), (b  :MaterialREF) WHERE a.name = 'Helium' AND b.name = 'Helium_REF' CREATE (b)-[r :NECESITA_DE]->(a) RETURN type(r)\n",
      "QRY [28]> MATCH (a :MaterialB), (b  :MaterialREF) WHERE a.name = 'Ho, Tm, Lu, Yb' AND b.name = 'Ho, Tm, Lu, Yb_REF' CREATE (b)-[r :NECESITA_DE]->(a) RETURN type(r)\n",
      "QRY [29]> MATCH (a :MaterialB), (b  :MaterialREF) WHERE a.name = 'Indium' AND b.name = 'Indium_REF' CREATE (b)-[r :NECESITA_DE]->(a) RETURN type(r)\n",
      "QRY [30]> MATCH (a :MaterialB), (b  :MaterialREF) WHERE a.name = 'Iridium' AND b.name = 'Iridium_REF' CREATE (b)-[r :NECESITA_DE]->(a) RETURN type(r)\n",
      "QRY [31]> MATCH (a :MaterialB), (b  :MaterialREF) WHERE a.name = 'Iron ore' AND b.name = 'Iron ore_REF' CREATE (b)-[r :NECESITA_DE]->(a) RETURN type(r)\n",
      "QRY [32]> MATCH (a :MaterialB), (b  :MaterialREF) WHERE a.name = 'Kaolin clay' AND b.name = 'Kaolin clay_REF' CREATE (b)-[r :NECESITA_DE]->(a) RETURN type(r)\n",
      "QRY [33]> MATCH (a :MaterialB), (b  :MaterialREF) WHERE a.name = 'Lanthanum' AND b.name = 'Lanthanum_REF' CREATE (b)-[r :NECESITA_DE]->(a) RETURN type(r)\n",
      "QRY [34]> MATCH (a :MaterialB), (b  :MaterialREF) WHERE a.name = 'Lead' AND b.name = 'Lead_REF' CREATE (b)-[r :NECESITA_DE]->(a) RETURN type(r)\n",
      "QRY [35]> MATCH (a :MaterialB), (b  :MaterialREF) WHERE a.name = 'Limestone' AND b.name = 'Limestone_REF' CREATE (b)-[r :NECESITA_DE]->(a) RETURN type(r)\n",
      "QRY [36]> MATCH (a :MaterialB), (b  :MaterialREF) WHERE a.name = 'Lithium' AND b.name = 'Lithium_REF' CREATE (b)-[r :NECESITA_DE]->(a) RETURN type(r)\n",
      "QRY [37]> MATCH (a :MaterialB), (b  :MaterialREF) WHERE a.name = 'Magnesite' AND b.name = 'Magnesite_REF' CREATE (b)-[r :NECESITA_DE]->(a) RETURN type(r)\n",
      "QRY [38]> MATCH (a :MaterialB), (b  :MaterialREF) WHERE a.name = 'Magnesium' AND b.name = 'Magnesium_REF' CREATE (b)-[r :NECESITA_DE]->(a) RETURN type(r)\n",
      "QRY [39]> MATCH (a :MaterialB), (b  :MaterialREF) WHERE a.name = 'Manganese' AND b.name = 'Manganese_REF' CREATE (b)-[r :NECESITA_DE]->(a) RETURN type(r)\n",
      "QRY [40]> MATCH (a :MaterialB), (b  :MaterialREF) WHERE a.name = 'Molybdenum' AND b.name = 'Molybdenum_REF' CREATE (b)-[r :NECESITA_DE]->(a) RETURN type(r)\n",
      "QRY [41]> MATCH (a :MaterialB), (b  :MaterialREF) WHERE a.name = 'Natural cork' AND b.name = 'Natural cork_REF' CREATE (b)-[r :NECESITA_DE]->(a) RETURN type(r)\n",
      "QRY [42]> MATCH (a :MaterialB), (b  :MaterialREF) WHERE a.name = 'Natural graphite' AND b.name = 'Natural graphite_REF' CREATE (b)-[r :NECESITA_DE]->(a) RETURN type(r)\n",
      "QRY [43]> MATCH (a :MaterialB), (b  :MaterialREF) WHERE a.name = 'Natural Rubber' AND b.name = 'Natural Rubber_REF' CREATE (b)-[r :NECESITA_DE]->(a) RETURN type(r)\n",
      "QRY [44]> MATCH (a :MaterialB), (b  :MaterialREF) WHERE a.name = 'Natural Teak wood' AND b.name = 'Natural Teak wood_REF' CREATE (b)-[r :NECESITA_DE]->(a) RETURN type(r)\n",
      "QRY [45]> MATCH (a :MaterialB), (b  :MaterialREF) WHERE a.name = 'Neodymium' AND b.name = 'Neodymium_REF' CREATE (b)-[r :NECESITA_DE]->(a) RETURN type(r)\n",
      "QRY [46]> MATCH (a :MaterialB), (b  :MaterialREF) WHERE a.name = 'Nickel' AND b.name = 'Nickel_REF' CREATE (b)-[r :NECESITA_DE]->(a) RETURN type(r)\n",
      "QRY [47]> MATCH (a :MaterialB), (b  :MaterialREF) WHERE a.name = 'Niobium' AND b.name = 'Niobium_REF' CREATE (b)-[r :NECESITA_DE]->(a) RETURN type(r)\n",
      "QRY [48]> MATCH (a :MaterialB), (b  :MaterialREF) WHERE a.name = 'Palladium' AND b.name = 'Palladium_REF' CREATE (b)-[r :NECESITA_DE]->(a) RETURN type(r)\n",
      "QRY [49]> MATCH (a :MaterialB), (b  :MaterialREF) WHERE a.name = 'Perlite' AND b.name = 'Perlite_REF' CREATE (b)-[r :NECESITA_DE]->(a) RETURN type(r)\n",
      "QRY [50]> MATCH (a :MaterialB), (b  :MaterialREF) WHERE a.name = 'Phosphate rock' AND b.name = 'Phosphate rock_REF' CREATE (b)-[r :NECESITA_DE]->(a) RETURN type(r)\n",
      "QRY [51]> MATCH (a :MaterialB), (b  :MaterialREF) WHERE a.name = 'Phosphorus' AND b.name = 'Phosphorus_REF' CREATE (b)-[r :NECESITA_DE]->(a) RETURN type(r)\n",
      "QRY [52]> MATCH (a :MaterialB), (b  :MaterialREF) WHERE a.name = 'Platinum' AND b.name = 'Platinum_REF' CREATE (b)-[r :NECESITA_DE]->(a) RETURN type(r)\n",
      "QRY [53]> MATCH (a :MaterialB), (b  :MaterialREF) WHERE a.name = 'Potash' AND b.name = 'Potash_REF' CREATE (b)-[r :NECESITA_DE]->(a) RETURN type(r)\n",
      "QRY [54]> MATCH (a :MaterialB), (b  :MaterialREF) WHERE a.name = 'Praseodymium' AND b.name = 'Praseodymium_REF' CREATE (b)-[r :NECESITA_DE]->(a) RETURN type(r)\n",
      "QRY [55]> MATCH (a :MaterialB), (b  :MaterialREF) WHERE a.name = 'Rhenium' AND b.name = 'Rhenium_REF' CREATE (b)-[r :NECESITA_DE]->(a) RETURN type(r)\n",
      "QRY [56]> MATCH (a :MaterialB), (b  :MaterialREF) WHERE a.name = 'Rhodium' AND b.name = 'Rhodium_REF' CREATE (b)-[r :NECESITA_DE]->(a) RETURN type(r)\n",
      "QRY [57]> MATCH (a :MaterialB), (b  :MaterialREF) WHERE a.name = 'Ruthenium' AND b.name = 'Ruthenium_REF' CREATE (b)-[r :NECESITA_DE]->(a) RETURN type(r)\n",
      "QRY [58]> MATCH (a :MaterialB), (b  :MaterialREF) WHERE a.name = 'Samarium' AND b.name = 'Samarium_REF' CREATE (b)-[r :NECESITA_DE]->(a) RETURN type(r)\n",
      "QRY [59]> MATCH (a :MaterialB), (b  :MaterialREF) WHERE a.name = 'Sapele wood' AND b.name = 'Sapele wood_REF' CREATE (b)-[r :NECESITA_DE]->(a) RETURN type(r)\n",
      "QRY [60]> MATCH (a :MaterialB), (b  :MaterialREF) WHERE a.name = 'Scandium' AND b.name = 'Scandium_REF' CREATE (b)-[r :NECESITA_DE]->(a) RETURN type(r)\n",
      "QRY [61]> MATCH (a :MaterialB), (b  :MaterialREF) WHERE a.name = 'Selenium' AND b.name = 'Selenium_REF' CREATE (b)-[r :NECESITA_DE]->(a) RETURN type(r)\n",
      "QRY [62]> MATCH (a :MaterialB), (b  :MaterialREF) WHERE a.name = 'Silica sand' AND b.name = 'Silica sand_REF' CREATE (b)-[r :NECESITA_DE]->(a) RETURN type(r)\n",
      "QRY [63]> MATCH (a :MaterialB), (b  :MaterialREF) WHERE a.name = 'Silicon metal' AND b.name = 'Silicon metal_REF' CREATE (b)-[r :NECESITA_DE]->(a) RETURN type(r)\n",
      "QRY [64]> MATCH (a :MaterialB), (b  :MaterialREF) WHERE a.name = 'Silver' AND b.name = 'Silver_REF' CREATE (b)-[r :NECESITA_DE]->(a) RETURN type(r)\n",
      "QRY [65]> MATCH (a :MaterialB), (b  :MaterialREF) WHERE a.name = 'Strontium' AND b.name = 'Strontium_REF' CREATE (b)-[r :NECESITA_DE]->(a) RETURN type(r)\n",
      "QRY [66]> MATCH (a :MaterialB), (b  :MaterialREF) WHERE a.name = 'Sulphur' AND b.name = 'Sulphur_REF' CREATE (b)-[r :NECESITA_DE]->(a) RETURN type(r)\n",
      "QRY [67]> MATCH (a :MaterialB), (b  :MaterialREF) WHERE a.name = 'Talc' AND b.name = 'Talc_REF' CREATE (b)-[r :NECESITA_DE]->(a) RETURN type(r)\n",
      "QRY [68]> MATCH (a :MaterialB), (b  :MaterialREF) WHERE a.name = 'Tantalum' AND b.name = 'Tantalum_REF' CREATE (b)-[r :NECESITA_DE]->(a) RETURN type(r)\n",
      "QRY [69]> MATCH (a :MaterialB), (b  :MaterialREF) WHERE a.name = 'Tellurium' AND b.name = 'Tellurium_REF' CREATE (b)-[r :NECESITA_DE]->(a) RETURN type(r)\n",
      "QRY [70]> MATCH (a :MaterialB), (b  :MaterialREF) WHERE a.name = 'Terbium' AND b.name = 'Terbium_REF' CREATE (b)-[r :NECESITA_DE]->(a) RETURN type(r)\n",
      "QRY [71]> MATCH (a :MaterialB), (b  :MaterialREF) WHERE a.name = 'Tin' AND b.name = 'Tin_REF' CREATE (b)-[r :NECESITA_DE]->(a) RETURN type(r)\n",
      "QRY [72]> MATCH (a :MaterialB), (b  :MaterialREF) WHERE a.name = 'Titanium' AND b.name = 'Titanium_REF' CREATE (b)-[r :NECESITA_DE]->(a) RETURN type(r)\n",
      "QRY [73]> MATCH (a :MaterialB), (b  :MaterialREF) WHERE a.name = 'Tungsten' AND b.name = 'Tungsten_REF' CREATE (b)-[r :NECESITA_DE]->(a) RETURN type(r)\n",
      "QRY [74]> MATCH (a :MaterialB), (b  :MaterialREF) WHERE a.name = 'Vanadium' AND b.name = 'Vanadium_REF' CREATE (b)-[r :NECESITA_DE]->(a) RETURN type(r)\n",
      "QRY [75]> MATCH (a :MaterialB), (b  :MaterialREF) WHERE a.name = 'Yttrium' AND b.name = 'Yttrium_REF' CREATE (b)-[r :NECESITA_DE]->(a) RETURN type(r)\n",
      "QRY [76]> MATCH (a :MaterialB), (b  :MaterialREF) WHERE a.name = 'Zinc' AND b.name = 'Zinc_REF' CREATE (b)-[r :NECESITA_DE]->(a) RETURN type(r)\n",
      "QRY [77]> MATCH (a :MaterialB), (b  :MaterialREF) WHERE a.name = 'Zirconium' AND b.name = 'Zirconium_REF' CREATE (b)-[r :NECESITA_DE]->(a) RETURN type(r)\n"
     ]
    }
   ],
   "source": [
    "#  Crear RELACIONES de tipo :NECESITA_DE\n",
    "#  Nodos origen y destino: MATERIALES -- \"MaterialB\" bruto -->  \"MaterialREF\" refinado\n",
    "#\n",
    "## PREVISAULIZAR QUERYs antes de la ejecución\n",
    "# \n",
    "TipoNodoA = \" :MaterialB\" \n",
    "TipoNodoB = \" :MaterialREF\" \n",
    "TipoRelacion = \" :NECESITA_DE\"\n",
    "inicio = 0\n",
    "nFilas = dfMateriales.shape[0]\n",
    "#\n",
    "for i in range(inicio, nFilas):\n",
    "        strQry = \"MATCH (a\"                                    \\\n",
    "            + TipoNodoA                                        \\\n",
    "            + \"), (b \" + TipoNodoB                            \\\n",
    "            + \") WHERE a.name = '\"                             \\\n",
    "            +  dfMateriales.Material[i]                       \\\n",
    "            + \"'\"                                             \\\n",
    "            + \" AND b.name = '\"                               \\\n",
    "            +  dfMateriales.Material[i]                      \\\n",
    "            + \"_REF'\"                                         \\\n",
    "            + \" CREATE (b)-[r\"                               \\\n",
    "            + TipoRelacion                                    \\\n",
    "            + \"]->(a)\"                                        \\\n",
    "            + \" RETURN type(r)\"                                 \n",
    "        print(\"QRY [\" + str(i) + \"]> \"+ strQry)\n",
    "\n",
    "# querys  visualizadas\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "id": "daf726b0",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "Graph('bolt://localhost:7687')"
      ]
     },
     "execution_count": 20,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#verificar que se mantiene la conexión creada\n",
    "graph_test01"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "id": "b2a8c8f1",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "EJECUTADA QRY [0]> MATCH (a :MaterialB), (b  :MaterialREF) WHERE a.name = 'Aluminium' AND b.name = 'Aluminium_REF' CREATE (b)-[r :NECESITA_DE]->(a) RETURN type(r)\n",
      "EJECUTADA QRY [1]> MATCH (a :MaterialB), (b  :MaterialREF) WHERE a.name = 'Antimony' AND b.name = 'Antimony_REF' CREATE (b)-[r :NECESITA_DE]->(a) RETURN type(r)\n",
      "EJECUTADA QRY [2]> MATCH (a :MaterialB), (b  :MaterialREF) WHERE a.name = 'Arsenic' AND b.name = 'Arsenic_REF' CREATE (b)-[r :NECESITA_DE]->(a) RETURN type(r)\n",
      "EJECUTADA QRY [3]> MATCH (a :MaterialB), (b  :MaterialREF) WHERE a.name = 'Baryte' AND b.name = 'Baryte_REF' CREATE (b)-[r :NECESITA_DE]->(a) RETURN type(r)\n",
      "EJECUTADA QRY [4]> MATCH (a :MaterialB), (b  :MaterialREF) WHERE a.name = 'Bauxite' AND b.name = 'Bauxite_REF' CREATE (b)-[r :NECESITA_DE]->(a) RETURN type(r)\n",
      "EJECUTADA QRY [5]> MATCH (a :MaterialB), (b  :MaterialREF) WHERE a.name = 'Bentonite' AND b.name = 'Bentonite_REF' CREATE (b)-[r :NECESITA_DE]->(a) RETURN type(r)\n",
      "EJECUTADA QRY [6]> MATCH (a :MaterialB), (b  :MaterialREF) WHERE a.name = 'Beryllium' AND b.name = 'Beryllium_REF' CREATE (b)-[r :NECESITA_DE]->(a) RETURN type(r)\n",
      "EJECUTADA QRY [7]> MATCH (a :MaterialB), (b  :MaterialREF) WHERE a.name = 'Bismuth' AND b.name = 'Bismuth_REF' CREATE (b)-[r :NECESITA_DE]->(a) RETURN type(r)\n",
      "EJECUTADA QRY [8]> MATCH (a :MaterialB), (b  :MaterialREF) WHERE a.name = 'Borate' AND b.name = 'Borate_REF' CREATE (b)-[r :NECESITA_DE]->(a) RETURN type(r)\n",
      "EJECUTADA QRY [9]> MATCH (a :MaterialB), (b  :MaterialREF) WHERE a.name = 'Cadmium' AND b.name = 'Cadmium_REF' CREATE (b)-[r :NECESITA_DE]->(a) RETURN type(r)\n",
      "EJECUTADA QRY [10]> MATCH (a :MaterialB), (b  :MaterialREF) WHERE a.name = 'Cerium' AND b.name = 'Cerium_REF' CREATE (b)-[r :NECESITA_DE]->(a) RETURN type(r)\n",
      "EJECUTADA QRY [11]> MATCH (a :MaterialB), (b  :MaterialREF) WHERE a.name = 'Chromium' AND b.name = 'Chromium_REF' CREATE (b)-[r :NECESITA_DE]->(a) RETURN type(r)\n",
      "EJECUTADA QRY [12]> MATCH (a :MaterialB), (b  :MaterialREF) WHERE a.name = 'Cobalt' AND b.name = 'Cobalt_REF' CREATE (b)-[r :NECESITA_DE]->(a) RETURN type(r)\n",
      "EJECUTADA QRY [13]> MATCH (a :MaterialB), (b  :MaterialREF) WHERE a.name = 'Coking coal' AND b.name = 'Coking coal_REF' CREATE (b)-[r :NECESITA_DE]->(a) RETURN type(r)\n",
      "EJECUTADA QRY [14]> MATCH (a :MaterialB), (b  :MaterialREF) WHERE a.name = 'Copper' AND b.name = 'Copper_REF' CREATE (b)-[r :NECESITA_DE]->(a) RETURN type(r)\n",
      "EJECUTADA QRY [15]> MATCH (a :MaterialB), (b  :MaterialREF) WHERE a.name = 'Diatomite' AND b.name = 'Diatomite_REF' CREATE (b)-[r :NECESITA_DE]->(a) RETURN type(r)\n",
      "EJECUTADA QRY [16]> MATCH (a :MaterialB), (b  :MaterialREF) WHERE a.name = 'Dysprosium' AND b.name = 'Dysprosium_REF' CREATE (b)-[r :NECESITA_DE]->(a) RETURN type(r)\n",
      "EJECUTADA QRY [17]> MATCH (a :MaterialB), (b  :MaterialREF) WHERE a.name = 'Erbium' AND b.name = 'Erbium_REF' CREATE (b)-[r :NECESITA_DE]->(a) RETURN type(r)\n",
      "EJECUTADA QRY [18]> MATCH (a :MaterialB), (b  :MaterialREF) WHERE a.name = 'Europium' AND b.name = 'Europium_REF' CREATE (b)-[r :NECESITA_DE]->(a) RETURN type(r)\n",
      "EJECUTADA QRY [19]> MATCH (a :MaterialB), (b  :MaterialREF) WHERE a.name = 'Feldspar' AND b.name = 'Feldspar_REF' CREATE (b)-[r :NECESITA_DE]->(a) RETURN type(r)\n",
      "EJECUTADA QRY [20]> MATCH (a :MaterialB), (b  :MaterialREF) WHERE a.name = 'Fluorspar' AND b.name = 'Fluorspar_REF' CREATE (b)-[r :NECESITA_DE]->(a) RETURN type(r)\n",
      "EJECUTADA QRY [21]> MATCH (a :MaterialB), (b  :MaterialREF) WHERE a.name = 'Gadolinium' AND b.name = 'Gadolinium_REF' CREATE (b)-[r :NECESITA_DE]->(a) RETURN type(r)\n",
      "EJECUTADA QRY [22]> MATCH (a :MaterialB), (b  :MaterialREF) WHERE a.name = 'Gallium' AND b.name = 'Gallium_REF' CREATE (b)-[r :NECESITA_DE]->(a) RETURN type(r)\n",
      "EJECUTADA QRY [23]> MATCH (a :MaterialB), (b  :MaterialREF) WHERE a.name = 'Germanium' AND b.name = 'Germanium_REF' CREATE (b)-[r :NECESITA_DE]->(a) RETURN type(r)\n",
      "EJECUTADA QRY [24]> MATCH (a :MaterialB), (b  :MaterialREF) WHERE a.name = 'Gold' AND b.name = 'Gold_REF' CREATE (b)-[r :NECESITA_DE]->(a) RETURN type(r)\n",
      "EJECUTADA QRY [25]> MATCH (a :MaterialB), (b  :MaterialREF) WHERE a.name = 'Gypsum' AND b.name = 'Gypsum_REF' CREATE (b)-[r :NECESITA_DE]->(a) RETURN type(r)\n",
      "EJECUTADA QRY [26]> MATCH (a :MaterialB), (b  :MaterialREF) WHERE a.name = 'Hafnium' AND b.name = 'Hafnium_REF' CREATE (b)-[r :NECESITA_DE]->(a) RETURN type(r)\n",
      "EJECUTADA QRY [27]> MATCH (a :MaterialB), (b  :MaterialREF) WHERE a.name = 'Helium' AND b.name = 'Helium_REF' CREATE (b)-[r :NECESITA_DE]->(a) RETURN type(r)\n",
      "EJECUTADA QRY [28]> MATCH (a :MaterialB), (b  :MaterialREF) WHERE a.name = 'Ho, Tm, Lu, Yb' AND b.name = 'Ho, Tm, Lu, Yb_REF' CREATE (b)-[r :NECESITA_DE]->(a) RETURN type(r)\n",
      "EJECUTADA QRY [29]> MATCH (a :MaterialB), (b  :MaterialREF) WHERE a.name = 'Indium' AND b.name = 'Indium_REF' CREATE (b)-[r :NECESITA_DE]->(a) RETURN type(r)\n",
      "EJECUTADA QRY [30]> MATCH (a :MaterialB), (b  :MaterialREF) WHERE a.name = 'Iridium' AND b.name = 'Iridium_REF' CREATE (b)-[r :NECESITA_DE]->(a) RETURN type(r)\n",
      "EJECUTADA QRY [31]> MATCH (a :MaterialB), (b  :MaterialREF) WHERE a.name = 'Iron ore' AND b.name = 'Iron ore_REF' CREATE (b)-[r :NECESITA_DE]->(a) RETURN type(r)\n",
      "EJECUTADA QRY [32]> MATCH (a :MaterialB), (b  :MaterialREF) WHERE a.name = 'Kaolin clay' AND b.name = 'Kaolin clay_REF' CREATE (b)-[r :NECESITA_DE]->(a) RETURN type(r)\n",
      "EJECUTADA QRY [33]> MATCH (a :MaterialB), (b  :MaterialREF) WHERE a.name = 'Lanthanum' AND b.name = 'Lanthanum_REF' CREATE (b)-[r :NECESITA_DE]->(a) RETURN type(r)\n",
      "EJECUTADA QRY [34]> MATCH (a :MaterialB), (b  :MaterialREF) WHERE a.name = 'Lead' AND b.name = 'Lead_REF' CREATE (b)-[r :NECESITA_DE]->(a) RETURN type(r)\n",
      "EJECUTADA QRY [35]> MATCH (a :MaterialB), (b  :MaterialREF) WHERE a.name = 'Limestone' AND b.name = 'Limestone_REF' CREATE (b)-[r :NECESITA_DE]->(a) RETURN type(r)\n",
      "EJECUTADA QRY [36]> MATCH (a :MaterialB), (b  :MaterialREF) WHERE a.name = 'Lithium' AND b.name = 'Lithium_REF' CREATE (b)-[r :NECESITA_DE]->(a) RETURN type(r)\n",
      "EJECUTADA QRY [37]> MATCH (a :MaterialB), (b  :MaterialREF) WHERE a.name = 'Magnesite' AND b.name = 'Magnesite_REF' CREATE (b)-[r :NECESITA_DE]->(a) RETURN type(r)\n",
      "EJECUTADA QRY [38]> MATCH (a :MaterialB), (b  :MaterialREF) WHERE a.name = 'Magnesium' AND b.name = 'Magnesium_REF' CREATE (b)-[r :NECESITA_DE]->(a) RETURN type(r)\n",
      "EJECUTADA QRY [39]> MATCH (a :MaterialB), (b  :MaterialREF) WHERE a.name = 'Manganese' AND b.name = 'Manganese_REF' CREATE (b)-[r :NECESITA_DE]->(a) RETURN type(r)\n",
      "EJECUTADA QRY [40]> MATCH (a :MaterialB), (b  :MaterialREF) WHERE a.name = 'Molybdenum' AND b.name = 'Molybdenum_REF' CREATE (b)-[r :NECESITA_DE]->(a) RETURN type(r)\n",
      "EJECUTADA QRY [41]> MATCH (a :MaterialB), (b  :MaterialREF) WHERE a.name = 'Natural cork' AND b.name = 'Natural cork_REF' CREATE (b)-[r :NECESITA_DE]->(a) RETURN type(r)\n",
      "EJECUTADA QRY [42]> MATCH (a :MaterialB), (b  :MaterialREF) WHERE a.name = 'Natural graphite' AND b.name = 'Natural graphite_REF' CREATE (b)-[r :NECESITA_DE]->(a) RETURN type(r)\n",
      "EJECUTADA QRY [43]> MATCH (a :MaterialB), (b  :MaterialREF) WHERE a.name = 'Natural Rubber' AND b.name = 'Natural Rubber_REF' CREATE (b)-[r :NECESITA_DE]->(a) RETURN type(r)\n",
      "EJECUTADA QRY [44]> MATCH (a :MaterialB), (b  :MaterialREF) WHERE a.name = 'Natural Teak wood' AND b.name = 'Natural Teak wood_REF' CREATE (b)-[r :NECESITA_DE]->(a) RETURN type(r)\n",
      "EJECUTADA QRY [45]> MATCH (a :MaterialB), (b  :MaterialREF) WHERE a.name = 'Neodymium' AND b.name = 'Neodymium_REF' CREATE (b)-[r :NECESITA_DE]->(a) RETURN type(r)\n",
      "EJECUTADA QRY [46]> MATCH (a :MaterialB), (b  :MaterialREF) WHERE a.name = 'Nickel' AND b.name = 'Nickel_REF' CREATE (b)-[r :NECESITA_DE]->(a) RETURN type(r)\n",
      "EJECUTADA QRY [47]> MATCH (a :MaterialB), (b  :MaterialREF) WHERE a.name = 'Niobium' AND b.name = 'Niobium_REF' CREATE (b)-[r :NECESITA_DE]->(a) RETURN type(r)\n",
      "EJECUTADA QRY [48]> MATCH (a :MaterialB), (b  :MaterialREF) WHERE a.name = 'Palladium' AND b.name = 'Palladium_REF' CREATE (b)-[r :NECESITA_DE]->(a) RETURN type(r)\n",
      "EJECUTADA QRY [49]> MATCH (a :MaterialB), (b  :MaterialREF) WHERE a.name = 'Perlite' AND b.name = 'Perlite_REF' CREATE (b)-[r :NECESITA_DE]->(a) RETURN type(r)\n",
      "EJECUTADA QRY [50]> MATCH (a :MaterialB), (b  :MaterialREF) WHERE a.name = 'Phosphate rock' AND b.name = 'Phosphate rock_REF' CREATE (b)-[r :NECESITA_DE]->(a) RETURN type(r)\n",
      "EJECUTADA QRY [51]> MATCH (a :MaterialB), (b  :MaterialREF) WHERE a.name = 'Phosphorus' AND b.name = 'Phosphorus_REF' CREATE (b)-[r :NECESITA_DE]->(a) RETURN type(r)\n",
      "EJECUTADA QRY [52]> MATCH (a :MaterialB), (b  :MaterialREF) WHERE a.name = 'Platinum' AND b.name = 'Platinum_REF' CREATE (b)-[r :NECESITA_DE]->(a) RETURN type(r)\n",
      "EJECUTADA QRY [53]> MATCH (a :MaterialB), (b  :MaterialREF) WHERE a.name = 'Potash' AND b.name = 'Potash_REF' CREATE (b)-[r :NECESITA_DE]->(a) RETURN type(r)\n",
      "EJECUTADA QRY [54]> MATCH (a :MaterialB), (b  :MaterialREF) WHERE a.name = 'Praseodymium' AND b.name = 'Praseodymium_REF' CREATE (b)-[r :NECESITA_DE]->(a) RETURN type(r)\n",
      "EJECUTADA QRY [55]> MATCH (a :MaterialB), (b  :MaterialREF) WHERE a.name = 'Rhenium' AND b.name = 'Rhenium_REF' CREATE (b)-[r :NECESITA_DE]->(a) RETURN type(r)\n",
      "EJECUTADA QRY [56]> MATCH (a :MaterialB), (b  :MaterialREF) WHERE a.name = 'Rhodium' AND b.name = 'Rhodium_REF' CREATE (b)-[r :NECESITA_DE]->(a) RETURN type(r)\n",
      "EJECUTADA QRY [57]> MATCH (a :MaterialB), (b  :MaterialREF) WHERE a.name = 'Ruthenium' AND b.name = 'Ruthenium_REF' CREATE (b)-[r :NECESITA_DE]->(a) RETURN type(r)\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "EJECUTADA QRY [58]> MATCH (a :MaterialB), (b  :MaterialREF) WHERE a.name = 'Samarium' AND b.name = 'Samarium_REF' CREATE (b)-[r :NECESITA_DE]->(a) RETURN type(r)\n",
      "EJECUTADA QRY [59]> MATCH (a :MaterialB), (b  :MaterialREF) WHERE a.name = 'Sapele wood' AND b.name = 'Sapele wood_REF' CREATE (b)-[r :NECESITA_DE]->(a) RETURN type(r)\n",
      "EJECUTADA QRY [60]> MATCH (a :MaterialB), (b  :MaterialREF) WHERE a.name = 'Scandium' AND b.name = 'Scandium_REF' CREATE (b)-[r :NECESITA_DE]->(a) RETURN type(r)\n",
      "EJECUTADA QRY [61]> MATCH (a :MaterialB), (b  :MaterialREF) WHERE a.name = 'Selenium' AND b.name = 'Selenium_REF' CREATE (b)-[r :NECESITA_DE]->(a) RETURN type(r)\n",
      "EJECUTADA QRY [62]> MATCH (a :MaterialB), (b  :MaterialREF) WHERE a.name = 'Silica sand' AND b.name = 'Silica sand_REF' CREATE (b)-[r :NECESITA_DE]->(a) RETURN type(r)\n",
      "EJECUTADA QRY [63]> MATCH (a :MaterialB), (b  :MaterialREF) WHERE a.name = 'Silicon metal' AND b.name = 'Silicon metal_REF' CREATE (b)-[r :NECESITA_DE]->(a) RETURN type(r)\n",
      "EJECUTADA QRY [64]> MATCH (a :MaterialB), (b  :MaterialREF) WHERE a.name = 'Silver' AND b.name = 'Silver_REF' CREATE (b)-[r :NECESITA_DE]->(a) RETURN type(r)\n",
      "EJECUTADA QRY [65]> MATCH (a :MaterialB), (b  :MaterialREF) WHERE a.name = 'Strontium' AND b.name = 'Strontium_REF' CREATE (b)-[r :NECESITA_DE]->(a) RETURN type(r)\n",
      "EJECUTADA QRY [66]> MATCH (a :MaterialB), (b  :MaterialREF) WHERE a.name = 'Sulphur' AND b.name = 'Sulphur_REF' CREATE (b)-[r :NECESITA_DE]->(a) RETURN type(r)\n",
      "EJECUTADA QRY [67]> MATCH (a :MaterialB), (b  :MaterialREF) WHERE a.name = 'Talc' AND b.name = 'Talc_REF' CREATE (b)-[r :NECESITA_DE]->(a) RETURN type(r)\n",
      "EJECUTADA QRY [68]> MATCH (a :MaterialB), (b  :MaterialREF) WHERE a.name = 'Tantalum' AND b.name = 'Tantalum_REF' CREATE (b)-[r :NECESITA_DE]->(a) RETURN type(r)\n",
      "EJECUTADA QRY [69]> MATCH (a :MaterialB), (b  :MaterialREF) WHERE a.name = 'Tellurium' AND b.name = 'Tellurium_REF' CREATE (b)-[r :NECESITA_DE]->(a) RETURN type(r)\n",
      "EJECUTADA QRY [70]> MATCH (a :MaterialB), (b  :MaterialREF) WHERE a.name = 'Terbium' AND b.name = 'Terbium_REF' CREATE (b)-[r :NECESITA_DE]->(a) RETURN type(r)\n",
      "EJECUTADA QRY [71]> MATCH (a :MaterialB), (b  :MaterialREF) WHERE a.name = 'Tin' AND b.name = 'Tin_REF' CREATE (b)-[r :NECESITA_DE]->(a) RETURN type(r)\n",
      "EJECUTADA QRY [72]> MATCH (a :MaterialB), (b  :MaterialREF) WHERE a.name = 'Titanium' AND b.name = 'Titanium_REF' CREATE (b)-[r :NECESITA_DE]->(a) RETURN type(r)\n",
      "EJECUTADA QRY [73]> MATCH (a :MaterialB), (b  :MaterialREF) WHERE a.name = 'Tungsten' AND b.name = 'Tungsten_REF' CREATE (b)-[r :NECESITA_DE]->(a) RETURN type(r)\n",
      "EJECUTADA QRY [74]> MATCH (a :MaterialB), (b  :MaterialREF) WHERE a.name = 'Vanadium' AND b.name = 'Vanadium_REF' CREATE (b)-[r :NECESITA_DE]->(a) RETURN type(r)\n",
      "EJECUTADA QRY [75]> MATCH (a :MaterialB), (b  :MaterialREF) WHERE a.name = 'Yttrium' AND b.name = 'Yttrium_REF' CREATE (b)-[r :NECESITA_DE]->(a) RETURN type(r)\n",
      "EJECUTADA QRY [76]> MATCH (a :MaterialB), (b  :MaterialREF) WHERE a.name = 'Zinc' AND b.name = 'Zinc_REF' CREATE (b)-[r :NECESITA_DE]->(a) RETURN type(r)\n",
      "EJECUTADA QRY [77]> MATCH (a :MaterialB), (b  :MaterialREF) WHERE a.name = 'Zirconium' AND b.name = 'Zirconium_REF' CREATE (b)-[r :NECESITA_DE]->(a) RETURN type(r)\n"
     ]
    }
   ],
   "source": [
    "# Crear en BD Neo4J todas  las relaciones NECESITA_DE\n",
    "TipoNodoA = \" :MaterialB\" \n",
    "TipoNodoB = \" :MaterialREF\" \n",
    "TipoRelacion = \" :NECESITA_DE\"\n",
    "inicio = 0\n",
    "nFilas = dfMateriales.shape[0]\n",
    "#\n",
    "for i in range(inicio, nFilas):\n",
    "    strQry = \"MATCH (a\"                                    \\\n",
    "            + TipoNodoA                                        \\\n",
    "            + \"), (b \" + TipoNodoB                            \\\n",
    "            + \") WHERE a.name = '\"                             \\\n",
    "            +  dfMateriales.Material[i]                       \\\n",
    "            + \"'\"                                             \\\n",
    "            + \" AND b.name = '\"                               \\\n",
    "            +  dfMateriales.Material[i]                      \\\n",
    "            + \"_REF'\"                                         \\\n",
    "            + \" CREATE (b)-[r\"                               \\\n",
    "            + TipoRelacion                                    \\\n",
    "            + \"]->(a)\"                                        \\\n",
    "            + \" RETURN type(r)\"                                 \n",
    "#   lanzar query CQL en la BD\n",
    "    graph_test01.run(strQry)\n",
    "#   Visualizar la Query lanzada\n",
    "    print(\"EJECUTADA QRY [\" + str(i) + \"]> \"+ strQry)\n",
    "#--fin for---\n",
    "#\n",
    "# relaciones creadas"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "id": "8e97ade6",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>TipoRelacion</th>\n",
       "      <th>Ntotal</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>INCLUIDO_EN</td>\n",
       "      <td>442</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>USADO_EN</td>\n",
       "      <td>442</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>REFINA</td>\n",
       "      <td>475</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>EXTRAE</td>\n",
       "      <td>699</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>NECESITA_DE</td>\n",
       "      <td>100</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "  TipoRelacion  Ntotal\n",
       "0  INCLUIDO_EN     442\n",
       "1     USADO_EN     442\n",
       "2       REFINA     475\n",
       "3       EXTRAE     699\n",
       "4  NECESITA_DE     100"
      ]
     },
     "execution_count": 25,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#validamos que todas las RELACIONES se han creado (hasta este paso)\n",
    "queryPRB= \"MATCH n=()-[r:INCLUIDO_EN]->()              \\\n",
    "RETURN type(r) as TipoRelacion, count (r) as Ntotal    \\\n",
    "UNION MATCH m=()-[p:USADO_EN]->()                      \\\n",
    "RETURN type(p) as TipoRelacion, count (p) as Ntotal    \\\n",
    "UNION MATCH m=()-[p:REFINA]->()                        \\\n",
    "RETURN type(p) as TipoRelacion, count (p) as Ntotal    \\\n",
    "UNION MATCH m=()-[p:EXTRAE]->()                        \\\n",
    "RETURN type(p) as TipoRelacion, count (p) as Ntotal    \\\n",
    "UNION MATCH m=()-[p:NECESITA_DE]->()                   \\\n",
    "RETURN type(p) as TipoRelacion, count (p) as Ntotal\" \n",
    "\n",
    "graph_test01.run(queryPRB).to_data_frame()"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "c5dfda14",
   "metadata": {},
   "source": [
    "# CREAR RELACION _-NECESITA_DE-_ para lista ADICIONAL de materiales entre   :MaterialB y  Material de Origen (:MaterialREF o :MaterialB) cuyo  tipo es determinado según el número de etapa de su obtención (EtapaBase con valores 1  para REF ó 2 para B ). En el caso de Material origen no especificado en las tablas de dataset del estudio de partida, se añaden algunos nuevos por completitud del grafo (material origen comenzando por \"N-\" será creado).\n",
    "## 1- Carga del fichero de dependencias adicionales de materiales\n",
    "## 2- Crear nodos de materiales adicionales (si aplica - \"comienzo por \"N-\")\n",
    "## 3- Crear relación NECESITA_DE entre materiales adicionales BRUTOS y material de origen \n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "9b8c1c8e",
   "metadata": {},
   "source": [
    "## 1- Carga del fichero de dependencias adicionales de materiales"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 27,
   "id": "af2527e6",
   "metadata": {},
   "outputs": [],
   "source": [
    "#DATOS: Fichero con MATERIALES y MATERIALES ORIGEN PRIMAS de los que NECESITA adicionalmente\n",
    "#       según elsuministro GLOBAL - Atendiendo al alcance del estudio - EU CRM 2020\n",
    "#FICHERO: GLAddMatDepend_Cargar.csv\n",
    "#CONTENIDO: relación de Materiales y Materiales Origen para fijar relaciones NECESITA_DE adicionales a las estándar \n",
    "#USO: Crear relación \"NECESITA_DE\" entre materiales adicionales: columna \"Material\" y columna \"MaterialOrg\" \n",
    "rutaFichero =  \"https://raw.githubusercontent.com/JuanKFD/UNIR_TFM/main/GLAddMatDepend_Cargar.csv\" \n",
    "dfMaterialADIC = pd.read_csv(rutaFichero, sep=';')\n",
    "# NOTA.- el fichero admite 3 columnas adicionales para usos futuros"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 29,
   "id": "5cfd1675",
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Material</th>\n",
       "      <th>MaterialOrg</th>\n",
       "      <th>EtapaBase</th>\n",
       "      <th>Unnamed: 3</th>\n",
       "      <th>Unnamed: 4</th>\n",
       "      <th>Unnamed: 5</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Aluminium</td>\n",
       "      <td>Bauxite</td>\n",
       "      <td>1</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Arsenic</td>\n",
       "      <td>Copper</td>\n",
       "      <td>1</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Arsenic</td>\n",
       "      <td>Zinc</td>\n",
       "      <td>1</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Cadmium</td>\n",
       "      <td>Zinc</td>\n",
       "      <td>1</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Germanium</td>\n",
       "      <td>Zinc</td>\n",
       "      <td>1</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>Hafnium</td>\n",
       "      <td>Zirconium</td>\n",
       "      <td>1</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>Selenium</td>\n",
       "      <td>Copper</td>\n",
       "      <td>1</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>Tellurium</td>\n",
       "      <td>Copper</td>\n",
       "      <td>1</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>Iridium</td>\n",
       "      <td>Nickel</td>\n",
       "      <td>1</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>Palladium</td>\n",
       "      <td>Nickel</td>\n",
       "      <td>1</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>Platinum</td>\n",
       "      <td>Nickel</td>\n",
       "      <td>1</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>Rhodium</td>\n",
       "      <td>Nickel</td>\n",
       "      <td>1</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>Ruthenium</td>\n",
       "      <td>Nickel</td>\n",
       "      <td>1</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>Iridium</td>\n",
       "      <td>Copper</td>\n",
       "      <td>1</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>Palladium</td>\n",
       "      <td>Copper</td>\n",
       "      <td>1</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>Platinum</td>\n",
       "      <td>Copper</td>\n",
       "      <td>1</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>Rhodium</td>\n",
       "      <td>Copper</td>\n",
       "      <td>1</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>Ruthenium</td>\n",
       "      <td>Copper</td>\n",
       "      <td>1</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>Sulphur</td>\n",
       "      <td>Coking coal</td>\n",
       "      <td>2</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19</th>\n",
       "      <td>Sulphur</td>\n",
       "      <td>N-Fossil Fuels</td>\n",
       "      <td>2</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>20</th>\n",
       "      <td>Sulphur</td>\n",
       "      <td>N-Natural gas</td>\n",
       "      <td>2</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>21</th>\n",
       "      <td>Sulphur</td>\n",
       "      <td>N-Sulphur</td>\n",
       "      <td>1</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "     Material     MaterialOrg  EtapaBase  Unnamed: 3  Unnamed: 4  Unnamed: 5\n",
       "0   Aluminium         Bauxite          1         NaN         NaN         NaN\n",
       "1     Arsenic          Copper          1         NaN         NaN         NaN\n",
       "2     Arsenic            Zinc          1         NaN         NaN         NaN\n",
       "3     Cadmium            Zinc          1         NaN         NaN         NaN\n",
       "4   Germanium            Zinc          1         NaN         NaN         NaN\n",
       "5     Hafnium       Zirconium          1         NaN         NaN         NaN\n",
       "6    Selenium          Copper          1         NaN         NaN         NaN\n",
       "7   Tellurium          Copper          1         NaN         NaN         NaN\n",
       "8     Iridium          Nickel          1         NaN         NaN         NaN\n",
       "9   Palladium          Nickel          1         NaN         NaN         NaN\n",
       "10   Platinum          Nickel          1         NaN         NaN         NaN\n",
       "11    Rhodium          Nickel          1         NaN         NaN         NaN\n",
       "12  Ruthenium          Nickel          1         NaN         NaN         NaN\n",
       "13    Iridium          Copper          1         NaN         NaN         NaN\n",
       "14  Palladium          Copper          1         NaN         NaN         NaN\n",
       "15   Platinum          Copper          1         NaN         NaN         NaN\n",
       "16    Rhodium          Copper          1         NaN         NaN         NaN\n",
       "17  Ruthenium          Copper          1         NaN         NaN         NaN\n",
       "18    Sulphur     Coking coal          2         NaN         NaN         NaN\n",
       "19    Sulphur  N-Fossil Fuels          2         NaN         NaN         NaN\n",
       "20    Sulphur   N-Natural gas          2         NaN         NaN         NaN\n",
       "21    Sulphur       N-Sulphur          1         NaN         NaN         NaN"
      ]
     },
     "execution_count": 29,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "dfMaterialADIC.head(22)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 30,
   "id": "8b1d70e7",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Material</th>\n",
       "      <th>MaterialOrg</th>\n",
       "      <th>EtapaBase</th>\n",
       "      <th>Unnamed: 3</th>\n",
       "      <th>Unnamed: 4</th>\n",
       "      <th>Unnamed: 5</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>Ruthenium</td>\n",
       "      <td>Copper</td>\n",
       "      <td>1</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>Sulphur</td>\n",
       "      <td>Coking coal</td>\n",
       "      <td>2</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19</th>\n",
       "      <td>Sulphur</td>\n",
       "      <td>N-Fossil Fuels</td>\n",
       "      <td>2</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>20</th>\n",
       "      <td>Sulphur</td>\n",
       "      <td>N-Natural gas</td>\n",
       "      <td>2</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>21</th>\n",
       "      <td>Sulphur</td>\n",
       "      <td>N-Sulphur</td>\n",
       "      <td>1</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "     Material     MaterialOrg  EtapaBase  Unnamed: 3  Unnamed: 4  Unnamed: 5\n",
       "17  Ruthenium          Copper          1         NaN         NaN         NaN\n",
       "18    Sulphur     Coking coal          2         NaN         NaN         NaN\n",
       "19    Sulphur  N-Fossil Fuels          2         NaN         NaN         NaN\n",
       "20    Sulphur   N-Natural gas          2         NaN         NaN         NaN\n",
       "21    Sulphur       N-Sulphur          1         NaN         NaN         NaN"
      ]
     },
     "execution_count": 30,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "dfMaterialADIC.tail()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 31,
   "id": "da33e4e5",
   "metadata": {
    "scrolled": false
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "(22, 6)"
      ]
     },
     "execution_count": 31,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "dfMaterialADIC.shape"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 32,
   "id": "323184ce",
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "Index(['Material', 'MaterialOrg', 'EtapaBase', 'Unnamed: 3', 'Unnamed: 4',\n",
       "       'Unnamed: 5'],\n",
       "      dtype='object')"
      ]
     },
     "execution_count": 32,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "dfMaterialADIC.columns"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 33,
   "id": "4a75d081",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "QRY [0]> MATCH (a :MaterialB), (b  :MaterialB) WHERE a.name = 'Aluminium' AND b.name = 'Bauxite' CREATE (a)-[r :NECESITA_DE]->(b) RETURN type(r)\n",
      "QRY [1]> MATCH (a :MaterialB), (b  :MaterialB) WHERE a.name = 'Arsenic' AND b.name = 'Copper' CREATE (a)-[r :NECESITA_DE]->(b) RETURN type(r)\n",
      "QRY [2]> MATCH (a :MaterialB), (b  :MaterialB) WHERE a.name = 'Arsenic' AND b.name = 'Zinc' CREATE (a)-[r :NECESITA_DE]->(b) RETURN type(r)\n",
      "QRY [3]> MATCH (a :MaterialB), (b  :MaterialB) WHERE a.name = 'Cadmium' AND b.name = 'Zinc' CREATE (a)-[r :NECESITA_DE]->(b) RETURN type(r)\n",
      "QRY [4]> MATCH (a :MaterialB), (b  :MaterialB) WHERE a.name = 'Germanium' AND b.name = 'Zinc' CREATE (a)-[r :NECESITA_DE]->(b) RETURN type(r)\n",
      "QRY [5]> MATCH (a :MaterialB), (b  :MaterialB) WHERE a.name = 'Hafnium' AND b.name = 'Zirconium' CREATE (a)-[r :NECESITA_DE]->(b) RETURN type(r)\n",
      "QRY [6]> MATCH (a :MaterialB), (b  :MaterialB) WHERE a.name = 'Selenium' AND b.name = 'Copper' CREATE (a)-[r :NECESITA_DE]->(b) RETURN type(r)\n",
      "QRY [7]> MATCH (a :MaterialB), (b  :MaterialB) WHERE a.name = 'Tellurium' AND b.name = 'Copper' CREATE (a)-[r :NECESITA_DE]->(b) RETURN type(r)\n",
      "QRY [8]> MATCH (a :MaterialB), (b  :MaterialB) WHERE a.name = 'Iridium' AND b.name = 'Nickel' CREATE (a)-[r :NECESITA_DE]->(b) RETURN type(r)\n",
      "QRY [9]> MATCH (a :MaterialB), (b  :MaterialB) WHERE a.name = 'Palladium' AND b.name = 'Nickel' CREATE (a)-[r :NECESITA_DE]->(b) RETURN type(r)\n",
      "QRY [10]> MATCH (a :MaterialB), (b  :MaterialB) WHERE a.name = 'Platinum' AND b.name = 'Nickel' CREATE (a)-[r :NECESITA_DE]->(b) RETURN type(r)\n",
      "QRY [11]> MATCH (a :MaterialB), (b  :MaterialB) WHERE a.name = 'Rhodium' AND b.name = 'Nickel' CREATE (a)-[r :NECESITA_DE]->(b) RETURN type(r)\n",
      "QRY [12]> MATCH (a :MaterialB), (b  :MaterialB) WHERE a.name = 'Ruthenium' AND b.name = 'Nickel' CREATE (a)-[r :NECESITA_DE]->(b) RETURN type(r)\n",
      "QRY [13]> MATCH (a :MaterialB), (b  :MaterialB) WHERE a.name = 'Iridium' AND b.name = 'Copper' CREATE (a)-[r :NECESITA_DE]->(b) RETURN type(r)\n",
      "QRY [14]> MATCH (a :MaterialB), (b  :MaterialB) WHERE a.name = 'Palladium' AND b.name = 'Copper' CREATE (a)-[r :NECESITA_DE]->(b) RETURN type(r)\n",
      "QRY [15]> MATCH (a :MaterialB), (b  :MaterialB) WHERE a.name = 'Platinum' AND b.name = 'Copper' CREATE (a)-[r :NECESITA_DE]->(b) RETURN type(r)\n",
      "QRY [16]> MATCH (a :MaterialB), (b  :MaterialB) WHERE a.name = 'Rhodium' AND b.name = 'Copper' CREATE (a)-[r :NECESITA_DE]->(b) RETURN type(r)\n",
      "QRY [17]> MATCH (a :MaterialB), (b  :MaterialB) WHERE a.name = 'Ruthenium' AND b.name = 'Copper' CREATE (a)-[r :NECESITA_DE]->(b) RETURN type(r)\n",
      "QRY [18]> MATCH (a :MaterialB), (b  :MaterialREF) WHERE a.name = 'Sulphur' AND b.name = 'Coking coal_REF' CREATE (a)-[r :NECESITA_DE]->(b) RETURN type(r)\n",
      "EJEC. CREA NODO [19]> CREATE (m  :MaterialREF {name: 'N-Fossil Fuels_REF', nuevo: 'SI'})\n",
      "QRY [19]> MATCH (a :MaterialB), (b  :MaterialREF) WHERE a.name = 'Sulphur' AND b.name = 'N-Fossil Fuels_REF' CREATE (a)-[r :NECESITA_DE]->(b) RETURN type(r)\n",
      "EJEC. CREA NODO [20]> CREATE (m  :MaterialREF {name: 'N-Natural gas_REF', nuevo: 'SI'})\n",
      "QRY [20]> MATCH (a :MaterialB), (b  :MaterialREF) WHERE a.name = 'Sulphur' AND b.name = 'N-Natural gas_REF' CREATE (a)-[r :NECESITA_DE]->(b) RETURN type(r)\n",
      "EJEC. CREA NODO [21]> CREATE (m  :MaterialB {name: 'N-Sulphur', nuevo: 'SI'})\n",
      "QRY [21]> MATCH (a :MaterialB), (b  :MaterialB) WHERE a.name = 'Sulphur' AND b.name = 'N-Sulphur' CREATE (a)-[r :NECESITA_DE]->(b) RETURN type(r)\n"
     ]
    }
   ],
   "source": [
    "# REGLAS DEL PROCESO:\n",
    "#     Si EtapaBase == '1', \n",
    "#             entonces la relación Material es con  MaterialOrg de TipoNODOAsignar= \":MaterialB\" y SUFIJOorg = \"\"    \n",
    "#     Si EtapaBase == '2', \n",
    "#             entonces la relación Material es con  MaterialOrg de TipoNODOAsignar= \":MaterialREF\" y SUFIJOorg = \"_REF\"\n",
    "#     Si MaterialOrg[0:2] == \"N-\",  ---- material NUEVO inexistente y hay que crearlo ----\n",
    "#             entonces \n",
    "#                  CREAR NODO del tipo TipoNODOAsignar y  name MaterialOrg+SUFIJOOrg  y con propiedad {nuevo: \"SI\"}\n",
    "#\n",
    "#     CREAR RELACION \"NECESITA_DE\" entre MaterialB name= Material  y  :TipoNODOAsignar con name MaterialOrg+SUFIJOOrg  \n",
    "##\n",
    "# Crear en BD Neo4J todas  las relaciones NECESITA_DE\n",
    "TipoNodoA = \" :MaterialB\" \n",
    "TipoNodoB = \" :MaterialREF\" \n",
    "TipoRelacion = \" :NECESITA_DE\"\n",
    "PrefijoNUEVOMat = 'N-'\n",
    "SUFIJOorg = \"\"\n",
    "inicioADIC = 0\n",
    "nFilasADIC = dfMaterialADIC.shape[0]\n",
    "#\n",
    "for i in range(inicio, nFilasADIC):\n",
    "    TipoNODOAsignar=\"\"\n",
    "    SUFIJOorg = \"\"\n",
    "    if dfMaterialADIC.EtapaBase[i] == 1:                                        #caso de material origen Bruto\n",
    "        TipoNODOAsignar = TipoNodoA\n",
    "        SUFIJOorg = \"\"\n",
    "    elif dfMaterialADIC.EtapaBase[i] == 2:                                   #caso de material origen Refinado\n",
    "        TipoNODOAsignar = TipoNodoB\n",
    "        SUFIJOorg = \"_REF\"\n",
    "    else:                                                       #caso -error- que NO debería darse \n",
    "        TipoNODOAsignar = \":tipo_error\"\n",
    "        SUFIJOorg = \"_err\"\n",
    "# control si hay que crear un nodo de material NUEVO\n",
    "    if dfMaterialADIC.MaterialOrg[i][0:2] == PrefijoNUEVOMat:   #caso de crear nuevo nodo material\n",
    "        strQryCRND = \"CREATE (m \"                       \\\n",
    "        + TipoNODOAsignar                                \\\n",
    "        + \" {name: '\"                                    \\\n",
    "        +  dfMaterialADIC.MaterialOrg[i]+SUFIJOorg          \\\n",
    "        +  \"', nuevo: '\"          \\\n",
    "        + \"SI\"                                           \\\n",
    "        +\"'})\"\n",
    "        print(\"EJEC. CREA NODO [\" + str(i) + \"]> \"+ strQryCRND)\n",
    "        \n",
    "# se haya creado nodo origen o se usen nodos existentes, crear la relación NECESITA_DE adicional entre los nodos\n",
    "    strQry = \"MATCH (a\"                                    \\\n",
    "            + TipoNodoA                                     \\\n",
    "            + \"), (b \" + TipoNODOAsignar                     \\\n",
    "            + \") WHERE a.name = '\"                          \\\n",
    "            +  dfMaterialADIC.Material[i]                    \\\n",
    "            + \"'\"                                           \\\n",
    "            + \" AND b.name = '\"                             \\\n",
    "            +  dfMaterialADIC.MaterialOrg[i]+SUFIJOorg         \\\n",
    "            + \"' CREATE (a)-[r\"                               \\\n",
    "            + TipoRelacion                                   \\\n",
    "            + \"]->(b)\"                                        \\\n",
    "            + \" RETURN type(r)\"                                 \n",
    "# Visualizar la Query lanzada\n",
    "    print(\"QRY [\" + str(i) + \"]> \"+ strQry)\n",
    "#\n",
    "# queries preparadas y visualizadas para control"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 86,
   "id": "11b3d875",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "EJEC. QRY [0]> MATCH (a :MaterialB), (b  :MaterialB) WHERE a.name = 'Aluminium' AND b.name = 'Bauxite' CREATE (a)-[r :NECESITA_DE]->(b) RETURN type(r)\n",
      "EJEC. QRY [1]> MATCH (a :MaterialB), (b  :MaterialB) WHERE a.name = 'Arsenic' AND b.name = 'Copper' CREATE (a)-[r :NECESITA_DE]->(b) RETURN type(r)\n",
      "EJEC. QRY [2]> MATCH (a :MaterialB), (b  :MaterialB) WHERE a.name = 'Arsenic' AND b.name = 'Zinc' CREATE (a)-[r :NECESITA_DE]->(b) RETURN type(r)\n",
      "EJEC. QRY [3]> MATCH (a :MaterialB), (b  :MaterialB) WHERE a.name = 'Cadmium' AND b.name = 'Zinc' CREATE (a)-[r :NECESITA_DE]->(b) RETURN type(r)\n",
      "EJEC. QRY [4]> MATCH (a :MaterialB), (b  :MaterialB) WHERE a.name = 'Germanium' AND b.name = 'Zinc' CREATE (a)-[r :NECESITA_DE]->(b) RETURN type(r)\n",
      "EJEC. QRY [5]> MATCH (a :MaterialB), (b  :MaterialB) WHERE a.name = 'Hafnium' AND b.name = 'Zirconium' CREATE (a)-[r :NECESITA_DE]->(b) RETURN type(r)\n",
      "EJEC. QRY [6]> MATCH (a :MaterialB), (b  :MaterialB) WHERE a.name = 'Selenium' AND b.name = 'Copper' CREATE (a)-[r :NECESITA_DE]->(b) RETURN type(r)\n",
      "EJEC. QRY [7]> MATCH (a :MaterialB), (b  :MaterialB) WHERE a.name = 'Tellurium' AND b.name = 'Copper' CREATE (a)-[r :NECESITA_DE]->(b) RETURN type(r)\n",
      "EJEC. QRY [8]> MATCH (a :MaterialB), (b  :MaterialB) WHERE a.name = 'Iridium' AND b.name = 'Nickel' CREATE (a)-[r :NECESITA_DE]->(b) RETURN type(r)\n",
      "EJEC. QRY [9]> MATCH (a :MaterialB), (b  :MaterialB) WHERE a.name = 'Palladium' AND b.name = 'Nickel' CREATE (a)-[r :NECESITA_DE]->(b) RETURN type(r)\n",
      "EJEC. QRY [10]> MATCH (a :MaterialB), (b  :MaterialB) WHERE a.name = 'Platinum' AND b.name = 'Nickel' CREATE (a)-[r :NECESITA_DE]->(b) RETURN type(r)\n",
      "EJEC. QRY [11]> MATCH (a :MaterialB), (b  :MaterialB) WHERE a.name = 'Rhodium' AND b.name = 'Nickel' CREATE (a)-[r :NECESITA_DE]->(b) RETURN type(r)\n",
      "EJEC. QRY [12]> MATCH (a :MaterialB), (b  :MaterialB) WHERE a.name = 'Ruthenium' AND b.name = 'Nickel' CREATE (a)-[r :NECESITA_DE]->(b) RETURN type(r)\n",
      "EJEC. QRY [13]> MATCH (a :MaterialB), (b  :MaterialB) WHERE a.name = 'Iridium' AND b.name = 'Copper' CREATE (a)-[r :NECESITA_DE]->(b) RETURN type(r)\n",
      "EJEC. QRY [14]> MATCH (a :MaterialB), (b  :MaterialB) WHERE a.name = 'Palladium' AND b.name = 'Copper' CREATE (a)-[r :NECESITA_DE]->(b) RETURN type(r)\n",
      "EJEC. QRY [15]> MATCH (a :MaterialB), (b  :MaterialB) WHERE a.name = 'Platinum' AND b.name = 'Copper' CREATE (a)-[r :NECESITA_DE]->(b) RETURN type(r)\n",
      "EJEC. QRY [16]> MATCH (a :MaterialB), (b  :MaterialB) WHERE a.name = 'Rhodium' AND b.name = 'Copper' CREATE (a)-[r :NECESITA_DE]->(b) RETURN type(r)\n",
      "EJEC. QRY [17]> MATCH (a :MaterialB), (b  :MaterialB) WHERE a.name = 'Ruthenium' AND b.name = 'Copper' CREATE (a)-[r :NECESITA_DE]->(b) RETURN type(r)\n",
      "EJEC. QRY [18]> MATCH (a :MaterialB), (b  :MaterialREF) WHERE a.name = 'Sulphur' AND b.name = 'Coking coal_REF' CREATE (a)-[r :NECESITA_DE]->(b) RETURN type(r)\n",
      "EJEC. CREA NODO [19]> CREATE (m  :MaterialREF {name: 'N-Fossil Fuels_REF', nuevo: 'SI'})\n",
      "EJEC. QRY [19]> MATCH (a :MaterialB), (b  :MaterialREF) WHERE a.name = 'Sulphur' AND b.name = 'N-Fossil Fuels_REF' CREATE (a)-[r :NECESITA_DE]->(b) RETURN type(r)\n",
      "EJEC. CREA NODO [20]> CREATE (m  :MaterialREF {name: 'N-Natural gas_REF', nuevo: 'SI'})\n",
      "EJEC. QRY [20]> MATCH (a :MaterialB), (b  :MaterialREF) WHERE a.name = 'Sulphur' AND b.name = 'N-Natural gas_REF' CREATE (a)-[r :NECESITA_DE]->(b) RETURN type(r)\n",
      "EJEC. CREA NODO [21]> CREATE (m  :MaterialB {name: 'N-Sulphur', nuevo: 'SI'})\n",
      "EJEC. QRY [21]> MATCH (a :MaterialB), (b  :MaterialB) WHERE a.name = 'Sulphur' AND b.name = 'N-Sulphur' CREATE (a)-[r :NECESITA_DE]->(b) RETURN type(r)\n"
     ]
    }
   ],
   "source": [
    "# REGLAS DEL PROCESO:\n",
    "#     Si EtapaBase == '1', \n",
    "#             entonces la relación Material es con  MaterialOrg de TipoNODOAsignar= \":MaterialB\" y SUFIJOorg = \"\"    \n",
    "#     Si EtapaBase == '2', \n",
    "#             entonces la relación Material es con  MaterialOrg de TipoNODOAsignar= \":MaterialREF\" y SUFIJOorg = \"_REF\"\n",
    "#     Si MaterialOrg[0:2] == \"N-\",  ---- material NUEVO inexistente y hay que crearlo ----\n",
    "#             entonces \n",
    "#                  CREAR NODO del tipo TipoNODOAsignar y  name MaterialOrg+SUFIJOOrg  y con propiedad {nuevo: \"SI\"}\n",
    "#\n",
    "#     CREAR RELACION \"NECESITA_DE\" entre MaterialB name= Material  y  :TipoNODOAsignar con name MaterialOrg+SUFIJOOrg  \n",
    "##\n",
    "# Crear en BD Neo4J todas  las relaciones NECESITA_DE\n",
    "TipoNodoA = \" :MaterialB\" \n",
    "TipoNodoB = \" :MaterialREF\" \n",
    "TipoRelacion = \" :NECESITA_DE\"\n",
    "PrefijoNUEVOMat = 'N-'\n",
    "SUFIJOorg = \"\"\n",
    "inicioADIC = 0\n",
    "nFilasADIC = dfMaterialADIC.shape[0]\n",
    "#\n",
    "for i in range(inicio, nFilasADIC):\n",
    "    TipoNODOAsignar=\"\"\n",
    "    SUFIJOorg = \"\"\n",
    "    if dfMaterialADIC.EtapaBase[i] == 1:                                        #caso de material origen Bruto\n",
    "        TipoNODOAsignar = TipoNodoA\n",
    "        SUFIJOorg = \"\"\n",
    "    elif dfMaterialADIC.EtapaBase[i] == 2:                                   #caso de material origen Refinado\n",
    "        TipoNODOAsignar = TipoNodoB\n",
    "        SUFIJOorg = \"_REF\"\n",
    "    else:                                                       #caso -error- que NO debería darse \n",
    "        TipoNODOAsignar = \":tipo_error\"\n",
    "        SUFIJOorg = \"_err\"\n",
    "# control si hay que crear un nodo de material NUEVO\n",
    "    if dfMaterialADIC.MaterialOrg[i][0:2] == PrefijoNUEVOMat:   #caso de crear nuevo nodo material\n",
    "        strQryCRND = \"CREATE (m \"                       \\\n",
    "        + TipoNODOAsignar                                \\\n",
    "        + \" {name: '\"                                    \\\n",
    "        +  dfMaterialADIC.MaterialOrg[i]+SUFIJOorg          \\\n",
    "        +  \"', nuevo: '\"          \\\n",
    "        + \"SI\"                                           \\\n",
    "        +\"'})\"\n",
    "        print(\"EJEC. CREA NODO [\" + str(i) + \"]> \"+ strQryCRND)\n",
    "# lanzar query CQL de crear NODO en la BD si es necesario por las condiciones del if\n",
    "        graph_test01.run(strQryCRND)\n",
    "        \n",
    "# se haya creado nodo origen o se usen nodos existentes, crear la relación NECESITA_DE adicional entre los nodos\n",
    "    strQry = \"MATCH (a\"                                    \\\n",
    "            + TipoNodoA                                     \\\n",
    "            + \"), (b \" + TipoNODOAsignar                     \\\n",
    "            + \") WHERE a.name = '\"                          \\\n",
    "            +  dfMaterialADIC.Material[i]                    \\\n",
    "            + \"'\"                                           \\\n",
    "            + \" AND b.name = '\"                             \\\n",
    "            +  dfMaterialADIC.MaterialOrg[i]+SUFIJOorg         \\\n",
    "            + \"' CREATE (a)-[r\"                               \\\n",
    "            + TipoRelacion                                   \\\n",
    "            + \"]->(b)\"                                        \\\n",
    "            + \" RETURN type(r)\"                                 \n",
    "# lanzar query CQL en la BD para CREAR LA RELACION\n",
    "    graph_test01.run(strQry)\n",
    "# Visualizar la Query lanzada\n",
    "    print(\"EJEC. QRY [\" + str(i) + \"]> \"+ strQry)\n",
    "#\n",
    "# RELACIONES CREADAS y NODOS \"nuevos\" cuando es necesario\n",
    "#"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "aee44cef",
   "metadata": {},
   "source": [
    "# Fin proceso - RELACIONES CREADAS ENTRE MATERIALES ADICIONALES-Creados también los NODOS de materiales nuevos al estudio con prefijo \"N-\" cuando así está marcado en el fichero de datos- MaterialOrg con ese prefijo. "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "id": "df4c6f03",
   "metadata": {},
   "outputs": [],
   "source": [
    "# fin archivo"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.7.1"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
