{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "8f9b66a4",
   "metadata": {},
   "source": [
    "# TFM Suministro Global - CREAR RELACIONES: \n",
    "##    > CREAR relación Material --[ USADO_EN] -->  Grupo de Aplicación/uso\n",
    "## _Neo4j - py2neo_\n",
    "**OBSERVACIONES**  \n",
    "Ya creada la relación:  Grupos Aplicación/usos --[**INCLUIDO_EN**] -->  Sectores NACE2\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "fe7813af",
   "metadata": {},
   "source": [
    "## Partimos de la existencia, en paralelo a esta ejecución, de una instancia levantada y accesible de Neo4j  \n",
    "### La primera vez que se quiera usar _py2neo_ erá  necesario asegurar su instalación:  _!pip install py2neo_"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "7b420b33",
   "metadata": {
    "scrolled": true
   },
   "outputs": [],
   "source": [
    "##!pip install py2neo "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "6d9f652c",
   "metadata": {},
   "outputs": [],
   "source": [
    "#importar la librería para poder hacer uso de sus funcionalidades y objetos\n",
    "from py2neo import *"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "dc45043b",
   "metadata": {},
   "outputs": [],
   "source": [
    "#acceder a la instancia levantada de Neo4j - en nuestro caso instancia Docker - asignamos credenciales de autentificación -\n",
    "graph_test01 = Graph(auth=('neo4j', 's3cr3t'))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "id": "0bdda4f9",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "Graph('bolt://localhost:7687')"
      ]
     },
     "execution_count": 7,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#que es el objeto - graph_test01\n",
    "graph_test01"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "id": "ae88b5a3",
   "metadata": {},
   "outputs": [],
   "source": [
    "#que es el objeto - tx\n",
    "# tx = graph_test01.begin()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "id": "07d7aa84",
   "metadata": {},
   "outputs": [],
   "source": [
    "# tx"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "id": "b5ee1622",
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>name</th>\n",
       "      <th>Ntotal</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>MaterialB</td>\n",
       "      <td>78</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>MaterialREF</td>\n",
       "      <td>78</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Pais</td>\n",
       "      <td>91</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>GrupoAplicacion</td>\n",
       "      <td>88</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>SectorAplicacion</td>\n",
       "      <td>25</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "               name  Ntotal\n",
       "0         MaterialB      78\n",
       "1       MaterialREF      78\n",
       "2              Pais      91\n",
       "3   GrupoAplicacion      88\n",
       "4  SectorAplicacion      25"
      ]
     },
     "execution_count": 10,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#query de conexión de prueba sin errores\n",
    "# verificar existencia de NODOS previos creados\n",
    "#--- cuenta los nodos con diferentes tipos de etiqueta y los une en una única salida, 1 fila por cada tipo (name, cnt)\n",
    "queryPRB= \"MATCH (n)                                    \\\n",
    "RETURN labels (n)[0] as name, count (n) as Ntotal       \\\n",
    "UNION MATCH (n)                                         \\\n",
    "WITH labels (n)[1] as name, count (n) as Ntotal         \\\n",
    "WHERE name IS NOT NULL                                  \\\n",
    "RETURN name, Ntotal                                     \\\n",
    "UNION MATCH (n)                                         \\\n",
    "WITH labels (n)[2] as name, count (n) as Ntotal         \\\n",
    "WHERE name IS NOT NULL                                  \\\n",
    "RETURN name, Ntotal                                     \\\n",
    "UNION MATCH (n)                                         \\\n",
    "WITH labels (n)[3] as name, count (n) as Ntotal         \\\n",
    "WHERE name IS NOT NULL                                  \\\n",
    "RETURN name, Ntotal                                     \\\n",
    "\"\n",
    "graph_test01.run(queryPRB).to_data_frame()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "id": "e41614e9",
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>TipoRelacion</th>\n",
       "      <th>Ntotal</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>INCLUIDO_EN</td>\n",
       "      <td>447</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "  TipoRelacion  Ntotal\n",
       "0  INCLUIDO_EN     447"
      ]
     },
     "execution_count": 11,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#validamos la existencia previa de las  relaciones creadas (hasta este paso)\n",
    "queryPRB= \"MATCH n=()-[r:INCLUIDO_EN]->()              \\\n",
    "RETURN type(r) as TipoRelacion, count (r) as Ntotal\"       \n",
    "                                  \n",
    "graph_test01.run(queryPRB).to_data_frame()"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "27083405",
   "metadata": {},
   "source": [
    "## CARGAR DATOS"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "id": "ae0e1afa",
   "metadata": {},
   "outputs": [],
   "source": [
    "import numpy as np    #datos y operativa álgegra y matrices de n dimensiones (arrays)\n",
    "import pandas as pd   #carga dataset y manipulación de datos  y dataframes"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "id": "4e018e0b",
   "metadata": {
    "scrolled": true
   },
   "outputs": [],
   "source": [
    "#DATOS: Fichero completo de MATERIAL -> APLICACIONES/USOS -> SECTOR NACE2 APLICACIÓN, dentro del análisis \n",
    "# de suministro crítico GLOBAL actual  - Atendiendo al alcance del estudio - EU CRM 2020\n",
    "#FICHERO: GLAplic_Cargar.csv\n",
    "#CONTENIDO: Cada Material, su uso y cuota (share) de participación en Grupo de Aplicación/uso, y sector Nace2 vinculado\n",
    "#           a cada  aplicación/uso   \n",
    "#USO: Crear las RELACIONES entre \"GrupoAplicacion\" --[INCLUIDO_EN]--> \"SectorAplicacion\" y\n",
    "#     ** Propiedades de [INCLUIDO_EN]: \n",
    "#           SHR: proporción decimal de2 dígitos (entre 0 y 1)\n",
    "#           VAM (importe proporcional de valor añadido - calculado-): SHR por total de Valor Añadido del sector vinculado)   \n",
    "#     Crear las RELACIONES entre \"MaterialREF\" --[USADO_EN]--> \"GrupoAplicacion\" \n",
    "#     ** esta relación se crea inicialmente sin propiedades\n",
    "#\n",
    "rutaFichero =  \"https://raw.githubusercontent.com/JuanKFD/UNIR_TFM/main/GLAplic_Cargar.csv\" \n",
    "dfRelAplics = pd.read_csv(rutaFichero, sep=';')\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "id": "a9bde14d",
   "metadata": {
    "scrolled": false
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>MaterialApl</th>\n",
       "      <th>ApplicationORG</th>\n",
       "      <th>ShareSectorApl</th>\n",
       "      <th>SectorAplMatORG</th>\n",
       "      <th>ValorAnadidoSector</th>\n",
       "      <th>SectorAplicacion</th>\n",
       "      <th>GrupoAplicacion</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Aluminium</td>\n",
       "      <td>Construction</td>\n",
       "      <td>0,23</td>\n",
       "      <td>C25 - Manufacture of fabricated metal products...</td>\n",
       "      <td>148,35</td>\n",
       "      <td>C25-FabrMetalProds-NoMachin-Eq</td>\n",
       "      <td>Building &amp; roads</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Aluminium</td>\n",
       "      <td>Mobility (Transport and Automotive)</td>\n",
       "      <td>0,21</td>\n",
       "      <td>C29 - Manufacture of motor vehicles, trailers ...</td>\n",
       "      <td>160,60</td>\n",
       "      <td>C29-MotorVehicle,Trailer&amp;SemiT</td>\n",
       "      <td>Transport (automotive)</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Aluminium</td>\n",
       "      <td>Mobility (Transport and Automotive)</td>\n",
       "      <td>0,21</td>\n",
       "      <td>C30 - Manufacture of other transport equipment</td>\n",
       "      <td>44,30</td>\n",
       "      <td>C30-other transport equipment</td>\n",
       "      <td>Transport (automotive)</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Aluminium</td>\n",
       "      <td>Packaging</td>\n",
       "      <td>0,17</td>\n",
       "      <td>C25 - Manufacture of fabricated metal products...</td>\n",
       "      <td>148,35</td>\n",
       "      <td>C25-FabrMetalProds-NoMachin-Eq</td>\n",
       "      <td>Packaging</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Aluminium</td>\n",
       "      <td>High Tech Engineering</td>\n",
       "      <td>0,12</td>\n",
       "      <td>C28 - Manufacture of machinery and equipment n...</td>\n",
       "      <td>182,59</td>\n",
       "      <td>C28-Machinery &amp;Equipment n.e.c</td>\n",
       "      <td>High Tech Engineering</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "  MaterialApl                       ApplicationORG ShareSectorApl  \\\n",
       "0   Aluminium                         Construction           0,23   \n",
       "1   Aluminium  Mobility (Transport and Automotive)           0,21   \n",
       "2   Aluminium  Mobility (Transport and Automotive)           0,21   \n",
       "3   Aluminium                            Packaging           0,17   \n",
       "4   Aluminium                High Tech Engineering           0,12   \n",
       "\n",
       "                                     SectorAplMatORG ValorAnadidoSector  \\\n",
       "0  C25 - Manufacture of fabricated metal products...             148,35   \n",
       "1  C29 - Manufacture of motor vehicles, trailers ...             160,60   \n",
       "2     C30 - Manufacture of other transport equipment              44,30   \n",
       "3  C25 - Manufacture of fabricated metal products...             148,35   \n",
       "4  C28 - Manufacture of machinery and equipment n...             182,59   \n",
       "\n",
       "                 SectorAplicacion         GrupoAplicacion  \n",
       "0  C25-FabrMetalProds-NoMachin-Eq        Building & roads  \n",
       "1  C29-MotorVehicle,Trailer&SemiT  Transport (automotive)  \n",
       "2  C30-other transport equipment   Transport (automotive)  \n",
       "3  C25-FabrMetalProds-NoMachin-Eq               Packaging  \n",
       "4  C28-Machinery &Equipment n.e.c   High Tech Engineering  "
      ]
     },
     "execution_count": 15,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "dfRelAplics.head()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "id": "3785a1e2",
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>MaterialApl</th>\n",
       "      <th>ApplicationORG</th>\n",
       "      <th>ShareSectorApl</th>\n",
       "      <th>SectorAplMatORG</th>\n",
       "      <th>ValorAnadidoSector</th>\n",
       "      <th>SectorAplicacion</th>\n",
       "      <th>GrupoAplicacion</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>437</th>\n",
       "      <td>Zirconium</td>\n",
       "      <td>Foundry</td>\n",
       "      <td>0,15</td>\n",
       "      <td>C24 - Manufacture of basic metals</td>\n",
       "      <td>55,43</td>\n",
       "      <td>C24-basic metals</td>\n",
       "      <td>Foundry</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>438</th>\n",
       "      <td>Zirconium</td>\n",
       "      <td>Chemicals</td>\n",
       "      <td>0,12</td>\n",
       "      <td>C20 - Manufacture of chemicals and chemical pr...</td>\n",
       "      <td>105,51</td>\n",
       "      <td>C20-Chemicals &amp; Chemc.Prods.</td>\n",
       "      <td>Chemicals</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>439</th>\n",
       "      <td>Zirconium</td>\n",
       "      <td>Others</td>\n",
       "      <td>0,10</td>\n",
       "      <td>C26 - Manufacture of computer, electronic and ...</td>\n",
       "      <td>65,70</td>\n",
       "      <td>C26-Computer,Electron.Optic.Ps</td>\n",
       "      <td>Chemicals</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>440</th>\n",
       "      <td>Zirconium</td>\n",
       "      <td>Pigments</td>\n",
       "      <td>0,03</td>\n",
       "      <td>C20 - Manufacture of chemicals and chemical pr...</td>\n",
       "      <td>105,51</td>\n",
       "      <td>C20-Chemicals &amp; Chemc.Prods.</td>\n",
       "      <td>Chemicals (Paint, Adhesives)</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>441</th>\n",
       "      <td>Zirconium</td>\n",
       "      <td>Superalloys, Nuclear</td>\n",
       "      <td>0,02</td>\n",
       "      <td>C24 - Manufacture of basic metals</td>\n",
       "      <td>55,43</td>\n",
       "      <td>C24-basic metals</td>\n",
       "      <td>Energy (Nuclear)</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "    MaterialApl        ApplicationORG ShareSectorApl  \\\n",
       "437   Zirconium               Foundry           0,15   \n",
       "438   Zirconium             Chemicals           0,12   \n",
       "439   Zirconium                Others           0,10   \n",
       "440   Zirconium              Pigments           0,03   \n",
       "441   Zirconium  Superalloys, Nuclear           0,02   \n",
       "\n",
       "                                       SectorAplMatORG ValorAnadidoSector  \\\n",
       "437                  C24 - Manufacture of basic metals              55,43   \n",
       "438  C20 - Manufacture of chemicals and chemical pr...             105,51   \n",
       "439  C26 - Manufacture of computer, electronic and ...              65,70   \n",
       "440  C20 - Manufacture of chemicals and chemical pr...             105,51   \n",
       "441                  C24 - Manufacture of basic metals              55,43   \n",
       "\n",
       "                   SectorAplicacion               GrupoAplicacion  \n",
       "437               C24-basic metals                        Foundry  \n",
       "438    C20-Chemicals & Chemc.Prods.                     Chemicals  \n",
       "439  C26-Computer,Electron.Optic.Ps                     Chemicals  \n",
       "440    C20-Chemicals & Chemc.Prods.  Chemicals (Paint, Adhesives)  \n",
       "441               C24-basic metals               Energy (Nuclear)  "
      ]
     },
     "execution_count": 16,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "dfRelAplics.tail()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "id": "3c0a0050",
   "metadata": {
    "scrolled": false
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "(442, 7)"
      ]
     },
     "execution_count": 17,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "dfRelAplics.shape"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "id": "51ad4ccd",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "Index(['MaterialApl', 'ApplicationORG', 'ShareSectorApl', 'SectorAplMatORG',\n",
       "       'ValorAnadidoSector', 'SectorAplicacion', 'GrupoAplicacion'],\n",
       "      dtype='object')"
      ]
     },
     "execution_count": 18,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "dfRelAplics.columns"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "e0bd291e",
   "metadata": {},
   "source": [
    "### Cargados en memoria las _442 líneas de relación_  entre _material-uso-sector_, para **datos de la cadena de suministro global**"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "7dc58317",
   "metadata": {},
   "source": [
    "# PREVISUALIZACION DE DATOS - USOS"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "44c3c4e8",
   "metadata": {},
   "source": [
    "### Con el fin de procesar de manera más parametrizada y como presentación de otra manera de tratarlo, creo bucle en base a los propios datos de las columnas"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "id": "f0f87545",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Aluminium|Construction|0,23|C25 - Manufacture of fabricated metal products, except machinery and equipment|148,35|C25-FabrMetalProds-NoMachin-Eq|Building & roads|\n",
      "Aluminium|Mobility (Transport and Automotive)|0,21|C29 - Manufacture of motor vehicles, trailers and semi-trailers|160,60|C29-MotorVehicle,Trailer&SemiT|Transport (automotive)|\n",
      "Aluminium|Mobility (Transport and Automotive)|0,21|C30 - Manufacture of other transport equipment|44,30|C30-other transport equipment |Transport (automotive)|\n",
      "Aluminium|Packaging|0,17|C25 - Manufacture of fabricated metal products, except machinery and equipment|148,35|C25-FabrMetalProds-NoMachin-Eq|Packaging|\n",
      "Aluminium|High Tech Engineering|0,12|C28 - Manufacture of machinery and equipment n.e.c.|182,59|C28-Machinery &Equipment n.e.c|High Tech Engineering|\n",
      "Aluminium|Consumer Durables|0,06|C25 - Manufacture of fabricated metal products, except machinery and equipment|148,35|C25-FabrMetalProds-NoMachin-Eq|Consumer Durables|\n",
      "Antimony|Flame retardants|0,43|C20 - Manufacture of chemicals and chemical products|105,51|C20-Chemicals & Chemc.Prods.|Chemicals|\n",
      "Antimony|Lead-acid batteries|0,32|C27 - Manufacture of electrical equipment|80,75|C27-electrical equipment |Batteries (Lead)|\n",
      "Antimony|Lead alloys|0,14|C25 - Manufacture of fabricated metal products, except machinery and equipment|148,35|C25-FabrMetalProds-NoMachin-Eq|Alloys|\n",
      "Antimony|Plastics (catalysts and stabilisers)|0,06|C20 - Manufacture of chemicals and chemical products|105,51|C20-Chemicals & Chemc.Prods.|Chemicals (Plastics)|\n",
      "Antimony|Glass and ceramics|0,05|C23 - Manufacture of other non-metallic mineral products|57,26|C23-Oth.NoMetal.mineral Prods.|Glass|\n",
      "Arsenic|Zinc production|0,71|C24 - Manufacture of basic metals|55,43|C24-basic metals |Metals-Basics|\n",
      "Arsenic|Glassmaking|0,18|C23 - Manufacture of other non-metallic mineral products|57,26|C23-Oth.NoMetal.mineral Prods.|Glass|\n",
      "Arsenic|Chemicals|0,07|C20 - Manufacture of chemicals and chemical products|105,51|C20-Chemicals & Chemc.Prods.|Chemicals|\n",
      "Arsenic|Alloys|0,05|C24 - Manufacture of basic metals|55,43|C24-basic metals |Alloys|\n",
      "Arsenic|Electronics|0,00|C26 - Manufacture of computer, electronic and optical products|65,70|C26-Computer,Electron.Optic.Ps|Electrical and Electronics|\n",
      "Baryte|Weighting agent in oil and gas well drilling fluids or -muds-|0,60|C23 - Manufacture of other non-metallic mineral products|57,26|C23-Oth.NoMetal.mineral Prods.|Mining-Extraction|\n",
      "Baryte|Filler in rubbers, plastics, paints & paper|0,30|C22 - Manufacture of rubber and plastic products|75,98|C22-rubber & plastic prods. |Filler, extender, sealant|\n",
      "Baryte|Chemical industry|0,10|C20 - Manufacture of chemicals and chemical products|105,51|C20-Chemicals & Chemc.Prods.|Chemicals|\n",
      "Bauxite|Refining to alumina|0,90|C24 - Manufacture of basic metals|55,43|C24-basic metals |Metals-Basics|\n",
      "Bauxite|Refractories|0,03|C23 - Manufacture of other non-metallic mineral products|57,26|C23-Oth.NoMetal.mineral Prods.|Industry|\n",
      "Bauxite|Cement|0,03|C23 - Manufacture of other non-metallic mineral products|57,26|C23-Oth.NoMetal.mineral Prods.|Building & roads|\n",
      "Bauxite|Abrasives|0,02|C23 - Manufacture of other non-metallic mineral products|57,26|C23-Oth.NoMetal.mineral Prods.|Abrasives|\n",
      "Bauxite|Chemicals|0,02|C20 - Manufacture of chemicals and chemical products|105,51|C20-Chemicals & Chemc.Prods.|Chemicals|\n",
      "Bentonite|Pet litter|0,34|C23 - Manufacture of other non-metallic mineral products|57,26|C23-Oth.NoMetal.mineral Prods.|Pets|\n",
      "Bentonite|Foundry molding sands|0,22|C24 - Manufacture of basic metals|55,43|C24-basic metals |Foundry|\n",
      "Bentonite|Civil engineering|0,13|C23 - Manufacture of other non-metallic mineral products|57,26|C23-Oth.NoMetal.mineral Prods.|Civil engineering|\n",
      "Bentonite|Food and wine production|0,03|C11 - Manufacture of beverages|32,51|C11-beverages |Foods|\n",
      "Bentonite|Pelletizing of iron ore|0,08|C24 - Manufacture of basic metals|55,43|C24-basic metals |Metals-Basics|\n",
      "Bentonite|Oil absorbents|0,08|C20 - Manufacture of chemicals and chemical products|105,51|C20-Chemicals & Chemc.Prods.|Chemicals|\n",
      "Bentonite|Paper|0,03|C17 - Manufacture of paper and paper products|38,91|C17-paper & paper prods. |Chemicals (Paper)|\n",
      "Bentonite|Specialties and drilling fluids|0,07|B09-Mining (support)**|3,40|B09-Mining (support)**|Mining-Extraction|\n",
      "Bentonite|Others|0,02|C20 - Manufacture of chemicals and chemical products|105,51|C20-Chemicals & Chemc.Prods.|Chemicals|\n",
      "Beryllium|Electronic and telecommunications equipments|0,42|C26 - Manufacture of computer, electronic and optical products|65,70|C26-Computer,Electron.Optic.Ps|Electrical and Electronics|\n",
      "Beryllium|Transport and Defense : Vehicle electronics|0,17|C26 - Manufacture of computer, electronic and optical products|65,70|C26-Computer,Electron.Optic.Ps|Defense|\n",
      "Beryllium|Transport and Defense : Auto components|0,17|C29 - Manufacture of motor vehicles, trailers and semi-trailers|160,60|C29-MotorVehicle,Trailer&SemiT|Defense|\n",
      "Beryllium|Transport and Defense : Aerospace components|0,10|C30 - Manufacture of other transport equipment|44,30|C30-other transport equipment |Defense|\n",
      "Beryllium|Energy application|0,08|C26 - Manufacture of computer, electronic and optical products|65,70|C26-Computer,Electron.Optic.Ps|Electrical and Electronics|\n",
      "Beryllium|Industrial components : Moulds|0,03|C28 - Manufacture of machinery and equipment n.e.c.|182,59|C28-Machinery &Equipment n.e.c|Industry|\n",
      "Beryllium|Industrial components : Metal|0,03|C24 - Manufacture of basic metals|55,43|C24-basic metals |Industry|\n",
      "Beryllium|Others|0,00|Z99-Others|0,00|Z99-Others**|Chemicals|\n",
      "Bismuth|Chemicals|0,62|C20 - Manufacture of chemicals and chemical products|105,51|C20-Chemicals & Chemc.Prods.|Chemicals|\n",
      "Bismuth|Low-melting alloys|0,28|C32-Other manuf.|39,16|C32-Other manuf.**|Alloys|\n",
      "Bismuth|Metallurgical additives|0,10|C24 - Manufacture of basic metals|55,43|C24 - Manufacture of basic metals|Metals-Basics|\n",
      "Borate|Glass|0,55|C23 - Manufacture of other non-metallic mineral products|57,26|C23-Oth.NoMetal.mineral Prods.|Glass|\n",
      "Borate|Frits and Ceramics|0,17|C23 - Manufacture of other non-metallic mineral products|57,26|C23-Oth.NoMetal.mineral Prods.|Ceramics & Frits|\n",
      "Borate|Fertilisers|0,15|C20 - Manufacture of chemicals and chemical products|105,51|C20-Chemicals & Chemc.Prods.|Agriculture|\n",
      "Borate|Chemicals manufacture|0,04|C20 - Manufacture of chemicals and chemical products|105,51|C20-Chemicals & Chemc.Prods.|Chemicals|\n",
      "Borate|Construction materials (flame retardants, plasters, wood preservatives)|0,04|C20 - Manufacture of chemicals and chemical products|105,51|C20-Chemicals & Chemc.Prods.|Building & roads|\n",
      "Borate|Metals|0,04|C24 - Manufacture of basic metals|55,43|C24 - Manufacture of basic metals|Metals-Basics|\n",
      "Borate|Other|0,00|Z99-Others|0,00|Z99-Others**|Others|\n",
      "Cadmium|Batteries|0,80|C27 - Manufacture of electrical equipment|80,75|C27-electrical equipment |Batteries|\n",
      "Cadmium|Pigments|0,11|C20 - Manufacture of chemicals and chemical products|105,51|C20-Chemicals & Chemc.Prods.|Chemicals (Paint, Adhesives)|\n",
      "Cadmium|Coatings|0,07|C25 - Manufacture of fabricated metal products, except machinery and equipment|148,35|C25-FabrMetalProds-NoMachin-Eq|Coatings|\n",
      "Cadmium|Stabilizers|0,02|C20 - Manufacture of chemicals and chemical products|105,51|C20-Chemicals & Chemc.Prods.|Chemicals|\n",
      "Cadmium|Others|0,00|Z99-Others|0,00|Z99-Others**|Chemicals|\n",
      "Cerium|Autocatalysts|0,35|C20 - Manufacture of chemicals and chemical products|105,51|C20-Chemicals & Chemc.Prods.|Catalysts|\n",
      "Cerium|Glass&Ceramics|0,33|C23 - Manufacture of other non-metallic mineral products|57,26|C23-Oth.NoMetal.mineral Prods.|Ceramics & Frits|\n",
      "Cerium|Polishing powders|0,11|C26 - Manufacture of computer, electronic and optical products|65,70|C26-Computer,Electron.Optic.Ps|Electrical and Electronics|\n",
      "Cerium|Fluid Cracking Catalysts|0,08|C19 - Manufacture of coke and refined petroleum products|17,29|C19-Coke & Refined Petrol. Ps|Energy (Oil)|\n",
      "Cerium|Metal (no Battery)|0,06|C24 - Manufacture of basic metals|55,43|C24-basic metals |Metals-Basics|\n",
      "Cerium|Batteries|0,06|C27 - Manufacture of electrical equipment|80,75|C27-electrical equipment |Batteries|\n",
      "Cerium|Lighting|0,01|C27 - Manufacture of electrical equipment|80,75|C27-electrical equipment |Electrical and Electronics|\n",
      "Chromium|Products made of Stainless Steel|0,74|C25 - Manufacture of fabricated metal products, except machinery and equipment|148,35|C25-FabrMetalProds-NoMachin-Eq|Tools (Stainless Steel)|\n",
      "Chromium|Products made of Alloy Steel|0,19|C25 - Manufacture of fabricated metal products, except machinery and equipment|148,35|C25-FabrMetalProds-NoMachin-Eq|Alloys|\n",
      "Chromium|Casting Molds|0,03|C24 - Manufacture of basic metals|55,43|C24-basic metals |Casting Molds|\n",
      "Chromium|Products made of chromium chemicals|0,03|C20 - Manufacture of chemicals and chemical products|105,51|C20-Chemicals & Chemc.Prods.|Chemicals|\n",
      "Chromium|Refractory bricks and mortars|0,01|C23 - Manufacture of other non-metallic mineral products|57,26|C23-Oth.NoMetal.mineral Prods.|Industry|\n",
      "Chromium|Other uses|0,00|Z99-Others|0,00|Z99-Others**|Others|\n",
      "Cobalt|Superalloys, hardfacing/HSS and other alloys|0,36|C25 - Manufacture of fabricated metal products, except machinery and equipment|148,35|C25-FabrMetalProds-NoMachin-Eq|Superalloys|\n",
      "Cobalt|Hard materials (carbides and diamond tools)|0,14|C25 - Manufacture of fabricated metal products, except machinery and equipment|148,35|C25-FabrMetalProds-NoMachin-Eq|Tools (Hard materials)|\n",
      "Cobalt|Pigments and Inks|0,13|C20 - Manufacture of chemicals and chemical products|105,51|C20-Chemicals & Chemc.Prods.|Chemicals (Paint, Adhesives)|\n",
      "Cobalt|Catalysts|0,12|C20 - Manufacture of chemicals and chemical products|105,51|C20-Chemicals & Chemc.Prods.|Catalysts|\n",
      "Cobalt|Tyre adhesives and paint dryers|0,11|C20 - Manufacture of chemicals and chemical products|105,51|C20-Chemicals & Chemc.Prods.|Chemicals (Paint, Adhesives)|\n",
      "Cobalt|Magnets|0,07|C27 - Manufacture of electrical equipment|80,75|C27-electrical equipment |Electrical and Electronics|\n",
      "Cobalt|Other: Biotech, Surface Treatment, etc|0,06|C20 - Manufacture of chemicals and chemical products|105,51|C20-Chemicals & Chemc.Prods.|Chemicals|\n",
      "Cobalt|Battery|0,03|C27 - Manufacture of electrical equipment|80,75|C27-electrical equipment |Batteries|\n",
      "Coking coal|Coke for steel production|0,82|C24 - Manufacture of basic metals|55,43|C24-basic metals |Steel|\n",
      "Coking coal|Coke for other applications|0,09|C23 - Manufacture of other non-metallic mineral products|57,26|C23-Oth.NoMetal.mineral Prods.|Coke (Others)|\n",
      "Coking coal|Other uses (tar, benzole, electricity and heat)|0,08|C20 - Manufacture of chemicals and chemical products|105,51|C20-Chemicals & Chemc.Prods.|Chemicals|\n",
      "Copper|Automotive|0,06|C29 - Manufacture of motor vehicles, trailers and semi-trailers|160,60|C29-MotorVehicle,Trailer&SemiT|Transport (automotive)|\n",
      "Copper|Digital appliances|0,14|C26 - Manufacture of computer, electronic and optical products|65,70|C26-Computer,Electron.Optic.Ps|Electrical and Electronics|\n",
      "Copper|Jewellery|0,05|C32-Other manuf.|39,16|C32-Other manuf.**|Jewelery & others|\n",
      "Copper|Ships, trucks and armored vehicles|0,10|C20 - Manufacture of chemicals and chemical products|105,51|C20-Chemicals & Chemc.Prods.|Transport (all)|\n",
      "Copper|Subparts of interior|0,02|C31 - Manufacture of furniture|26,17|C31-furniture |Furniture|\n",
      "Copper|Oxides and dopants|0,03|C20 - Manufacture of chemicals and chemical products|105,51|C20-Chemicals & Chemc.Prods.|Chemicals|\n",
      "Copper|Electrolytic refined copper|0,02|C24 - Manufacture of basic metals|55,43|C24-basic metals |Electrical and Electronics|\n",
      "Copper|Components and household|0,22|C27 - Manufacture of electrical equipment|80,75|C27-electrical equipment |Components and household|\n",
      "Copper|Tubes, plates, wire|0,21|C25 - Manufacture of fabricated metal products, except machinery and equipment|148,35|C25-FabrMetalProds-NoMachin-Eq|Tubes, plates, wire|\n",
      "Copper|Machinery|0,15|C28 - Manufacture of machinery and equipment n.e.c.|182,59|C28-Machinery &Equipment n.e.c|Industry|\n",
      "Diatomite|Food industry|0,48|C11 - Manufacture of beverages|32,51|C11-beverages |Foods|\n",
      "Diatomite|Pellettizing iron ore|0,23|C23 - Manufacture of other non-metallic mineral products|57,26|C23-Oth.NoMetal.mineral Prods.|Mining-Extraction|\n",
      "Diatomite|Activated raw granules|0,13|C23 - Manufacture of other non-metallic mineral products|57,26|C23-Oth.NoMetal.mineral Prods.|Activated raw granules|\n",
      "Diatomite|Pet litter|0,07|C23 - Manufacture of other non-metallic mineral products|57,26|C23-Oth.NoMetal.mineral Prods.|Pets|\n",
      "Diatomite|Civil engineering|0,06|C23 - Manufacture of other non-metallic mineral products|57,26|C23-Oth.NoMetal.mineral Prods.|Civil engineering|\n",
      "Diatomite|Drilling fluids|0,02|B09-Mining (support)**|3,40|B09-Mining (support)**|Mining-Extraction|\n",
      "Diatomite|Foundry molding sands|0,01|C24 - Manufacture of basic metals|55,43|C24-basic metals |Foundry|\n",
      "Dysprosium|Magnets|1,00|C25 - Manufacture of fabricated metal products, except machinery and equipment|148,35|C25-FabrMetalProds-NoMachin-Eq|Electrical and Electronics|\n",
      "Erbium|Glass - Optical applications|0,74|C23 - Manufacture of other non-metallic mineral products|57,26|C23-Oth.NoMetal.mineral Prods.|Glass|\n",
      "Erbium|Lighting|0,26|C27 - Manufacture of electrical equipment|80,75|C27-electrical equipment |Electrical and Electronics|\n",
      "Europium|Lighting|1,00|C27 - Manufacture of electrical equipment|80,75|C27-electrical equipment |Electrical and Electronics|\n",
      "Feldspar|Ceramics (tiles, sanitaryware, tableware, glazes)|0,45|C23 - Manufacture of other non-metallic mineral products|57,26|C23-Oth.NoMetal.mineral Prods.|Ceramics|\n",
      "Feldspar|Glass (container, float, fiberglass, specialties)|0,06|C23 - Manufacture of other non-metallic mineral products|57,26|C23-Oth.NoMetal.mineral Prods.|Glass|\n",
      "Feldspar|Constructions, brick, tiles|0,46|C23 - Manufacture of other non-metallic mineral products|57,26|C23-Oth.NoMetal.mineral Prods.|Building & roads|\n",
      "Feldspar|Others|0,03|Z99-Others|0,00|Z99-Others**|Chemicals|\n",
      "Fluorspar|Steel and iron making|0,36|C24 - Manufacture of basic metals|55,43|C24-basic metals |Metals-Basics|\n",
      "Fluorspar|Refrigeration and air conditioning|0,09|C27 - Manufacture of electrical equipment|80,75|C27-electrical equipment |Electrical and Electronics|\n",
      "Fluorspar|Refrigeration and air conditioning|0,09|C29 - Manufacture of motor vehicles, trailers and semi-trailers|160,60|C29-MotorVehicle,Trailer&SemiT|Electrical and Electronics|\n",
      "Fluorspar|Aluminium making and other metallurgy|0,15|C24 - Manufacture of basic metals|55,43|C24-basic metals |Metals-Basics|\n",
      "Fluorspar|Solid fluoropolymers for cookware coating and cable insulation|0,11|C27 - Manufacture of electrical equipment|80,75|C27-electrical equipment |Electrical and Electronics|\n",
      "Fluorspar|Fluorochemicals|0,10|C20 - Manufacture of chemicals and chemical products|105,51|C20-Chemicals & Chemc.Prods.|Chemicals|\n",
      "Fluorspar|UF6 in nuclear uranium fuel|0,06|C24 - Manufacture of basic metals|55,43|C24-basic metals |Energy (Nuclear)|\n",
      "Fluorspar|HF in alkylation process for oil refining|0,03|C19 - Manufacture of coke and refined petroleum products|17,29|C19-Coke & Refined Petrol. Ps|Energy (Oil)|\n",
      "Gadolinium|Magnets|0,38|C25 - Manufacture of fabricated metal products, except machinery and equipment|148,35|C25-FabrMetalProds-NoMachin-Eq|Electrical and Electronics|\n",
      "Gadolinium|Metal (no Battery)|0,30|C24 - Manufacture of basic metals|55,43|C24-basic metals |Metals-Basics|\n",
      "Gadolinium|Lighting|0,25|C27 - Manufacture of electrical equipment|80,75|C27-electrical equipment |Electrical and Electronics|\n",
      "Gadolinium|Magnetic Resonance Imaging - MRI|0,08|C21 - Manufacture of basic pharmaceutical products and pharmaceutical preparations|80,18|C21-BasicPharmaceutic.&PhPreps|Electrical and Electronics|\n",
      "Gadolinium|Other|0,00|Z99-Others|0,00|Z99-Others**|Others|\n",
      "Gallium|Integrated circuits|0,70|C26 - Manufacture of computer, electronic and optical products|65,70|C26-Computer,Electron.Optic.Ps|Electrical and Electronics|\n",
      "Gallium|Lighting|0,25|C27 - Manufacture of electrical equipment|80,75|C27-electrical equipment |Electrical and Electronics|\n",
      "Gallium|CIGS solar cells|0,05|C26 - Manufacture of computer, electronic and optical products|65,70|C26-Computer,Electron.Optic.Ps|Energy (Solar)|\n",
      "Germanium|Infrared optics|0,47|C26 - Manufacture of computer, electronic and optical products|65,70|C26-Computer,Electron.Optic.Ps|Electrical and Electronics|\n",
      "Germanium|Optical fibres|0,40|C27 - Manufacture of electrical equipment|80,75|C27-electrical equipment |Electrical and Electronics|\n",
      "Germanium|Satellite solar cells|0,13|C26 - Manufacture of computer, electronic and optical products|65,70|C26-Computer,Electron.Optic.Ps|Energy (Solar)|\n",
      "Germanium|Others|0,00|Z99-Others|0,00|Z99-Others**|Chemicals|\n",
      "Gold|Jewellery|0,86|C32-Other manuf.|39,16|C32-Other manuf.**|Jewelery & others|\n",
      "Gold|Electronics|0,11|C26 - Manufacture of computer, electronic and optical products|65,70|C26-Computer,Electron.Optic.Ps|Electrical and Electronics|\n",
      "Gold|Other industrial applications|0,02|C32-Other manuf.|39,16|C32-Other manuf.**|Industry|\n",
      "Gold|Dental|0,01|C32-Other manuf.|39,16|C32-Other manuf.**|Others|\n",
      "Gypsum|Plasterboard and Wallboard|0,51|C23 - Manufacture of other non-metallic mineral products|57,26|C23-Oth.NoMetal.mineral Prods.|Building & roads|\n",
      "Gypsum|Building plaster|0,26|C23 - Manufacture of other non-metallic mineral products|57,26|C23-Oth.NoMetal.mineral Prods.|Building & roads|\n",
      "Gypsum|Cement production|0,17|C23 - Manufacture of other non-metallic mineral products|57,26|C23-Oth.NoMetal.mineral Prods.|Building & roads|\n",
      "Gypsum|Agriculture|0,06|C23 - Manufacture of other non-metallic mineral products|57,26|C23-Oth.NoMetal.mineral Prods.|Agriculture|\n",
      "Hafnium|Superalloys|0,61|C24 - Manufacture of basic metals|55,43|C24-basic metals |Superalloys|\n",
      "Hafnium|Catalyst precursor|0,07|C20 - Manufacture of chemicals and chemical products|105,51|C20-Chemicals & Chemc.Prods.|Catalysts|\n",
      "Hafnium|Plasma cutting tips|0,15|C25 - Manufacture of fabricated metal products, except machinery and equipment|148,35|C25-FabrMetalProds-NoMachin-Eq|Tools (Plasma)|\n",
      "Hafnium|Nuclear control rod|0,11|C25 - Manufacture of fabricated metal products, except machinery and equipment|148,35|C25-FabrMetalProds-NoMachin-Eq|Energy (Nuclear)|\n",
      "Hafnium|Oxide for Optical|0,03|C26 - Manufacture of computer, electronic and optical products|65,70|C26-Computer,Electron.Optic.Ps|Electrical and Electronics|\n",
      "Hafnium|Semiconductors|0,03|C26 - Manufacture of computer, electronic and optical products|65,70|C26-Computer,Electron.Optic.Ps|Electrical and Electronics|\n",
      "Hafnium|Others|0,00|Z99-Others|0,00|Z99-Others**|Chemicals|\n",
      "Helium|Controlled atmospheres|0,23|C24 - Manufacture of basic metals|55,43|C24-basic metals |Controlled atmospheres|\n",
      "Helium|Cryogenics|0,22|C32-Other manuf.|39,16|C32-Other manuf.**|Cryogenics|\n",
      "Helium|Balloons|0,14|C32-Other manuf.|39,16|C32-Other manuf.**|Balloons|\n",
      "Helium|Pressurisation and purging|0,09|C32-Other manuf.|39,16|C32-Other manuf.**|Industry|\n",
      "Helium|Analysis|0,09|C32-Other manuf.|39,16|C32-Other manuf.**|Analysis|\n",
      "Helium|Welding|0,08|C25 - Manufacture of fabricated metal products, except machinery and equipment|148,35|C25-FabrMetalProds-NoMachin-Eq|Industry|\n",
      "Helium|Semiconductors, optic fibres|0,08|C26 - Manufacture of computer, electronic and optical products|65,70|C26-Computer,Electron.Optic.Ps|Electrical and Electronics|\n",
      "Helium|Leak detection|0,07|C33 - Repair and installation of machinery and equipment|52,33|C33-Repair&install.Machinery-Equip|Detection|\n",
      "Ho, Tm, Lu, Yb|Glass - Optical applications|1,00|C26 - Manufacture of computer, electronic and optical products|65,70|C26-Computer,Electron.Optic.Ps|Glass|\n",
      "Indium|Flat panel displays|0,60|C26 - Manufacture of computer, electronic and optical products|65,70|C26-Computer,Electron.Optic.Ps|Electrical and Electronics|\n",
      "Indium|Solders|0,11|C26 - Manufacture of computer, electronic and optical products|65,70|C26-Computer,Electron.Optic.Ps|Electrical and Electronics|\n",
      "Indium|PV cells|0,09|C26 - Manufacture of computer, electronic and optical products|65,70|C26-Computer,Electron.Optic.Ps|Energy (Solar)|\n",
      "Indium|Thermal interface material|0,07|C26 - Manufacture of computer, electronic and optical products|65,70|C26-Computer,Electron.Optic.Ps|Thermal interface material|\n",
      "Indium|Batteries|0,05|C27 - Manufacture of electrical equipment|80,75|C27-electrical equipment |Batteries|\n",
      "Indium|Alloys/compounds|0,04|C24 - Manufacture of basic metals|55,43|C24-basic metals |Alloys|\n",
      "Indium|Semiconductors & LEDs|0,03|C26 - Manufacture of computer, electronic and optical products|65,70|C26-Computer,Electron.Optic.Ps|Electrical and Electronics|\n",
      "Indium|Other|0,00|Z99-Others|0,00|Z99-Others**|Others|\n",
      "Iridium|Electrochemical|0,48|C20 - Manufacture of chemicals and chemical products|105,51|C20-Chemicals & Chemc.Prods.|Electrical and Electronics|\n",
      "Iridium|Other|0,00|C29 - Manufacture of motor vehicles, trailers and semi-trailers|160,60|C29-MotorVehicle,Trailer&SemiT|Others|\n",
      "Iridium|Electronics|0,39|C26 - Manufacture of computer, electronic and optical products|65,70|C26-Computer,Electron.Optic.Ps|Electrical and Electronics|\n",
      "Iridium|Chemical|0,13|C20 - Manufacture of chemicals and chemical products|105,51|C20-Chemicals & Chemc.Prods.|Chemicals|\n",
      "Iron ore|Steel in Construction|0,35|C25 - Manufacture of fabricated metal products, except machinery and equipment|148,35|C25-FabrMetalProds-NoMachin-Eq|Building & roads|\n",
      "Iron ore|Steel in Automotive|0,20|C29 - Manufacture of motor vehicles, trailers and semi-trailers|160,60|C29-MotorVehicle,Trailer&SemiT|Transport (automotive)|\n",
      "Iron ore|Steel in Mechanical engineering|0,15|C28 - Manufacture of machinery and equipment n.e.c.|182,59|C28-Machinery &Equipment n.e.c|Steels|\n",
      "Iron ore|Steel in Metalware|0,14|C25 - Manufacture of fabricated metal products, except machinery and equipment|148,35|C25-FabrMetalProds-NoMachin-Eq|Steels|\n",
      "Iron ore|Steel in Tubes|0,11|C24 - Manufacture of basic metals|55,43|C24-basic metals |Metals-Basics|\n",
      "Iron ore|Steel in Domestic appliances|0,02|C28 - Manufacture of machinery and equipment n.e.c.|182,59|C28-Machinery &Equipment n.e.c|Domestic Prods.|\n",
      "Iron ore|Steel in Other transport|0,02|C30 - Manufacture of other transport equipment|44,30|C30-other transport equipment |Transport (automotive)|\n",
      "Iron ore|Other|0,00|Z99-Others|0,00|Z99-Others**|Others|\n",
      "Kaolin clay|Ceramics|0,47|C23 - Manufacture of other non-metallic mineral products|57,26|C23-Oth.NoMetal.mineral Prods.|Ceramics|\n",
      "Kaolin clay|Paper|0,29|C17 - Manufacture of paper and paper products|38,91|C17-paper & paper prods. |Chemicals (Paper)|\n",
      "Kaolin clay|Fiberglass|0,06|C23 - Manufacture of other non-metallic mineral products|57,26|C23-Oth.NoMetal.mineral Prods.|Fiberglass|\n",
      "Kaolin clay|Refractories|0,05|C23 - Manufacture of other non-metallic mineral products|57,26|C23-Oth.NoMetal.mineral Prods.|Industry|\n",
      "Kaolin clay|Catalysts|0,04|C19 - Manufacture of coke and refined petroleum products|17,29|C19-Coke & Refined Petrol. Ps|Catalysts|\n",
      "Kaolin clay|Others|0,04|Z99-Others|0,00|Z99-Others**|Chemicals|\n",
      "Kaolin clay|Paints and adhesives|0,04|C20 - Manufacture of chemicals and chemical products|105,51|C20-Chemicals & Chemc.Prods.|Chemicals (Paint, Adhesives)|\n",
      "Kaolin clay|Rubber and plastics|0,01|C22 - Manufacture of rubber and plastic products|75,98|C22-rubber & plastic prods. |Chemicals(Rubber)|\n",
      "Kaolin clay|Cement|0,01|C23 - Manufacture of other non-metallic mineral products|57,26|C23-Oth.NoMetal.mineral Prods.|Building & roads|\n",
      "Lanthanum|Fluid Cracking Catalysts|0,67|C19 - Manufacture of coke and refined petroleum products|17,29|C19-Coke & Refined Petrol. Ps|Energy (Oil)|\n",
      "Lanthanum|Glass&Ceramics|0,13|C23 - Manufacture of other non-metallic mineral products|57,26|C23-Oth.NoMetal.mineral Prods.|Ceramics & Frits|\n",
      "Lanthanum|Batteries|0,10|C27 - Manufacture of electrical equipment|80,75|C27-electrical equipment |Batteries|\n",
      "Lanthanum|Polishing powders|0,05|C26 - Manufacture of computer, electronic and optical products|65,70|C26-Computer,Electron.Optic.Ps|Electrical and Electronics|\n",
      "Lanthanum|Metal (no Battery)|0,03|C24 - Manufacture of basic metals|55,43|C24-basic metals |Metals-Basics|\n",
      "Lanthanum|Lighting|0,02|C27 - Manufacture of electrical equipment|80,75|C27-electrical equipment |Electrical and Electronics|\n",
      "Lead|Batteries|0,84|C27 - Manufacture of electrical equipment|80,75|C27-electrical equipment |Batteries|\n",
      "Lead|Rolled and extruded products|0,06|C24 - Manufacture of basic metals|55,43|C24-basic metals |Metals-Basics|\n",
      "Lead|Lead compounds|0,04|C20 - Manufacture of chemicals and chemical products|105,51|C20-Chemicals & Chemc.Prods.|Alloys|\n",
      "Lead|Shot/ammunition|0,04|C25 - Manufacture of fabricated metal products, except machinery and equipment|148,35|C25-FabrMetalProds-NoMachin-Eq|Defense|\n",
      "Lead|Cable sheathing|0,01|C27 - Manufacture of electrical equipment|80,75|C27-electrical equipment |Cable sheathing|\n",
      "Lead|Alloys and solders|0,01|C24 - Manufacture of basic metals|55,43|C24-basic metals |Alloys|\n",
      "Limestone|Cement & concrete, plaster & mortar, roadworks|0,31|C23 - Manufacture of other non-metallic mineral products|57,26|C23-Oth.NoMetal.mineral Prods.|Building & roads|\n",
      "Limestone|Manufacture of basic metals|0,08|C24 - Manufacture of basic metals|55,43|C24-basic metals |Basic metals|\n",
      "Limestone|Paper, plastics and rubber|0,31|C20 - Manufacture of chemicals and chemical products|105,51|C20-Chemicals & Chemc.Prods.|Chemicals|\n",
      "Limestone|Agriculture|0,05|C20 - Manufacture of chemicals and chemical products|105,51|C20-Chemicals & Chemc.Prods.|Agriculture|\n",
      "Limestone|Others (Glass & ceramics,chemicals, water treatment)|0,06|C23 - Manufacture of other non-metallic mineral products|57,26|C23-Oth.NoMetal.mineral Prods.|Others|\n",
      "Limestone|Paint, coating, adhesives|0,06|C20 - Manufacture of chemicals and chemical products|105,51|C20-Chemicals & Chemc.Prods.|Chemicals (Paint, Adhesives)|\n",
      "Limestone|Flue Gas Desulfurisation|0,09|E39 - Remediation activities and other waste management services|1,30|E39-Remed.Activs &Waste MngSrvs|Chemicals|\n",
      "Limestone|Feed|0,04|C10 - Manufacture of food products|155,88|C10-food prods. |Foods|\n",
      "Lithium|Glass and ceramics|0,66|C23 - Manufacture of other non-metallic mineral products|57,26|C23-Oth.NoMetal.mineral Prods.|Glass|\n",
      "Lithium|Lubricating greases|0,09|C20 - Manufacture of chemicals and chemical products|105,51|C20-Chemicals & Chemc.Prods.|Lubricants|\n",
      "Lithium|Cement production|0,09|C23 - Manufacture of other non-metallic mineral products|57,26|C23-Oth.NoMetal.mineral Prods.|Building & roads|\n",
      "Lithium|Steel casting|0,05|C24 - Manufacture of basic metals|55,43|C24-basic metals |Metals-Basics|\n",
      "Lithium|Pharmaceutical products|0,04|C21 - Manufacture of basic pharmaceutical products and pharmaceutical preparations|80,18|C21-BasicPharmaceutic.&PhPreps|Pharmacy|\n",
      "Lithium|Rubber and plastics production|0,04|C22 - Manufacture of rubber and plastic products|75,98|C22-rubber & plastic prods. |Chemicals(Rubber)|\n",
      "Lithium|Al-Li alloys|0,02|C25 - Manufacture of fabricated metal products, except machinery and equipment|148,35|C25-fabricated metal prods., |Alloys|\n",
      "Lithium|Batteries|0,01|C27 - Manufacture of electrical equipment|80,75|C27-electrical equipment |Batteries|\n",
      "Magnesite|Steel making|0,57|C24 - Manufacture of basic metals|55,43|C24-basic metals |Metals-Basics|\n",
      "Magnesite|Paper industry|0,12|C17 - Manufacture of paper and paper products|38,91|C17-paper & paper prods. |Chemicals (Paper)|\n",
      "Magnesite|Cement making|0,09|C23 - Manufacture of other non-metallic mineral products|57,26|C23-Oth.NoMetal.mineral Prods.|Building & roads|\n",
      "Magnesite|Agriculture (1 of 2)|0,07|C20 - Manufacture of chemicals and chemical products|105,51|C20-Chemicals & Chemc.Prods.|Agriculture|\n",
      "Magnesite|Agriculture (2 of 2)|0,07|C10 - Manufacture of food products|155,88|C10-food prods. |Agriculture|\n",
      "Magnesite|Ceramics|0,05|C23 - Manufacture of other non-metallic mineral products|57,26|C23-Oth.NoMetal.mineral Prods.|Ceramics|\n",
      "Magnesite|Glass making|0,03|C23 - Manufacture of other non-metallic mineral products|57,26|C23-Oth.NoMetal.mineral Prods.|Glass|\n",
      "Magnesite|Others|0,00|Z99-Others|0,00|Z99-Others**|Chemicals|\n",
      "Magnesium|Transportation (Automotive)|0,50|C29 - Manufacture of motor vehicles, trailers and semi-trailers|160,60|C29-MotorVehicle,Trailer&SemiT|Transport (automotive)|\n",
      "Magnesium|Packaging|0,21|C25 - Manufacture of fabricated metal products, except machinery and equipment|148,35|C25-FabrMetalProds-NoMachin-Eq|Packaging|\n",
      "Magnesium|Desulfurisation agent|0,12|C24 - Manufacture of basic metals|55,43|C24-basic metals |Metals-Basics|\n",
      "Magnesium|Construction|0,13|C25 - Manufacture of fabricated metal products, except machinery and equipment|148,35|C25-FabrMetalProds-NoMachin-Eq|Building & roads|\n",
      "Magnesium|Transportation (Air, Marine, Train)|0,04|C30 - Manufacture of other transport equipment|44,30|C30-other transport equipment |Transport (all)|\n",
      "Magnesium|Other applications|0,00|Z99-Others|0,00|Z99-Others**|Others|\n",
      "Manganese|Steel (construction)|0,25|C25 - Manufacture of fabricated metal products, except machinery and equipment|148,35|C25-FabrMetalProds-NoMachin-Eq|Building & roads|\n",
      "Manganese|Steel (automotive)|0,14|C29 - Manufacture of motor vehicles, trailers and semi-trailers|160,60|C29-MotorVehicle,Trailer&SemiT|Transport (automotive)|\n",
      "Manganese|Steel (mechanical engineering)|0,13|C24 - Manufacture of basic metals|55,43|C24-basic metals |Metals-Basics|\n",
      "Manganese|Steel (structural steelworks)|0,11|C25 - Manufacture of fabricated metal products, except machinery and equipment|148,35|C25-FabrMetalProds-NoMachin-Eq|Building & roads|\n",
      "Manganese|Steel (tubes)|0,10|C25 - Manufacture of fabricated metal products, except machinery and equipment|148,35|C25-FabrMetalProds-NoMachin-Eq|Industry|\n",
      "Manganese|Steel (metalware)|0,10|C25 - Manufacture of fabricated metal products, except machinery and equipment|148,35|C25-FabrMetalProds-NoMachin-Eq|Industry|\n",
      "Manganese|Non-steel alloys|0,06|C25 - Manufacture of fabricated metal products, except machinery and equipment|148,35|C25-FabrMetalProds-NoMachin-Eq|Alloys|\n",
      "Manganese|Chemical manufacture|0,05|C20 - Manufacture of chemicals and chemical products|105,51|C20-Chemicals & Chemc.Prods.|Chemicals|\n",
      "Manganese|Steel (domestic appliances)|0,04|C27 - Manufacture of electrical equipment|80,75|C27-electrical equipment |Electrical and Electronics|\n",
      "Manganese|Batteries (cathodes)|0,02|C27 - Manufacture of electrical equipment|80,75|C27-electrical equipment |Batteries|\n",
      "Molybdenum|Engineering steels|0,40|C25 - Manufacture of fabricated metal products, except machinery and equipment|148,35|C25-FabrMetalProds-NoMachin-Eq|Steels|\n",
      "Molybdenum|Stainless steels|0,23|C19 - Manufacture of coke and refined petroleum products|17,29|C19-Coke & Refined Petrol. Ps|Steels|\n",
      "Molybdenum|Chemicals|0,13|C20 - Manufacture of chemicals and chemical products|105,51|C20-Chemicals & Chemc.Prods.|Chemicals|\n",
      "Molybdenum|Foundries|0,08|C28 - Manufacture of machinery and equipment n.e.c.|182,59|C28-Machinery &Equipment n.e.c|Foundry|\n",
      "Molybdenum|Tool steels|0,08|C28 - Manufacture of machinery and equipment n.e.c.|182,59|C28-Machinery &Equipment n.e.c|Tool steels|\n",
      "Molybdenum|Mo-Metals|0,06|C28 - Manufacture of machinery and equipment n.e.c.|182,59|C28-Machinery &Equipment n.e.c|Industry|\n",
      "Molybdenum|Nickel alloys|0,02|C28 - Manufacture of machinery and equipment n.e.c.|182,59|C28-Machinery &Equipment n.e.c|Industry|\n",
      "Natural cork|Wine corks|0,70|C11 - Manufacture of beverages|32,51|C11-beverages |Foods|\n",
      "Natural cork|Insulation, building materials|0,20|C16 - Manufacture of wood and of products of wood and cork, except furniture; manufacture of articles of straw and plaiting materials|27,97|C16-Wood,Cork,Straw,Plaiting-NoFur|Building & roads|\n",
      "Natural cork|General furniture|0,05|C31 - Manufacture of furniture|26,17|C31-furniture |Furniture|\n",
      "Natural cork|Leisure|0,02|C32-Other manuf.|39,16|C32-Other manuf.**|Leisure|\n",
      "Natural cork|Gaskets, expansion|0,01|C29 - Manufacture of motor vehicles, trailers and semi-trailers|160,60|C29-MotorVehicle,Trailer&SemiT|Gaskets, expansion|\n",
      "Natural cork|Gaskets, expansion|0,01|C28 - Manufacture of machinery and equipment n.e.c.|182,59|C28-Machinery &Equipment n.e.c|Gaskets, expansion|\n",
      "Natural cork|Gaskets, expansion|0,01|C30 - Manufacture of other transport equipment|44,30|C30-other transport equipment |Gaskets, expansion|\n",
      "Natural graphite|Refractories for steelmaking|0,53|C24 - Manufacture of basic metals|55,43|C24-basic metals |Industry|\n",
      "Natural graphite|Foundries|0,15|C23 - Manufacture of other non-metallic mineral products|57,26|C23-Oth.NoMetal.mineral Prods.|Foundry|\n",
      "Natural graphite|Graphite shapes|0,02|C28 - Manufacture of machinery and equipment n.e.c.|182,59|C28-Machinery &Equipment n.e.c|Graphite shapes|\n",
      "Natural graphite|Batteries|0,09|C27 - Manufacture of electrical equipment|80,75|C27-electrical equipment |Batteries|\n",
      "Natural graphite|Lubricants|0,06|C20 - Manufacture of chemicals and chemical products|105,51|C20-Chemicals & Chemc.Prods.|Lubricants|\n",
      "Natural graphite|Recarburising|0,05|C24 - Manufacture of basic metals|55,43|C24-basic metals |Metals-Basics|\n",
      "Natural graphite|Pencils|0,05|C23 - Manufacture of other non-metallic mineral products|57,26|C23-Oth.NoMetal.mineral Prods.|Tools (pencils)|\n",
      "Natural graphite|Friction products|0,06|C23 - Manufacture of other non-metallic mineral products|57,26|C23-Oth.NoMetal.mineral Prods.|Friction products|\n",
      "Natural Rubber|Automotive|0,75|C29 - Manufacture of motor vehicles, trailers and semi-trailers|160,60|C29-MotorVehicle,Trailer&SemiT|Transport (automotive)|\n",
      "Natural Rubber|Other transport equipment|0,14|C30 - Manufacture of other transport equipment|44,30|C30-other transport equipment |Transport (automotive)|\n",
      "Natural Rubber|Machinery and offshore|0,06|C28 - Manufacture of machinery and equipment n.e.c.|182,59|C28-Machinery &Equipment n.e.c|Machinery|\n",
      "Natural Rubber|Furniture|0,02|C31 - Manufacture of furniture|26,17|C31-furniture |Furniture|\n",
      "Natural Rubber|Packaging|0,01|C22 - Manufacture of rubber and plastic products|75,98|C22-rubber & plastic prods. |Packaging|\n",
      "Natural Rubber|Household appliances|0,01|C27 - Manufacture of electrical equipment|80,75|C27-electrical equipment |Electrical and Electronics|\n",
      "Natural Rubber|Sportswear|0,01|C32-Other manuf.|39,16|C32-Other manuf.**|Wear|\n",
      "Natural Teak wood|Yachts, sailing boats|0,90|C30 - Manufacture of other transport equipment|44,30|C30-other transport equipment |Transport (Boats)|\n",
      "Natural Teak wood|High end furniture|0,10|C31 - Manufacture of furniture|26,17|C31-furniture |Furniture|\n",
      "Neodymium|Magnets|0,41|C25 - Manufacture of fabricated metal products, except machinery and equipment|148,35|C25-FabrMetalProds-NoMachin-Eq|Electrical and Electronics|\n",
      "Neodymium|Batteries|0,14|C27 - Manufacture of electrical equipment|80,75|C27-electrical equipment |Batteries|\n",
      "Neodymium|Metal (no Battery)|0,13|C24 - Manufacture of basic metals|55,43|C24-basic metals |Metals-Basics|\n",
      "Neodymium|Ceramics|0,12|C23 - Manufacture of other non-metallic mineral products|57,26|C23-Oth.NoMetal.mineral Prods.|Ceramics|\n",
      "Neodymium|Glass|0,09|C23 - Manufacture of other non-metallic mineral products|57,26|C23-Oth.NoMetal.mineral Prods.|Glass|\n",
      "Neodymium|Catalysts|0,07|C20 - Manufacture of chemicals and chemical products|105,51|C20-Chemicals & Chemc.Prods.|Catalysts|\n",
      "Neodymium|Lasers|0,03|C26 - Manufacture of computer, electronic and optical products|65,70|C26-Computer,Electron.Optic.Ps|Electrical and Electronics|\n",
      "Neodymium|Other|0,00|Z99-Others|0,00|Z99-Others**|Others|\n",
      "Nickel|Engineering (Steel)|0,39|C28 - Manufacture of machinery and equipment n.e.c.|182,59|C28-Machinery &Equipment n.e.c|Steels|\n",
      "Nickel|Metal goods (Steel)|0,21|C24 - Manufacture of basic metals|55,43|C24-basic metals |Metals-Basics|\n",
      "Nickel|Transport (Steel)|0,19|C30 - Manufacture of other transport equipment|44,30|C30-other transport equipment |Transport (all)|\n",
      "Nickel|Electrical and Electronics (Steel)|0,11|C27 - Manufacture of electrical equipment|80,75|C27-electrical equipment |Electrical and Electronics|\n",
      "Nickel|Building and construction (Steel)|0,10|C25 - Manufacture of fabricated metal products, except machinery and equipment|148,35|C25-FabrMetalProds-NoMachin-Eq|Building & roads|\n",
      "Niobium|Automotive (Steel)|0,23|C29 - Manufacture of motor vehicles, trailers and semi-trailers|160,60|C29-MotorVehicle,Trailer&SemiT|Transport (automotive)|\n",
      "Niobium|Construction (Steel)|0,45|C25 - Manufacture of fabricated metal products, except machinery and equipment|148,35|C25-FabrMetalProds-NoMachin-Eq|Building & roads|\n",
      "Niobium|Stainless Steel|0,10|C24 - Manufacture of basic metals|55,43|C24-basic metals |Stainless Steel|\n",
      "Niobium|Oil & Gas|0,17|C24 - Manufacture of basic metals|55,43|C24-basic metals |Metals-Basics|\n",
      "Niobium|Special Steel|0,03|C30 - Manufacture of other transport equipment|44,30|C30-other transport equipment |Special Steel|\n",
      "Palladium|Autocatalyst|0,87|C29 - Manufacture of motor vehicles, trailers and semi-trailers|160,60|C29-MotorVehicle,Trailer&SemiT|Catalysts|\n",
      "Palladium|Electronics|0,04|C26 - Manufacture of computer, electronic and optical products|65,70|C26-Computer,Electron.Optic.Ps|Electrical and Electronics|\n",
      "Palladium|Chemical|0,04|C20 - Manufacture of chemicals and chemical products|105,51|C20-Chemicals & Chemc.Prods.|Chemicals|\n",
      "Palladium|Dental|0,02|C32-Other manuf.|39,16|C32-Other manuf.**|Others|\n",
      "Palladium|Jewellery|0,02|C32-Other manuf.|39,16|C32-Other manuf.**|Jewelery & others|\n",
      "Palladium|Other|0,00|Z99-Others|0,00|Z99-Others**|Others|\n",
      "Palladium|Investment|0,00|Z99-Others|0,00|Z99-Others**|Investment|\n",
      "Perlite|Building construction products|0,59|C23 - Manufacture of other non-metallic mineral products|57,26|C23-Oth.NoMetal.mineral Prods.|Building & roads|\n",
      "Perlite|Filter aid|0,24|C11 - Manufacture of beverages|32,51|C11-beverages |Foods|\n",
      "Perlite|Horticultural aggregate|0,11|C23 - Manufacture of other non-metallic mineral products|57,26|C23-Oth.NoMetal.mineral Prods.|Agriculture|\n",
      "Perlite|Fillers|0,06|C23 - Manufacture of other non-metallic mineral products|57,26|C23-Oth.NoMetal.mineral Prods.|Filler, extender, sealant|\n",
      "Phosphate rock|Mineral fertilizer|0,86|C20 - Manufacture of chemicals and chemical products|105,51|C20-Chemicals & Chemc.Prods.|Agriculture|\n",
      "Phosphate rock|Animal feed|0,10|C10 - Manufacture of food products|155,88|C10-food prods. |Animal feed|\n",
      "Phosphate rock|Detergents, chemicals, food additives|0,04|C20 - Manufacture of chemicals and chemical products|105,51|C20-Chemicals & Chemc.Prods.|Chemicals|\n",
      "Phosphorus|Chemicals|0,90|C20 - Manufacture of chemicals and chemical products|105,51|C20-Chemicals & Chemc.Prods.|Chemicals|\n",
      "Phosphorus|Metals|0,01|C25 - Manufacture of fabricated metal products, except machinery and equipment|148,35|C25-FabrMetalProds-NoMachin-Eq|Metals-Basics|\n",
      "Phosphorus|Electronics|0,05|C26 - Manufacture of computer, electronic and optical products|65,70|C26-Computer,Electron.Optic.Ps|Electrical and Electronics|\n",
      "Phosphorus|Agrochemicals|0,04|C20 - Manufacture of chemicals and chemical products|105,51|C20-Chemicals & Chemc.Prods.|Agriculture|\n",
      "Platinum|Autocatalyst|0,77|C29 - Manufacture of motor vehicles, trailers and semi-trailers|160,60|C29-MotorVehicle,Trailer&SemiT|Catalysts|\n",
      "Platinum|Jewellery|0,10|C32-Other manuf.|39,16|C32-Other manuf.**|Jewelery & others|\n",
      "Platinum|Chemical|0,06|C20 - Manufacture of chemicals and chemical products|105,51|C20-Chemicals & Chemc.Prods.|Chemicals|\n",
      "Platinum|Other|0,00|Z99-Others|0,00|Z99-Others**|Others|\n",
      "Platinum|Medical and Biomedical|0,04|C32-Other manuf.|39,16|C32-Other manuf.**|Medicine|\n",
      "Platinum|Investment|0,00|Z99-Others|0,00|Z99-Others**|Investment|\n",
      "Platinum|Petroleum|0,02|C19 - Manufacture of coke and refined petroleum products|17,29|C19-Coke & Refined Petrol. Ps|Energy (Oil)|\n",
      "Platinum|Electronics|0,01|C26 - Manufacture of computer, electronic and optical products|65,70|C26-Computer,Electron.Optic.Ps|Electrical and Electronics|\n",
      "Platinum|Glass|0,01|C23 - Manufacture of other non-metallic mineral products|57,26|C23-Oth.NoMetal.mineral Prods.|Glass|\n",
      "Potash|Fertiliser|0,92|C20 - Manufacture of chemicals and chemical products|105,51|C20-Chemicals & Chemc.Prods.|Agriculture|\n",
      "Potash|Chemical manufacture|0,08|C20 - Manufacture of chemicals and chemical products|105,51|C20-Chemicals & Chemc.Prods.|Chemicals|\n",
      "Praseodymium|Magnets|0,27|C25 - Manufacture of fabricated metal products, except machinery and equipment|148,35|C25-FabrMetalProds-NoMachin-Eq|Electrical and Electronics|\n",
      "Praseodymium|Ceramics|0,17|C23 - Manufacture of other non-metallic mineral products|57,26|C23-Oth.NoMetal.mineral Prods.|Ceramics|\n",
      "Praseodymium|Batteries|0,13|C27 - Manufacture of electrical equipment|80,75|C27-electrical equipment |Batteries|\n",
      "Praseodymium|Metal (no Battery)|0,12|C24 - Manufacture of basic metals|55,43|C24-basic metals |Metals-Basics|\n",
      "Praseodymium|Catalysts|0,11|C20 - Manufacture of chemicals and chemical products|105,51|C20-Chemicals & Chemc.Prods.|Catalysts|\n",
      "Praseodymium|Polishing powders|0,11|C26 - Manufacture of computer, electronic and optical products|65,70|C26-Computer,Electron.Optic.Ps|Electrical and Electronics|\n",
      "Praseodymium|Glass|0,09|C23 - Manufacture of other non-metallic mineral products|57,26|C23-Oth.NoMetal.mineral Prods.|Glass|\n",
      "Praseodymium|Other|0,00|Z99-Others|0,00|Z99-Others**|Others|\n",
      "Rhenium|Aerospace|0,83|C30 - Manufacture of other transport equipment|44,30|C30-other transport equipment |Transport (Aerospace)|\n",
      "Rhenium|Catalysts in petroleum industry|0,17|C19 - Manufacture of coke and refined petroleum products|17,29|C19-Coke & Refined Petrol. Ps|Energy (Oil)|\n",
      "Rhenium|Others|0,00|Z99-Others|0,00|Z99-Others**|Chemicals|\n",
      "Rhodium|Autocatalyst|0,84|C29 - Manufacture of motor vehicles, trailers and semi-trailers|160,60|C29-MotorVehicle,Trailer&SemiT|Catalysts|\n",
      "Rhodium|Glass|0,10|C23 - Manufacture of other non-metallic mineral products|57,26|C23-Oth.NoMetal.mineral Prods.|Glass|\n",
      "Rhodium|Chemical|0,06|C20 - Manufacture of chemicals and chemical products|105,51|C20-Chemicals & Chemc.Prods.|Chemicals|\n",
      "Rhodium|Other|0,00|Z99-Others|0,00|Z99-Others**|Others|\n",
      "Rhodium|Electronics|0,00|C26 - Manufacture of computer, electronic and optical products|65,70|C26-Computer,Electron.Optic.Ps|Electrical and Electronics|\n",
      "Ruthenium|Chemical|0,30|C20 - Manufacture of chemicals and chemical products|105,51|C20-Chemicals & Chemc.Prods.|Chemicals|\n",
      "Ruthenium|Electronics|0,48|C26 - Manufacture of computer, electronic and optical products|65,70|C26-Computer,Electron.Optic.Ps|Electrical and Electronics|\n",
      "Ruthenium|Electrochemical|0,22|C20 - Manufacture of chemicals and chemical products|105,51|C20-Chemicals & Chemc.Prods.|Electrical and Electronics|\n",
      "Ruthenium|Other|0,00|Z99-Others|0,00|Z99-Others**|Others|\n",
      "Samarium|Magnets|0,97|C25 - Manufacture of fabricated metal products, except machinery and equipment|148,35|C25-FabrMetalProds-NoMachin-Eq|Electrical and Electronics|\n",
      "Samarium|Medical and optical applications|0,03|C26 - Manufacture of computer, electronic and optical products|65,70|C26-Computer,Electron.Optic.Ps|Medicine|\n",
      "Sapele wood|Construction material|0,80|C16 - Manufacture of wood and of products of wood and cork, except furniture; manufacture of articles of straw and plaiting materials|27,97|C16-Wood,Cork,Straw,Plaiting-NoFur|Building & roads|\n",
      "Sapele wood|Furniture|0,10|C31 - Manufacture of furniture|26,17|C31-furniture |Furniture|\n",
      "Sapele wood|Boats|0,10|C30 - Manufacture of other transport equipment|44,30|C30-other transport equipment |Boats|\n",
      "Scandium|Solid Oxide Fuel Cells (SOFCs)|0,91|C27 - Manufacture of electrical equipment|80,75|C27-electrical equipment |Electrical and Electronics|\n",
      "Scandium|Al-Sc alloys|0,09|C25 - Manufacture of fabricated metal products, except machinery and equipment|148,35|C25-FabrMetalProds-NoMachin-Eq|Alloys|\n",
      "Scandium|Others|0,00|Z99-Others|0,00|Z99-Others**|Chemicals|\n",
      "Selenium|Metallurgy|0,40|C25 - Manufacture of fabricated metal products, except machinery and equipment|148,35|C25-FabrMetalProds-NoMachin-Eq|Metals-Basics|\n",
      "Selenium|Glass manufacturing|0,25|C23 - Manufacture of other non-metallic mineral products|57,26|C23-Oth.NoMetal.mineral Prods.|Glass|\n",
      "Selenium|Electronics|0,10|C26 - Manufacture of computer, electronic and optical products|65,70|C26-Computer,Electron.Optic.Ps|Electrical and Electronics|\n",
      "Selenium|Pigments|0,10|C20 - Manufacture of chemicals and chemical products|105,51|C20-Chemicals & Chemc.Prods.|Chemicals (Paint, Adhesives)|\n",
      "Selenium|Agricultural/ biological products|0,10|C20 - Manufacture of chemicals and chemical products|105,51|C20-Chemicals & Chemc.Prods.|Agriculture|\n",
      "Selenium|Other Applications|0,05|C20 - Manufacture of chemicals and chemical products|105,51|C20-Chemicals & Chemc.Prods.|Others|\n",
      "Silica sand|Construction and Soil|0,37|C23 - Manufacture of other non-metallic mineral products|57,26|C23-Oth.NoMetal.mineral Prods.|Building & roads|\n",
      "Silica sand|Glass|0,31|C23 - Manufacture of other non-metallic mineral products|57,26|C23-Oth.NoMetal.mineral Prods.|Glass|\n",
      "Silica sand|Others|0,16|C23 - Manufacture of other non-metallic mineral products|57,26|C23-Oth.NoMetal.mineral Prods.|Chemicals|\n",
      "Silica sand|Foundry|0,13|C24 - Manufacture of basic metals|55,43|C24-basic metals |Foundry|\n",
      "Silica sand|Filler, extender and sealant|0,03|C22 - Manufacture of rubber and plastic products|75,98|C22-rubber & plastic prods. |Filler, extender, sealant|\n",
      "Silica sand|Oil field|0,00|B06-Extraction (crude, gas)|19,75|B06-Extraction (crude, gas)**|Energy (Oil-Gas)|\n",
      "Silicon metal|Chemical applications|0,54|C20 - Manufacture of chemicals and chemical products|105,51|C20-Chemicals & Chemc.Prods.|Chemicals|\n",
      "Silicon metal|Aluminium alloys|0,38|C24 - Manufacture of basic metals|55,43|C24-basic metals |Alloys|\n",
      "Silicon metal|Solar applications|0,06|C26 - Manufacture of computer, electronic and optical products|65,70|C26-Computer,Electron.Optic.Ps|Energy (Solar)|\n",
      "Silicon metal|Electronic applications|0,02|C26 - Manufacture of computer, electronic and optical products|65,70|C26-Computer,Electron.Optic.Ps|Electrical and Electronics|\n",
      "Silver|Jewelery, Silverware, recreative products|0,31|C32-Other manuf.|39,16|C32-Other manuf.**|Jewelery & others|\n",
      "Silver|Paints, oxides, photograph|0,18|C20 - Manufacture of chemicals and chemical products|105,51|C20-Chemicals & Chemc.Prods.|Chemicals (Paint, Adhesives)|\n",
      "Silver|Automotive|0,08|C29 - Manufacture of motor vehicles, trailers and semi-trailers|160,60|C29-MotorVehicle,Trailer&SemiT|Transport (automotive)|\n",
      "Silver|Batteries|0,07|C27 - Manufacture of electrical equipment|80,75|C27-electrical equipment |Batteries|\n",
      "Silver|Industrial machinery|0,07|C28 - Manufacture of machinery and equipment n.e.c.|182,59|C28-Machinery &Equipment n.e.c|Industry|\n",
      "Silver|Other transport equipment|0,07|C30 - Manufacture of other transport equipment|44,30|C30-other transport equipment |Transport (automotive)|\n",
      "Silver|Electronic parts|0,06|C26 - Manufacture of computer, electronic and optical products|65,70|C26-Computer,Electron.Optic.Ps|Electrical and Electronics|\n",
      "Silver|Glass|0,06|C23 - Manufacture of other non-metallic mineral products|57,26|C23-Oth.NoMetal.mineral Prods.|Glass|\n",
      "Silver|Parts like bearings|0,06|C25 - Manufacture of fabricated metal products, except machinery and equipment|148,35|C25-FabrMetalProds-NoMachin-Eq|Industry|\n",
      "Silver|Medicine|0,04|C21 - Manufacture of basic pharmaceutical products and pharmaceutical preparations|80,18|C21-BasicPharmaceutic.&PhPreps|Medicine|\n",
      "Strontium|Drilling fluids|0,70|C23 - Manufacture of other non-metallic mineral products|57,26|C23-Oth.NoMetal.mineral Prods.|Mining-Extraction|\n",
      "Strontium|Pyrotechnics and signals|0,09|C20 - Manufacture of chemicals and chemical products|105,51|C20-Chemicals & Chemc.Prods.|Chemicals (Pyrotechnics)|\n",
      "Strontium|Magnets|0,09|C28 - Manufacture of machinery and equipment n.e.c.|182,59|C28-Machinery &Equipment n.e.c|Electrical and Electronics|\n",
      "Strontium|Master alloys|0,03|C24 - Manufacture of basic metals|55,43|C24-basic metals |Alloys|\n",
      "Strontium|Pigments and fillers|0,03|C20 - Manufacture of chemicals and chemical products|105,51|C20-Chemicals & Chemc.Prods.|Chemicals (Paint, Adhesives)|\n",
      "Strontium|Zinc production|0,03|C24 - Manufacture of basic metals|55,43|C24-basic metals |Metals-Basics|\n",
      "Strontium|Glass|0,03|C23 - Manufacture of other non-metallic mineral products|57,26|C23-Oth.NoMetal.mineral Prods.|Glass|\n",
      "Sulphur|Chemical applications|0,71|C20 - Manufacture of chemicals and chemical products|105,51|C20-Chemicals & Chemc.Prods.|Chemicals|\n",
      "Sulphur|Petroleum refining|0,24|C19 - Manufacture of coke and refined petroleum products|17,29|C19-Coke & Refined Petrol. Ps|Energy (Oil)|\n",
      "Sulphur|Metallurgy|0,04|C24 - Manufacture of basic metals|55,43|C24-basic metals |Metals-Basics|\n",
      "Sulphur|Paper production|0,01|C17 - Manufacture of paper and paper products|38,91|C17-paper & paper prods. |Chemicals (Paper)|\n",
      "Talc|Polymer for car industry|0,34|C22 - Manufacture of rubber and plastic products|75,98|C22-rubber & plastic prods. |Chemicals (Plastics)|\n",
      "Talc|Paper|0,21|C17 - Manufacture of paper and paper products|38,91|C17-paper & paper prods. |Chemicals (Paper)|\n",
      "Talc|Paint and Coatings|0,18|C20 - Manufacture of chemicals and chemical products|105,51|C20-Chemicals & Chemc.Prods.|Chemicals (Paint, Adhesives)|\n",
      "Talc|Feed|0,08|C10 - Manufacture of food products|155,88|C10-food prods. |Foods|\n",
      "Talc|Building material|0,07|C23 - Manufacture of other non-metallic mineral products|57,26|C23-Oth.NoMetal.mineral Prods.|Building & roads|\n",
      "Talc|Fertilizers|0,04|C20 - Manufacture of chemicals and chemical products|105,51|C20-Chemicals & Chemc.Prods.|Agriculture|\n",
      "Talc|Others|0,04|C21 - Manufacture of basic pharmaceutical products and pharmaceutical preparations|80,18|C21-BasicPharmaceutic.&PhPreps|Chemicals|\n",
      "Talc|Rubber|0,02|C22 - Manufacture of rubber and plastic products|75,98|C22-rubber & plastic prods. |Chemicals(Rubber)|\n",
      "Talc|Cosmetics|0,01|C21 - Manufacture of basic pharmaceutical products and pharmaceutical preparations|80,18|C21-BasicPharmaceutic.&PhPreps|Cosmetics|\n",
      "Talc|Pharmaceuticals|0,01|C21 - Manufacture of basic pharmaceutical products and pharmaceutical preparations|80,18|C21-BasicPharmaceutic.&PhPreps|Pharmacy|\n",
      "Tantalum|Capacitors|0,40|C26 - Manufacture of computer, electronic and optical products|65,70|C26-Computer,Electron.Optic.Ps|Capacitors|\n",
      "Tantalum|Sputtering targets|0,20|C26 - Manufacture of computer, electronic and optical products|65,70|C26-Computer,Electron.Optic.Ps|Electrical and Electronics|\n",
      "Tantalum|Superalloys|0,14|C30 - Manufacture of other transport equipment|44,30|C30-other transport equipment |Superalloys|\n",
      "Tantalum|Chemicals|0,12|C20 - Manufacture of chemicals and chemical products|105,51|C20-Chemicals & Chemc.Prods.|Chemicals|\n",
      "Tantalum|Carbides|0,10|C28 - Manufacture of machinery and equipment n.e.c.|182,59|C28-Machinery &Equipment n.e.c|Hard materials (tools)|\n",
      "Tantalum|Mill products|0,04|C25 - Manufacture of fabricated metal products, except machinery and equipment|148,35|C25-FabrMetalProds-NoMachin-Eq|Industry|\n",
      "Tellurium|Solar power|0,40|C26 - Manufacture of computer, electronic and optical products|65,70|C26-Computer,Electron.Optic.Ps|Energy (Solar)|\n",
      "Tellurium|Thermo-electric devices|0,30|C26 - Manufacture of computer, electronic and optical products|65,70|C26-Computer,Electron.Optic.Ps|Thermo-electric devices|\n",
      "Tellurium|Metallurgy|0,15|C25 - Manufacture of fabricated metal products, except machinery and equipment|148,35|C25-FabrMetalProds-NoMachin-Eq|Metals-Basics|\n",
      "Tellurium|Chemical manufacture|0,10|C20 - Manufacture of chemicals and chemical products|105,51|C20-Chemicals & Chemc.Prods.|Chemicals|\n",
      "Tellurium|Rubber vulcanising|0,05|C22 - Manufacture of rubber and plastic products|75,98|C22-rubber & plastic prods. |Chemicals(Rubber)|\n",
      "Terbium|Lighting|0,68|C27 - Manufacture of electrical equipment|80,75|C27-electrical equipment |Electrical and Electronics|\n",
      "Terbium|Magnets|0,32|C25 - Manufacture of fabricated metal products, except machinery and equipment|148,35|C25-FabrMetalProds-NoMachin-Eq|Electrical and Electronics|\n",
      "Tin|Solders|0,47|C26 - Manufacture of computer, electronic and optical products|65,70|C26-Computer,Electron.Optic.Ps|Electrical and Electronics|\n",
      "Tin|Chemicals|0,18|C20 - Manufacture of chemicals and chemical products|105,51|C20-Chemicals & Chemc.Prods.|Chemicals|\n",
      "Tin|Tinplate|0,13|C25 - Manufacture of fabricated metal products, except machinery and equipment|148,35|C25-FabrMetalProds-NoMachin-Eq|Tinplate|\n",
      "Tin|Others|0,10|C25 - Manufacture of fabricated metal products, except machinery and equipment|148,35|C25-FabrMetalProds-NoMachin-Eq|Chemicals|\n",
      "Tin|Lead acid batteries|0,06|C27 - Manufacture of electrical equipment|80,75|C27-electrical equipment |Batteries (Lead)|\n",
      "Tin|Copper alloys|0,06|C24 - Manufacture of basic metals|55,43|C24-basic metals |Alloys|\n",
      "Titanium|Paints|0,54|C20 - Manufacture of chemicals and chemical products|105,51|C20-Chemicals & Chemc.Prods.|Chemicals (Paint, Adhesives)|\n",
      "Titanium|Polymers|0,24|C22 - Manufacture of rubber and plastic products|75,98|C22-rubber & plastic prods. |Chemicals (Plastics)|\n",
      "Titanium|Aerospace|0,08|C30 - Manufacture of other transport equipment|44,30|C30-other transport equipment |Transport (Aerospace)|\n",
      "Titanium|Medical equipment|0,06|C28 - Manufacture of machinery and equipment n.e.c.|182,59|C28-Machinery &Equipment n.e.c|Medicine|\n",
      "Titanium|Automotive|0,03|C29 - Manufacture of motor vehicles, trailers and semi-trailers|160,60|C29-MotorVehicle,Trailer&SemiT|Transport (automotive)|\n",
      "Titanium|Hand held objects|0,02|C25 - Manufacture of fabricated metal products, except machinery and equipment|148,35|C25-FabrMetalProds-NoMachin-Eq|Metal Prods.|\n",
      "Titanium|Alloys|0,02|C24 - Manufacture of basic metals|55,43|C24-basic metals |Alloys|\n",
      "Titanium|Various|0,01|C21 - Manufacture of basic pharmaceutical products and pharmaceutical preparations|80,18|C21-BasicPharmaceutic.&PhPreps|Pharmacy|\n",
      "Tungsten|Mill and cutting tools|0,33|C28 - Manufacture of machinery and equipment n.e.c.|182,59|C28-Machinery &Equipment n.e.c|Industry|\n",
      "Tungsten|Mining and construction tools|0,23|C28 - Manufacture of machinery and equipment n.e.c.|182,59|C28-Machinery &Equipment n.e.c|Industry|\n",
      "Tungsten|Other wear tools|0,18|C28 - Manufacture of machinery and equipment n.e.c.|182,59|C28-Machinery &Equipment n.e.c|Industry|\n",
      "Tungsten|Catalysts and pigments|0,08|C20 - Manufacture of chemicals and chemical products|105,51|C20-Chemicals & Chemc.Prods.|Catalysts|\n",
      "Tungsten|Lighting and electronic uses|0,06|C26 - Manufacture of computer, electronic and optical products|65,70|C26-Computer,Electron.Optic.Ps|Electrical and Electronics|\n",
      "Tungsten|High speed steels applications|0,06|C25 - Manufacture of fabricated metal products, except machinery and equipment|148,35|C25-FabrMetalProds-NoMachin-Eq|Steels|\n",
      "Tungsten|Aeronautics and energy uses|0,05|C28 - Manufacture of machinery and equipment n.e.c.|182,59|C28-Machinery &Equipment n.e.c|Aeronautics & energy|\n",
      "Tungsten|others|0,00|Z99-Others|0,00|Z99-Others**|Chemicals|\n",
      "Vanadium|High-strength low-alloy steels (HSLA)|0,60|C24 - Manufacture of basic metals|55,43|C24-basic metals |Steels|\n",
      "Vanadium|Special steel|0,30|C25 - Manufacture of fabricated metal products, except machinery and equipment|148,35|C25-FabrMetalProds-NoMachin-Eq|Special Steel|\n",
      "Vanadium|Super alloys for high-end uses|0,03|C29 - Manufacture of motor vehicles, trailers and semi-trailers|160,60|C29-MotorVehicle,Trailer&SemiT|Transport (automotive)|\n",
      "Vanadium|Chemicals|0,03|C20 - Manufacture of chemicals and chemical products|105,51|C20-Chemicals & Chemc.Prods.|Chemicals|\n",
      "Vanadium|Cast Iron-rigid structures|0,02|C30 - Manufacture of other transport equipment|44,30|C30-other transport equipment |Cast Iron for rigid structures|\n",
      "Vanadium|Stainless steel|0,01|C28 - Manufacture of machinery and equipment n.e.c.|182,59|C28-Machinery &Equipment n.e.c|Stainless Steel|\n",
      "Vanadium|Energy storage|0,01|C27 - Manufacture of electrical equipment|80,75|C27-electrical equipment |Electrical and Electronics|\n",
      "Yttrium|Lighting|0,50|C27 - Manufacture of electrical equipment|80,75|C27-electrical equipment |Electrical and Electronics|\n",
      "Yttrium|Ceramics|0,38|C23 - Manufacture of other non-metallic mineral products|57,26|C23-Oth.NoMetal.mineral Prods.|Ceramics|\n",
      "Yttrium|Alloys|0,08|C24 - Manufacture of basic metals|55,43|C24-basic metals |Alloys|\n",
      "Yttrium|Glass|0,04|C23 - Manufacture of other non-metallic mineral products|57,26|C23-Oth.NoMetal.mineral Prods.|Glass|\n",
      "Yttrium|Others|0,00|Z99-Others|0,00|Z99-Others**|Chemicals|\n",
      "Zinc|Galvanising|0,52|C25 - Manufacture of fabricated metal products, except machinery and equipment|148,35|C25-FabrMetalProds-NoMachin-Eq|Galvanising|\n",
      "Zinc|Zinc alloys|0,17|C24 - Manufacture of basic metals|55,43|C24-basic metals |Metals-Basics|\n",
      "Zinc|Brass and bronze|0,15|C24 - Manufacture of basic metals|55,43|C24-basic metals |Metals-Basics|\n",
      "Zinc|Zinc compounds (incl. dust and powder)|0,10|C20 - Manufacture of chemicals and chemical products|105,51|C20-Chemicals & Chemc.Prods.|Chemicals|\n",
      "Zinc|Zinc semi-manufactures|0,06|C25 - Manufacture of fabricated metal products, except machinery and equipment|148,35|C25-FabrMetalProds-NoMachin-Eq|Metals-Basics|\n",
      "Zirconium|Ceramics|0,43|C23 - Manufacture of other non-metallic mineral products|57,26|C23-Oth.NoMetal.mineral Prods.|Ceramics|\n",
      "Zirconium|Refractories|0,15|C23 - Manufacture of other non-metallic mineral products|57,26|C23-Oth.NoMetal.mineral Prods.|Industry|\n",
      "Zirconium|Foundry|0,15|C24 - Manufacture of basic metals|55,43|C24-basic metals |Foundry|\n",
      "Zirconium|Chemicals|0,12|C20 - Manufacture of chemicals and chemical products|105,51|C20-Chemicals & Chemc.Prods.|Chemicals|\n",
      "Zirconium|Others|0,10|C26 - Manufacture of computer, electronic and optical products|65,70|C26-Computer,Electron.Optic.Ps|Chemicals|\n",
      "Zirconium|Pigments|0,03|C20 - Manufacture of chemicals and chemical products|105,51|C20-Chemicals & Chemc.Prods.|Chemicals (Paint, Adhesives)|\n",
      "Zirconium|Superalloys, Nuclear|0,02|C24 - Manufacture of basic metals|55,43|C24-basic metals |Energy (Nuclear)|\n"
     ]
    }
   ],
   "source": [
    "strSeparator = \"|\"\n",
    "for i in range(0, dfRelAplics.shape[0]):\n",
    "    strVar = \"\"\n",
    "    for j in range(0, dfRelAplics.shape[1]):\n",
    "        strVar += dfRelAplics[dfRelAplics.columns[j]][i]\n",
    "        strVar += strSeparator\n",
    "    print(strVar) \n",
    "# se visualiza con el separador específico identificado en la variable  - strSeparator"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "85dd45af",
   "metadata": {
    "scrolled": true
   },
   "source": [
    "# CREAR RELACION ENTRE  Material Procesado y  Grupo Aplicación\n",
    "### RELACIÓN: _MaterialRef (MaterialApl) --[USADO_EN]--> GrupoAplicacion_\n",
    "**Observaciones:**   \n",
    "(1) Nodos previamente creados      \n",
    "(2) Relación con DOS propiedades:  \n",
    "**SHR_MApl** con el valor de ShareSectorApl, o valor entre 0 y 1 con la proporción de aportación de ese material a esa aplicación-sector  \n",
    "**VAM_MApl** _(CALCULADO)_ = ShareSectorApl x ValorAnadidoSector - Es el valor añadido específico de ese  material para esa aplicación-sector. Por tanto se define como la cantidad proporcional (en millones de euros) que aporta  como valor añadido un material a una aplicación de uso y sector -1 aplicación de uso asignada a 1 sector-)  \n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "100893e2",
   "metadata": {},
   "source": [
    "### Consulta patrón _CQL-Neo4j_ para crear la relación buscada  \n",
    "**MATCH**   \n",
    "    (a:**MaterialREF**),  \n",
    "    (b:**GrupoAplicacion**)  \n",
    "\n",
    "**WHERE** a.name = _\"materialxxx_REF\"_ **AND** b.name = _\"grupoaplicacionxxx\"_  \n",
    "**CREATE** (a)**-[r:USADO_EN {SHR_MApl: 0.nn, VAM_MApl: mmmm.mm }]->**(b)  \n",
    "**RETURN** type(r)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "id": "2829b3d8",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "442"
      ]
     },
     "execution_count": 20,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "nFilas = dfRelAplics.shape[0]\n",
    "nFilas "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "id": "bd3533a0",
   "metadata": {
    "scrolled": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "QRY [0]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Aluminium_REF' AND b.name = 'Building & roads' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.23, VAM_MApl: 34.1205} ]->(b) RETURN type(r)\n",
      "QRY [1]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Aluminium_REF' AND b.name = 'Transport (automotive)' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.21, VAM_MApl: 33.726} ]->(b) RETURN type(r)\n"
     ]
    }
   ],
   "source": [
    "#  Crear RELACION USADO_EN -  Una fila por cada relación, contiene el MaterialREF (MaterialApl) y su GrupoAplicacion  \n",
    "# (previamente creados ambos nodos) \n",
    "#  Nodos: MaterialREF -- para ser asignado a cada aplicación o uso de ese material \n",
    "#  Nodos: GrupoAplicacion -- para identificar cada grupo de aplicación de un material procesado/refinado\n",
    "## PREVISAULIZAR QUERYs antes de la ejecución (visualizar 2 de muestra)\n",
    "TipoNodoA = \"(a:MaterialREF)\"\n",
    "TipoNodoB = \"(b:GrupoAplicacion)\"\n",
    "TipoRelacion = \" :USADO_EN\" \n",
    "inicio = 0\n",
    "nFilas = 2\n",
    "#\n",
    "for i in range(inicio, nFilas):\n",
    "    VAMtmp = round(float(dfRelAplics.ShareSectorApl[i].replace(',', '.')) *               \\\n",
    "                   float(dfRelAplics.ValorAnadidoSector[i].replace(',', '.')), 4)\n",
    "    strQry = \"MATCH \"                                        \\\n",
    "            + TipoNodoA + \", \" + TipoNodoB                   \\\n",
    "            + \" WHERE a.name = '\"                             \\\n",
    "            +  dfRelAplics.MaterialApl[i]                    \\\n",
    "            + \"_REF' AND b.name = '\"                       \\\n",
    "            +  dfRelAplics.GrupoAplicacion[i]                                      \\\n",
    "            + \"'\"                                                                   \\\n",
    "            + \" CREATE (a)-[r\" + TipoRelacion                                       \\\n",
    "            + \" { SHR_MApl: \"                                                        \\\n",
    "            + dfRelAplics.ShareSectorApl[i].replace(',', '.')                       \\\n",
    "            + \", VAM_MApl: \"                                                        \\\n",
    "            + str( VAMtmp )                                                          \\\n",
    "            + \"} ]->(b)\"                                                               \\\n",
    "            + \" RETURN type(r)\"                                 \n",
    "    print(\"QRY [\" + str(i) + \"]> \"+ strQry)\n",
    "# querys  visualizadas\n",
    "#            + dfRelAplics.ShareSectorApl.replace(',', '.')                                        \\\n",
    "#            + \", VAM_MApl: \"                                                           \\\n",
    "#            + dfRelAplics.ValorAnadidoSector.replace(',', '.') * dfRelAplics.ShareSectorApl.replace(',', '.') \\\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "id": "daf726b0",
   "metadata": {
    "scrolled": false
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "Graph('bolt://localhost:7687')"
      ]
     },
     "execution_count": 22,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#comprobar que sigue abierta la conexión para enviar las queries a la BD \n",
    "graph_test01"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "825c0e98",
   "metadata": {},
   "source": [
    "\n",
    "# Ejecutar 2 relaciones, comprobar y en caso ok, lanzar el resto "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "id": "b2a8c8f1",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "EJECUTADA QRY [0]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Aluminium_REF' AND b.name = 'Building & roads' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.23, VAM_MApl: 34.1205} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [1]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Aluminium_REF' AND b.name = 'Transport (automotive)' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.21, VAM_MApl: 33.726} ]->(b) RETURN type(r)\n"
     ]
    }
   ],
   "source": [
    "# Crear la RELACIÓN en la BD , una por CADA FILA \n",
    "#relación :USADO_EN\n",
    "## query para crea la relación con sus propiedades \n",
    "inicio = 0\n",
    "nFilas = 2\n",
    "\n",
    "for i in range(inicio, nFilas):\n",
    "    VAMtmp = round(float(dfRelAplics.ShareSectorApl[i].replace(',', '.')) *               \\\n",
    "                   float(dfRelAplics.ValorAnadidoSector[i].replace(',', '.')), 4)\n",
    "    strQry = \"MATCH \"                                           \\\n",
    "            + TipoNodoA + \", \" + TipoNodoB                      \\\n",
    "            + \" WHERE a.name = '\"                               \\\n",
    "            +  dfRelAplics.MaterialApl[i]                       \\\n",
    "            + \"_REF' AND b.name = '\"                            \\\n",
    "            +  dfRelAplics.GrupoAplicacion[i]                   \\\n",
    "            + \"'\"                                               \\\n",
    "            + \" CREATE (a)-[r\" + TipoRelacion                   \\\n",
    "            + \" { SHR_MApl: \"                                   \\\n",
    "            + dfRelAplics.ShareSectorApl[i].replace(',', '.')   \\\n",
    "            + \", VAM_MApl: \"                                    \\\n",
    "            + str( VAMtmp )                                     \\\n",
    "            + \"} ]->(b)\"                                        \\\n",
    "            + \" RETURN type(r)\"                                 \n",
    "#\n",
    "# ejecutar Query en BD abierta - Neo4j\n",
    "#\n",
    "    graph_test01.run(strQry)\n",
    "#Visualizar Query ejecutada \n",
    "    print(\"EJECUTADA QRY [\" + str(i) + \"]> \"+ strQry)\n",
    "# nodos creados"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "id": "8e97ade6",
   "metadata": {},
   "outputs": [],
   "source": [
    "# guardar como dataframe el resultado de buscar todas las relaciones creadas de tipo USADO_EN\n",
    "# de momento sólo están creadas las 2 primeras, y etiquetamos el resultado con el nombre de la relación \n",
    "dfGraphMat= graph_test01.run(\"MATCH p=()-[r:USADO_EN]->() RETURN (p) as USADO_EN\").to_data_frame()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "id": "0726943c",
   "metadata": {
    "scrolled": false
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>USADO_EN</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>({'VAM_MApl': 34.1205, 'SHR_MApl': 0.23})</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>({'VAM_MApl': 33.726, 'SHR_MApl': 0.21})</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                    USADO_EN\n",
       "0  ({'VAM_MApl': 34.1205, 'SHR_MApl': 0.23})\n",
       "1   ({'VAM_MApl': 33.726, 'SHR_MApl': 0.21})"
      ]
     },
     "execution_count": 25,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# visualizar el dataframe generado con .to_data_frame() perteneciente a la funcionalidad de la librería py2neo\n",
    "dfGraphMat\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 26,
   "id": "2f0a9723",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "(442, 7)"
      ]
     },
     "execution_count": 26,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "dfRelAplics.shape"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "f4b44ea3",
   "metadata": {},
   "source": [
    "### Creamos el resto de las relaciones para las restantes 445 filas (rango desde 2 a 447 ) \n",
    "una vez que se verifica la creación de las 2 primeras filas"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 27,
   "id": "889ce56d",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "EJECUTADA QRY [2]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Aluminium_REF' AND b.name = 'Transport (automotive)' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.21, VAM_MApl: 9.303} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [3]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Aluminium_REF' AND b.name = 'Packaging' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.17, VAM_MApl: 25.2195} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [4]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Aluminium_REF' AND b.name = 'High Tech Engineering' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.12, VAM_MApl: 21.9108} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [5]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Aluminium_REF' AND b.name = 'Consumer Durables' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.06, VAM_MApl: 8.901} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [6]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Antimony_REF' AND b.name = 'Chemicals' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.43, VAM_MApl: 45.3693} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [7]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Antimony_REF' AND b.name = 'Batteries (Lead)' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.32, VAM_MApl: 25.84} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [8]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Antimony_REF' AND b.name = 'Alloys' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.14, VAM_MApl: 20.769} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [9]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Antimony_REF' AND b.name = 'Chemicals (Plastics)' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.06, VAM_MApl: 6.3306} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [10]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Antimony_REF' AND b.name = 'Glass' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.05, VAM_MApl: 2.863} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [11]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Arsenic_REF' AND b.name = 'Metals-Basics' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.71, VAM_MApl: 39.3553} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [12]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Arsenic_REF' AND b.name = 'Glass' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.18, VAM_MApl: 10.3068} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [13]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Arsenic_REF' AND b.name = 'Chemicals' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.07, VAM_MApl: 7.3857} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [14]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Arsenic_REF' AND b.name = 'Alloys' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.05, VAM_MApl: 2.7715} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [15]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Arsenic_REF' AND b.name = 'Electrical and Electronics' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.00, VAM_MApl: 0.0} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [16]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Baryte_REF' AND b.name = 'Mining-Extraction' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.60, VAM_MApl: 34.356} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [17]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Baryte_REF' AND b.name = 'Filler, extender, sealant' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.30, VAM_MApl: 22.794} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [18]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Baryte_REF' AND b.name = 'Chemicals' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.10, VAM_MApl: 10.551} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [19]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Bauxite_REF' AND b.name = 'Metals-Basics' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.90, VAM_MApl: 49.887} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [20]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Bauxite_REF' AND b.name = 'Industry' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.03, VAM_MApl: 1.7178} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [21]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Bauxite_REF' AND b.name = 'Building & roads' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.03, VAM_MApl: 1.7178} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [22]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Bauxite_REF' AND b.name = 'Abrasives' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.02, VAM_MApl: 1.1452} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [23]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Bauxite_REF' AND b.name = 'Chemicals' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.02, VAM_MApl: 2.1102} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [24]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Bentonite_REF' AND b.name = 'Pets' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.34, VAM_MApl: 19.4684} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [25]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Bentonite_REF' AND b.name = 'Foundry' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.22, VAM_MApl: 12.1946} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [26]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Bentonite_REF' AND b.name = 'Civil engineering' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.13, VAM_MApl: 7.4438} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [27]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Bentonite_REF' AND b.name = 'Foods' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.03, VAM_MApl: 0.9753} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [28]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Bentonite_REF' AND b.name = 'Metals-Basics' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.08, VAM_MApl: 4.4344} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [29]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Bentonite_REF' AND b.name = 'Chemicals' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.08, VAM_MApl: 8.4408} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [30]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Bentonite_REF' AND b.name = 'Chemicals (Paper)' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.03, VAM_MApl: 1.1673} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [31]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Bentonite_REF' AND b.name = 'Mining-Extraction' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.07, VAM_MApl: 0.238} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [32]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Bentonite_REF' AND b.name = 'Chemicals' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.02, VAM_MApl: 2.1102} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [33]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Beryllium_REF' AND b.name = 'Electrical and Electronics' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.42, VAM_MApl: 27.594} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [34]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Beryllium_REF' AND b.name = 'Defense' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.17, VAM_MApl: 11.169} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [35]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Beryllium_REF' AND b.name = 'Defense' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.17, VAM_MApl: 27.302} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [36]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Beryllium_REF' AND b.name = 'Defense' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.10, VAM_MApl: 4.43} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [37]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Beryllium_REF' AND b.name = 'Electrical and Electronics' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.08, VAM_MApl: 5.256} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [38]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Beryllium_REF' AND b.name = 'Industry' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.03, VAM_MApl: 5.4777} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [39]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Beryllium_REF' AND b.name = 'Industry' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.03, VAM_MApl: 1.6629} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [40]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Beryllium_REF' AND b.name = 'Chemicals' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.00, VAM_MApl: 0.0} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [41]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Bismuth_REF' AND b.name = 'Chemicals' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.62, VAM_MApl: 65.4162} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [42]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Bismuth_REF' AND b.name = 'Alloys' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.28, VAM_MApl: 10.9648} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [43]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Bismuth_REF' AND b.name = 'Metals-Basics' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.10, VAM_MApl: 5.543} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [44]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Borate_REF' AND b.name = 'Glass' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.55, VAM_MApl: 31.493} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [45]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Borate_REF' AND b.name = 'Ceramics & Frits' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.17, VAM_MApl: 9.7342} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [46]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Borate_REF' AND b.name = 'Agriculture' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.15, VAM_MApl: 15.8265} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [47]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Borate_REF' AND b.name = 'Chemicals' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.04, VAM_MApl: 4.2204} ]->(b) RETURN type(r)\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "EJECUTADA QRY [48]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Borate_REF' AND b.name = 'Building & roads' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.04, VAM_MApl: 4.2204} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [49]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Borate_REF' AND b.name = 'Metals-Basics' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.04, VAM_MApl: 2.2172} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [50]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Borate_REF' AND b.name = 'Others' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.00, VAM_MApl: 0.0} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [51]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Cadmium_REF' AND b.name = 'Batteries' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.80, VAM_MApl: 64.6} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [52]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Cadmium_REF' AND b.name = 'Chemicals (Paint, Adhesives)' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.11, VAM_MApl: 11.6061} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [53]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Cadmium_REF' AND b.name = 'Coatings' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.07, VAM_MApl: 10.3845} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [54]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Cadmium_REF' AND b.name = 'Chemicals' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.02, VAM_MApl: 2.1102} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [55]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Cadmium_REF' AND b.name = 'Chemicals' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.00, VAM_MApl: 0.0} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [56]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Cerium_REF' AND b.name = 'Catalysts' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.35, VAM_MApl: 36.9285} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [57]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Cerium_REF' AND b.name = 'Ceramics & Frits' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.33, VAM_MApl: 18.8958} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [58]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Cerium_REF' AND b.name = 'Electrical and Electronics' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.11, VAM_MApl: 7.227} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [59]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Cerium_REF' AND b.name = 'Energy (Oil)' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.08, VAM_MApl: 1.3832} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [60]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Cerium_REF' AND b.name = 'Metals-Basics' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.06, VAM_MApl: 3.3258} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [61]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Cerium_REF' AND b.name = 'Batteries' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.06, VAM_MApl: 4.845} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [62]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Cerium_REF' AND b.name = 'Electrical and Electronics' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.01, VAM_MApl: 0.8075} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [63]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Chromium_REF' AND b.name = 'Tools (Stainless Steel)' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.74, VAM_MApl: 109.779} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [64]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Chromium_REF' AND b.name = 'Alloys' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.19, VAM_MApl: 28.1865} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [65]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Chromium_REF' AND b.name = 'Casting Molds' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.03, VAM_MApl: 1.6629} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [66]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Chromium_REF' AND b.name = 'Chemicals' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.03, VAM_MApl: 3.1653} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [67]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Chromium_REF' AND b.name = 'Industry' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.01, VAM_MApl: 0.5726} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [68]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Chromium_REF' AND b.name = 'Others' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.00, VAM_MApl: 0.0} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [69]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Cobalt_REF' AND b.name = 'Superalloys' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.36, VAM_MApl: 53.406} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [70]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Cobalt_REF' AND b.name = 'Tools (Hard materials)' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.14, VAM_MApl: 20.769} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [71]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Cobalt_REF' AND b.name = 'Chemicals (Paint, Adhesives)' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.13, VAM_MApl: 13.7163} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [72]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Cobalt_REF' AND b.name = 'Catalysts' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.12, VAM_MApl: 12.6612} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [73]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Cobalt_REF' AND b.name = 'Chemicals (Paint, Adhesives)' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.11, VAM_MApl: 11.6061} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [74]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Cobalt_REF' AND b.name = 'Electrical and Electronics' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.07, VAM_MApl: 5.6525} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [75]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Cobalt_REF' AND b.name = 'Chemicals' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.06, VAM_MApl: 6.3306} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [76]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Cobalt_REF' AND b.name = 'Batteries' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.03, VAM_MApl: 2.4225} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [77]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Coking coal_REF' AND b.name = 'Steel' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.82, VAM_MApl: 45.4526} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [78]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Coking coal_REF' AND b.name = 'Coke (Others)' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.09, VAM_MApl: 5.1534} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [79]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Coking coal_REF' AND b.name = 'Chemicals' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.08, VAM_MApl: 8.4408} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [80]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Copper_REF' AND b.name = 'Transport (automotive)' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.06, VAM_MApl: 9.636} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [81]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Copper_REF' AND b.name = 'Electrical and Electronics' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.14, VAM_MApl: 9.198} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [82]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Copper_REF' AND b.name = 'Jewelery & others' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.05, VAM_MApl: 1.958} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [83]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Copper_REF' AND b.name = 'Transport (all)' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.10, VAM_MApl: 10.551} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [84]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Copper_REF' AND b.name = 'Furniture' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.02, VAM_MApl: 0.5234} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [85]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Copper_REF' AND b.name = 'Chemicals' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.03, VAM_MApl: 3.1653} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [86]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Copper_REF' AND b.name = 'Electrical and Electronics' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.02, VAM_MApl: 1.1086} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [87]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Copper_REF' AND b.name = 'Components and household' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.22, VAM_MApl: 17.765} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [88]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Copper_REF' AND b.name = 'Tubes, plates, wire' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.21, VAM_MApl: 31.1535} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [89]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Copper_REF' AND b.name = 'Industry' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.15, VAM_MApl: 27.3885} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [90]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Diatomite_REF' AND b.name = 'Foods' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.48, VAM_MApl: 15.6048} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [91]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Diatomite_REF' AND b.name = 'Mining-Extraction' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.23, VAM_MApl: 13.1698} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [92]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Diatomite_REF' AND b.name = 'Activated raw granules' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.13, VAM_MApl: 7.4438} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [93]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Diatomite_REF' AND b.name = 'Pets' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.07, VAM_MApl: 4.0082} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [94]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Diatomite_REF' AND b.name = 'Civil engineering' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.06, VAM_MApl: 3.4356} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [95]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Diatomite_REF' AND b.name = 'Mining-Extraction' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.02, VAM_MApl: 0.068} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [96]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Diatomite_REF' AND b.name = 'Foundry' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.01, VAM_MApl: 0.5543} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [97]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Dysprosium_REF' AND b.name = 'Electrical and Electronics' CREATE (a)-[r :USADO_EN { SHR_MApl: 1.00, VAM_MApl: 148.35} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [98]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Erbium_REF' AND b.name = 'Glass' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.74, VAM_MApl: 42.3724} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [99]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Erbium_REF' AND b.name = 'Electrical and Electronics' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.26, VAM_MApl: 20.995} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [100]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Europium_REF' AND b.name = 'Electrical and Electronics' CREATE (a)-[r :USADO_EN { SHR_MApl: 1.00, VAM_MApl: 80.75} ]->(b) RETURN type(r)\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "EJECUTADA QRY [101]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Feldspar_REF' AND b.name = 'Ceramics' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.45, VAM_MApl: 25.767} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [102]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Feldspar_REF' AND b.name = 'Glass' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.06, VAM_MApl: 3.4356} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [103]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Feldspar_REF' AND b.name = 'Building & roads' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.46, VAM_MApl: 26.3396} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [104]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Feldspar_REF' AND b.name = 'Chemicals' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.03, VAM_MApl: 0.0} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [105]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Fluorspar_REF' AND b.name = 'Metals-Basics' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.36, VAM_MApl: 19.9548} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [106]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Fluorspar_REF' AND b.name = 'Electrical and Electronics' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.09, VAM_MApl: 7.2675} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [107]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Fluorspar_REF' AND b.name = 'Electrical and Electronics' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.09, VAM_MApl: 14.454} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [108]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Fluorspar_REF' AND b.name = 'Metals-Basics' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.15, VAM_MApl: 8.3145} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [109]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Fluorspar_REF' AND b.name = 'Electrical and Electronics' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.11, VAM_MApl: 8.8825} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [110]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Fluorspar_REF' AND b.name = 'Chemicals' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.10, VAM_MApl: 10.551} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [111]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Fluorspar_REF' AND b.name = 'Energy (Nuclear)' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.06, VAM_MApl: 3.3258} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [112]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Fluorspar_REF' AND b.name = 'Energy (Oil)' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.03, VAM_MApl: 0.5187} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [113]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Gadolinium_REF' AND b.name = 'Electrical and Electronics' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.38, VAM_MApl: 56.373} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [114]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Gadolinium_REF' AND b.name = 'Metals-Basics' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.30, VAM_MApl: 16.629} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [115]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Gadolinium_REF' AND b.name = 'Electrical and Electronics' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.25, VAM_MApl: 20.1875} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [116]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Gadolinium_REF' AND b.name = 'Electrical and Electronics' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.08, VAM_MApl: 6.4144} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [117]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Gadolinium_REF' AND b.name = 'Others' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.00, VAM_MApl: 0.0} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [118]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Gallium_REF' AND b.name = 'Electrical and Electronics' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.70, VAM_MApl: 45.99} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [119]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Gallium_REF' AND b.name = 'Electrical and Electronics' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.25, VAM_MApl: 20.1875} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [120]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Gallium_REF' AND b.name = 'Energy (Solar)' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.05, VAM_MApl: 3.285} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [121]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Germanium_REF' AND b.name = 'Electrical and Electronics' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.47, VAM_MApl: 30.879} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [122]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Germanium_REF' AND b.name = 'Electrical and Electronics' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.40, VAM_MApl: 32.3} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [123]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Germanium_REF' AND b.name = 'Energy (Solar)' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.13, VAM_MApl: 8.541} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [124]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Germanium_REF' AND b.name = 'Chemicals' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.00, VAM_MApl: 0.0} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [125]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Gold_REF' AND b.name = 'Jewelery & others' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.86, VAM_MApl: 33.6776} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [126]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Gold_REF' AND b.name = 'Electrical and Electronics' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.11, VAM_MApl: 7.227} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [127]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Gold_REF' AND b.name = 'Industry' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.02, VAM_MApl: 0.7832} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [128]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Gold_REF' AND b.name = 'Others' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.01, VAM_MApl: 0.3916} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [129]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Gypsum_REF' AND b.name = 'Building & roads' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.51, VAM_MApl: 29.2026} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [130]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Gypsum_REF' AND b.name = 'Building & roads' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.26, VAM_MApl: 14.8876} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [131]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Gypsum_REF' AND b.name = 'Building & roads' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.17, VAM_MApl: 9.7342} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [132]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Gypsum_REF' AND b.name = 'Agriculture' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.06, VAM_MApl: 3.4356} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [133]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Hafnium_REF' AND b.name = 'Superalloys' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.61, VAM_MApl: 33.8123} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [134]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Hafnium_REF' AND b.name = 'Catalysts' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.07, VAM_MApl: 7.3857} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [135]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Hafnium_REF' AND b.name = 'Tools (Plasma)' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.15, VAM_MApl: 22.2525} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [136]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Hafnium_REF' AND b.name = 'Energy (Nuclear)' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.11, VAM_MApl: 16.3185} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [137]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Hafnium_REF' AND b.name = 'Electrical and Electronics' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.03, VAM_MApl: 1.971} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [138]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Hafnium_REF' AND b.name = 'Electrical and Electronics' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.03, VAM_MApl: 1.971} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [139]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Hafnium_REF' AND b.name = 'Chemicals' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.00, VAM_MApl: 0.0} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [140]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Helium_REF' AND b.name = 'Controlled atmospheres' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.23, VAM_MApl: 12.7489} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [141]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Helium_REF' AND b.name = 'Cryogenics' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.22, VAM_MApl: 8.6152} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [142]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Helium_REF' AND b.name = 'Balloons' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.14, VAM_MApl: 5.4824} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [143]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Helium_REF' AND b.name = 'Industry' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.09, VAM_MApl: 3.5244} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [144]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Helium_REF' AND b.name = 'Analysis' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.09, VAM_MApl: 3.5244} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [145]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Helium_REF' AND b.name = 'Industry' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.08, VAM_MApl: 11.868} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [146]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Helium_REF' AND b.name = 'Electrical and Electronics' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.08, VAM_MApl: 5.256} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [147]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Helium_REF' AND b.name = 'Detection' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.07, VAM_MApl: 3.6631} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [148]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Ho, Tm, Lu, Yb_REF' AND b.name = 'Glass' CREATE (a)-[r :USADO_EN { SHR_MApl: 1.00, VAM_MApl: 65.7} ]->(b) RETURN type(r)\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "EJECUTADA QRY [149]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Indium_REF' AND b.name = 'Electrical and Electronics' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.60, VAM_MApl: 39.42} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [150]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Indium_REF' AND b.name = 'Electrical and Electronics' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.11, VAM_MApl: 7.227} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [151]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Indium_REF' AND b.name = 'Energy (Solar)' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.09, VAM_MApl: 5.913} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [152]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Indium_REF' AND b.name = 'Thermal interface material' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.07, VAM_MApl: 4.599} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [153]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Indium_REF' AND b.name = 'Batteries' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.05, VAM_MApl: 4.0375} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [154]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Indium_REF' AND b.name = 'Alloys' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.04, VAM_MApl: 2.2172} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [155]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Indium_REF' AND b.name = 'Electrical and Electronics' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.03, VAM_MApl: 1.971} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [156]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Indium_REF' AND b.name = 'Others' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.00, VAM_MApl: 0.0} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [157]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Iridium_REF' AND b.name = 'Electrical and Electronics' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.48, VAM_MApl: 50.6448} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [158]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Iridium_REF' AND b.name = 'Others' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.00, VAM_MApl: 0.0} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [159]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Iridium_REF' AND b.name = 'Electrical and Electronics' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.39, VAM_MApl: 25.623} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [160]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Iridium_REF' AND b.name = 'Chemicals' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.13, VAM_MApl: 13.7163} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [161]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Iron ore_REF' AND b.name = 'Building & roads' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.35, VAM_MApl: 51.9225} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [162]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Iron ore_REF' AND b.name = 'Transport (automotive)' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.20, VAM_MApl: 32.12} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [163]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Iron ore_REF' AND b.name = 'Steels' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.15, VAM_MApl: 27.3885} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [164]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Iron ore_REF' AND b.name = 'Steels' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.14, VAM_MApl: 20.769} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [165]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Iron ore_REF' AND b.name = 'Metals-Basics' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.11, VAM_MApl: 6.0973} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [166]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Iron ore_REF' AND b.name = 'Domestic Prods.' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.02, VAM_MApl: 3.6518} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [167]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Iron ore_REF' AND b.name = 'Transport (automotive)' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.02, VAM_MApl: 0.886} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [168]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Iron ore_REF' AND b.name = 'Others' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.00, VAM_MApl: 0.0} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [169]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Kaolin clay_REF' AND b.name = 'Ceramics' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.47, VAM_MApl: 26.9122} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [170]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Kaolin clay_REF' AND b.name = 'Chemicals (Paper)' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.29, VAM_MApl: 11.2839} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [171]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Kaolin clay_REF' AND b.name = 'Fiberglass' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.06, VAM_MApl: 3.4356} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [172]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Kaolin clay_REF' AND b.name = 'Industry' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.05, VAM_MApl: 2.863} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [173]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Kaolin clay_REF' AND b.name = 'Catalysts' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.04, VAM_MApl: 0.6916} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [174]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Kaolin clay_REF' AND b.name = 'Chemicals' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.04, VAM_MApl: 0.0} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [175]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Kaolin clay_REF' AND b.name = 'Chemicals (Paint, Adhesives)' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.04, VAM_MApl: 4.2204} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [176]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Kaolin clay_REF' AND b.name = 'Chemicals(Rubber)' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.01, VAM_MApl: 0.7598} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [177]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Kaolin clay_REF' AND b.name = 'Building & roads' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.01, VAM_MApl: 0.5726} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [178]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Lanthanum_REF' AND b.name = 'Energy (Oil)' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.67, VAM_MApl: 11.5843} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [179]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Lanthanum_REF' AND b.name = 'Ceramics & Frits' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.13, VAM_MApl: 7.4438} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [180]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Lanthanum_REF' AND b.name = 'Batteries' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.10, VAM_MApl: 8.075} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [181]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Lanthanum_REF' AND b.name = 'Electrical and Electronics' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.05, VAM_MApl: 3.285} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [182]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Lanthanum_REF' AND b.name = 'Metals-Basics' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.03, VAM_MApl: 1.6629} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [183]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Lanthanum_REF' AND b.name = 'Electrical and Electronics' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.02, VAM_MApl: 1.615} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [184]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Lead_REF' AND b.name = 'Batteries' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.84, VAM_MApl: 67.83} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [185]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Lead_REF' AND b.name = 'Metals-Basics' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.06, VAM_MApl: 3.3258} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [186]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Lead_REF' AND b.name = 'Alloys' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.04, VAM_MApl: 4.2204} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [187]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Lead_REF' AND b.name = 'Defense' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.04, VAM_MApl: 5.934} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [188]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Lead_REF' AND b.name = 'Cable sheathing' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.01, VAM_MApl: 0.8075} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [189]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Lead_REF' AND b.name = 'Alloys' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.01, VAM_MApl: 0.5543} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [190]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Limestone_REF' AND b.name = 'Building & roads' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.31, VAM_MApl: 17.7506} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [191]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Limestone_REF' AND b.name = 'Basic metals' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.08, VAM_MApl: 4.4344} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [192]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Limestone_REF' AND b.name = 'Chemicals' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.31, VAM_MApl: 32.7081} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [193]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Limestone_REF' AND b.name = 'Agriculture' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.05, VAM_MApl: 5.2755} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [194]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Limestone_REF' AND b.name = 'Others' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.06, VAM_MApl: 3.4356} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [195]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Limestone_REF' AND b.name = 'Chemicals (Paint, Adhesives)' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.06, VAM_MApl: 6.3306} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [196]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Limestone_REF' AND b.name = 'Chemicals' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.09, VAM_MApl: 0.117} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [197]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Limestone_REF' AND b.name = 'Foods' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.04, VAM_MApl: 6.2352} ]->(b) RETURN type(r)\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "EJECUTADA QRY [198]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Lithium_REF' AND b.name = 'Glass' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.66, VAM_MApl: 37.7916} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [199]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Lithium_REF' AND b.name = 'Lubricants' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.09, VAM_MApl: 9.4959} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [200]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Lithium_REF' AND b.name = 'Building & roads' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.09, VAM_MApl: 5.1534} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [201]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Lithium_REF' AND b.name = 'Metals-Basics' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.05, VAM_MApl: 2.7715} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [202]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Lithium_REF' AND b.name = 'Pharmacy' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.04, VAM_MApl: 3.2072} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [203]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Lithium_REF' AND b.name = 'Chemicals(Rubber)' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.04, VAM_MApl: 3.0392} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [204]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Lithium_REF' AND b.name = 'Alloys' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.02, VAM_MApl: 2.967} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [205]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Lithium_REF' AND b.name = 'Batteries' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.01, VAM_MApl: 0.8075} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [206]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Magnesite_REF' AND b.name = 'Metals-Basics' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.57, VAM_MApl: 31.5951} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [207]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Magnesite_REF' AND b.name = 'Chemicals (Paper)' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.12, VAM_MApl: 4.6692} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [208]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Magnesite_REF' AND b.name = 'Building & roads' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.09, VAM_MApl: 5.1534} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [209]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Magnesite_REF' AND b.name = 'Agriculture' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.07, VAM_MApl: 7.3857} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [210]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Magnesite_REF' AND b.name = 'Agriculture' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.07, VAM_MApl: 10.9116} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [211]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Magnesite_REF' AND b.name = 'Ceramics' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.05, VAM_MApl: 2.863} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [212]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Magnesite_REF' AND b.name = 'Glass' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.03, VAM_MApl: 1.7178} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [213]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Magnesite_REF' AND b.name = 'Chemicals' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.00, VAM_MApl: 0.0} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [214]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Magnesium_REF' AND b.name = 'Transport (automotive)' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.50, VAM_MApl: 80.3} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [215]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Magnesium_REF' AND b.name = 'Packaging' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.21, VAM_MApl: 31.1535} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [216]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Magnesium_REF' AND b.name = 'Metals-Basics' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.12, VAM_MApl: 6.6516} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [217]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Magnesium_REF' AND b.name = 'Building & roads' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.13, VAM_MApl: 19.2855} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [218]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Magnesium_REF' AND b.name = 'Transport (all)' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.04, VAM_MApl: 1.772} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [219]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Magnesium_REF' AND b.name = 'Others' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.00, VAM_MApl: 0.0} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [220]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Manganese_REF' AND b.name = 'Building & roads' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.25, VAM_MApl: 37.0875} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [221]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Manganese_REF' AND b.name = 'Transport (automotive)' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.14, VAM_MApl: 22.484} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [222]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Manganese_REF' AND b.name = 'Metals-Basics' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.13, VAM_MApl: 7.2059} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [223]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Manganese_REF' AND b.name = 'Building & roads' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.11, VAM_MApl: 16.3185} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [224]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Manganese_REF' AND b.name = 'Industry' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.10, VAM_MApl: 14.835} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [225]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Manganese_REF' AND b.name = 'Industry' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.10, VAM_MApl: 14.835} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [226]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Manganese_REF' AND b.name = 'Alloys' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.06, VAM_MApl: 8.901} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [227]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Manganese_REF' AND b.name = 'Chemicals' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.05, VAM_MApl: 5.2755} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [228]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Manganese_REF' AND b.name = 'Electrical and Electronics' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.04, VAM_MApl: 3.23} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [229]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Manganese_REF' AND b.name = 'Batteries' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.02, VAM_MApl: 1.615} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [230]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Molybdenum_REF' AND b.name = 'Steels' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.40, VAM_MApl: 59.34} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [231]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Molybdenum_REF' AND b.name = 'Steels' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.23, VAM_MApl: 3.9767} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [232]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Molybdenum_REF' AND b.name = 'Chemicals' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.13, VAM_MApl: 13.7163} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [233]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Molybdenum_REF' AND b.name = 'Foundry' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.08, VAM_MApl: 14.6072} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [234]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Molybdenum_REF' AND b.name = 'Tool steels' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.08, VAM_MApl: 14.6072} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [235]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Molybdenum_REF' AND b.name = 'Industry' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.06, VAM_MApl: 10.9554} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [236]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Molybdenum_REF' AND b.name = 'Industry' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.02, VAM_MApl: 3.6518} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [237]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Natural cork_REF' AND b.name = 'Foods' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.70, VAM_MApl: 22.757} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [238]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Natural cork_REF' AND b.name = 'Building & roads' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.20, VAM_MApl: 5.594} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [239]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Natural cork_REF' AND b.name = 'Furniture' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.05, VAM_MApl: 1.3085} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [240]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Natural cork_REF' AND b.name = 'Leisure' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.02, VAM_MApl: 0.7832} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [241]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Natural cork_REF' AND b.name = 'Gaskets, expansion' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.01, VAM_MApl: 1.606} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [242]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Natural cork_REF' AND b.name = 'Gaskets, expansion' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.01, VAM_MApl: 1.8259} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [243]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Natural cork_REF' AND b.name = 'Gaskets, expansion' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.01, VAM_MApl: 0.443} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [244]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Natural graphite_REF' AND b.name = 'Industry' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.53, VAM_MApl: 29.3779} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [245]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Natural graphite_REF' AND b.name = 'Foundry' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.15, VAM_MApl: 8.589} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [246]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Natural graphite_REF' AND b.name = 'Graphite shapes' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.02, VAM_MApl: 3.6518} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [247]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Natural graphite_REF' AND b.name = 'Batteries' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.09, VAM_MApl: 7.2675} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [248]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Natural graphite_REF' AND b.name = 'Lubricants' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.06, VAM_MApl: 6.3306} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [249]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Natural graphite_REF' AND b.name = 'Metals-Basics' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.05, VAM_MApl: 2.7715} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [250]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Natural graphite_REF' AND b.name = 'Tools (pencils)' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.05, VAM_MApl: 2.863} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [251]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Natural graphite_REF' AND b.name = 'Friction products' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.06, VAM_MApl: 3.4356} ]->(b) RETURN type(r)\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "EJECUTADA QRY [252]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Natural Rubber_REF' AND b.name = 'Transport (automotive)' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.75, VAM_MApl: 120.45} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [253]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Natural Rubber_REF' AND b.name = 'Transport (automotive)' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.14, VAM_MApl: 6.202} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [254]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Natural Rubber_REF' AND b.name = 'Machinery' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.06, VAM_MApl: 10.9554} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [255]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Natural Rubber_REF' AND b.name = 'Furniture' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.02, VAM_MApl: 0.5234} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [256]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Natural Rubber_REF' AND b.name = 'Packaging' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.01, VAM_MApl: 0.7598} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [257]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Natural Rubber_REF' AND b.name = 'Electrical and Electronics' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.01, VAM_MApl: 0.8075} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [258]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Natural Rubber_REF' AND b.name = 'Wear' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.01, VAM_MApl: 0.3916} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [259]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Natural Teak wood_REF' AND b.name = 'Transport (Boats)' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.90, VAM_MApl: 39.87} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [260]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Natural Teak wood_REF' AND b.name = 'Furniture' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.10, VAM_MApl: 2.617} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [261]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Neodymium_REF' AND b.name = 'Electrical and Electronics' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.41, VAM_MApl: 60.8235} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [262]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Neodymium_REF' AND b.name = 'Batteries' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.14, VAM_MApl: 11.305} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [263]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Neodymium_REF' AND b.name = 'Metals-Basics' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.13, VAM_MApl: 7.2059} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [264]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Neodymium_REF' AND b.name = 'Ceramics' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.12, VAM_MApl: 6.8712} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [265]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Neodymium_REF' AND b.name = 'Glass' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.09, VAM_MApl: 5.1534} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [266]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Neodymium_REF' AND b.name = 'Catalysts' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.07, VAM_MApl: 7.3857} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [267]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Neodymium_REF' AND b.name = 'Electrical and Electronics' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.03, VAM_MApl: 1.971} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [268]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Neodymium_REF' AND b.name = 'Others' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.00, VAM_MApl: 0.0} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [269]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Nickel_REF' AND b.name = 'Steels' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.39, VAM_MApl: 71.2101} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [270]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Nickel_REF' AND b.name = 'Metals-Basics' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.21, VAM_MApl: 11.6403} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [271]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Nickel_REF' AND b.name = 'Transport (all)' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.19, VAM_MApl: 8.417} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [272]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Nickel_REF' AND b.name = 'Electrical and Electronics' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.11, VAM_MApl: 8.8825} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [273]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Nickel_REF' AND b.name = 'Building & roads' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.10, VAM_MApl: 14.835} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [274]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Niobium_REF' AND b.name = 'Transport (automotive)' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.23, VAM_MApl: 36.938} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [275]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Niobium_REF' AND b.name = 'Building & roads' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.45, VAM_MApl: 66.7575} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [276]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Niobium_REF' AND b.name = 'Stainless Steel' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.10, VAM_MApl: 5.543} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [277]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Niobium_REF' AND b.name = 'Metals-Basics' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.17, VAM_MApl: 9.4231} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [278]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Niobium_REF' AND b.name = 'Special Steel' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.03, VAM_MApl: 1.329} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [279]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Palladium_REF' AND b.name = 'Catalysts' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.87, VAM_MApl: 139.722} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [280]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Palladium_REF' AND b.name = 'Electrical and Electronics' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.04, VAM_MApl: 2.628} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [281]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Palladium_REF' AND b.name = 'Chemicals' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.04, VAM_MApl: 4.2204} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [282]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Palladium_REF' AND b.name = 'Others' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.02, VAM_MApl: 0.7832} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [283]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Palladium_REF' AND b.name = 'Jewelery & others' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.02, VAM_MApl: 0.7832} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [284]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Palladium_REF' AND b.name = 'Others' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.00, VAM_MApl: 0.0} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [285]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Palladium_REF' AND b.name = 'Investment' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.00, VAM_MApl: 0.0} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [286]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Perlite_REF' AND b.name = 'Building & roads' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.59, VAM_MApl: 33.7834} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [287]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Perlite_REF' AND b.name = 'Foods' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.24, VAM_MApl: 7.8024} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [288]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Perlite_REF' AND b.name = 'Agriculture' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.11, VAM_MApl: 6.2986} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [289]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Perlite_REF' AND b.name = 'Filler, extender, sealant' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.06, VAM_MApl: 3.4356} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [290]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Phosphate rock_REF' AND b.name = 'Agriculture' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.86, VAM_MApl: 90.7386} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [291]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Phosphate rock_REF' AND b.name = 'Animal feed' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.10, VAM_MApl: 15.588} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [292]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Phosphate rock_REF' AND b.name = 'Chemicals' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.04, VAM_MApl: 4.2204} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [293]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Phosphorus_REF' AND b.name = 'Chemicals' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.90, VAM_MApl: 94.959} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [294]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Phosphorus_REF' AND b.name = 'Metals-Basics' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.01, VAM_MApl: 1.4835} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [295]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Phosphorus_REF' AND b.name = 'Electrical and Electronics' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.05, VAM_MApl: 3.285} ]->(b) RETURN type(r)\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "EJECUTADA QRY [296]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Phosphorus_REF' AND b.name = 'Agriculture' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.04, VAM_MApl: 4.2204} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [297]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Platinum_REF' AND b.name = 'Catalysts' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.77, VAM_MApl: 123.662} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [298]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Platinum_REF' AND b.name = 'Jewelery & others' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.10, VAM_MApl: 3.916} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [299]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Platinum_REF' AND b.name = 'Chemicals' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.06, VAM_MApl: 6.3306} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [300]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Platinum_REF' AND b.name = 'Others' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.00, VAM_MApl: 0.0} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [301]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Platinum_REF' AND b.name = 'Medicine' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.04, VAM_MApl: 1.5664} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [302]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Platinum_REF' AND b.name = 'Investment' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.00, VAM_MApl: 0.0} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [303]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Platinum_REF' AND b.name = 'Energy (Oil)' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.02, VAM_MApl: 0.3458} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [304]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Platinum_REF' AND b.name = 'Electrical and Electronics' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.01, VAM_MApl: 0.657} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [305]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Platinum_REF' AND b.name = 'Glass' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.01, VAM_MApl: 0.5726} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [306]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Potash_REF' AND b.name = 'Agriculture' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.92, VAM_MApl: 97.0692} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [307]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Potash_REF' AND b.name = 'Chemicals' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.08, VAM_MApl: 8.4408} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [308]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Praseodymium_REF' AND b.name = 'Electrical and Electronics' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.27, VAM_MApl: 40.0545} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [309]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Praseodymium_REF' AND b.name = 'Ceramics' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.17, VAM_MApl: 9.7342} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [310]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Praseodymium_REF' AND b.name = 'Batteries' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.13, VAM_MApl: 10.4975} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [311]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Praseodymium_REF' AND b.name = 'Metals-Basics' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.12, VAM_MApl: 6.6516} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [312]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Praseodymium_REF' AND b.name = 'Catalysts' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.11, VAM_MApl: 11.6061} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [313]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Praseodymium_REF' AND b.name = 'Electrical and Electronics' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.11, VAM_MApl: 7.227} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [314]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Praseodymium_REF' AND b.name = 'Glass' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.09, VAM_MApl: 5.1534} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [315]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Praseodymium_REF' AND b.name = 'Others' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.00, VAM_MApl: 0.0} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [316]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Rhenium_REF' AND b.name = 'Transport (Aerospace)' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.83, VAM_MApl: 36.769} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [317]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Rhenium_REF' AND b.name = 'Energy (Oil)' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.17, VAM_MApl: 2.9393} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [318]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Rhenium_REF' AND b.name = 'Chemicals' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.00, VAM_MApl: 0.0} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [319]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Rhodium_REF' AND b.name = 'Catalysts' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.84, VAM_MApl: 134.904} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [320]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Rhodium_REF' AND b.name = 'Glass' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.10, VAM_MApl: 5.726} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [321]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Rhodium_REF' AND b.name = 'Chemicals' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.06, VAM_MApl: 6.3306} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [322]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Rhodium_REF' AND b.name = 'Others' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.00, VAM_MApl: 0.0} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [323]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Rhodium_REF' AND b.name = 'Electrical and Electronics' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.00, VAM_MApl: 0.0} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [324]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Ruthenium_REF' AND b.name = 'Chemicals' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.30, VAM_MApl: 31.653} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [325]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Ruthenium_REF' AND b.name = 'Electrical and Electronics' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.48, VAM_MApl: 31.536} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [326]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Ruthenium_REF' AND b.name = 'Electrical and Electronics' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.22, VAM_MApl: 23.2122} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [327]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Ruthenium_REF' AND b.name = 'Others' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.00, VAM_MApl: 0.0} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [328]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Samarium_REF' AND b.name = 'Electrical and Electronics' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.97, VAM_MApl: 143.8995} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [329]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Samarium_REF' AND b.name = 'Medicine' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.03, VAM_MApl: 1.971} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [330]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Sapele wood_REF' AND b.name = 'Building & roads' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.80, VAM_MApl: 22.376} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [331]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Sapele wood_REF' AND b.name = 'Furniture' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.10, VAM_MApl: 2.617} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [332]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Sapele wood_REF' AND b.name = 'Boats' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.10, VAM_MApl: 4.43} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [333]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Scandium_REF' AND b.name = 'Electrical and Electronics' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.91, VAM_MApl: 73.4825} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [334]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Scandium_REF' AND b.name = 'Alloys' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.09, VAM_MApl: 13.3515} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [335]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Scandium_REF' AND b.name = 'Chemicals' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.00, VAM_MApl: 0.0} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [336]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Selenium_REF' AND b.name = 'Metals-Basics' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.40, VAM_MApl: 59.34} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [337]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Selenium_REF' AND b.name = 'Glass' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.25, VAM_MApl: 14.315} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [338]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Selenium_REF' AND b.name = 'Electrical and Electronics' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.10, VAM_MApl: 6.57} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [339]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Selenium_REF' AND b.name = 'Chemicals (Paint, Adhesives)' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.10, VAM_MApl: 10.551} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [340]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Selenium_REF' AND b.name = 'Agriculture' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.10, VAM_MApl: 10.551} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [341]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Selenium_REF' AND b.name = 'Others' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.05, VAM_MApl: 5.2755} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [342]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Silica sand_REF' AND b.name = 'Building & roads' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.37, VAM_MApl: 21.1862} ]->(b) RETURN type(r)\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "EJECUTADA QRY [343]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Silica sand_REF' AND b.name = 'Glass' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.31, VAM_MApl: 17.7506} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [344]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Silica sand_REF' AND b.name = 'Chemicals' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.16, VAM_MApl: 9.1616} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [345]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Silica sand_REF' AND b.name = 'Foundry' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.13, VAM_MApl: 7.2059} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [346]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Silica sand_REF' AND b.name = 'Filler, extender, sealant' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.03, VAM_MApl: 2.2794} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [347]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Silica sand_REF' AND b.name = 'Energy (Oil-Gas)' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.00, VAM_MApl: 0.0} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [348]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Silicon metal_REF' AND b.name = 'Chemicals' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.54, VAM_MApl: 56.9754} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [349]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Silicon metal_REF' AND b.name = 'Alloys' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.38, VAM_MApl: 21.0634} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [350]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Silicon metal_REF' AND b.name = 'Energy (Solar)' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.06, VAM_MApl: 3.942} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [351]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Silicon metal_REF' AND b.name = 'Electrical and Electronics' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.02, VAM_MApl: 1.314} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [352]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Silver_REF' AND b.name = 'Jewelery & others' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.31, VAM_MApl: 12.1396} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [353]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Silver_REF' AND b.name = 'Chemicals (Paint, Adhesives)' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.18, VAM_MApl: 18.9918} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [354]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Silver_REF' AND b.name = 'Transport (automotive)' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.08, VAM_MApl: 12.848} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [355]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Silver_REF' AND b.name = 'Batteries' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.07, VAM_MApl: 5.6525} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [356]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Silver_REF' AND b.name = 'Industry' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.07, VAM_MApl: 12.7813} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [357]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Silver_REF' AND b.name = 'Transport (automotive)' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.07, VAM_MApl: 3.101} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [358]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Silver_REF' AND b.name = 'Electrical and Electronics' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.06, VAM_MApl: 3.942} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [359]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Silver_REF' AND b.name = 'Glass' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.06, VAM_MApl: 3.4356} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [360]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Silver_REF' AND b.name = 'Industry' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.06, VAM_MApl: 8.901} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [361]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Silver_REF' AND b.name = 'Medicine' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.04, VAM_MApl: 3.2072} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [362]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Strontium_REF' AND b.name = 'Mining-Extraction' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.70, VAM_MApl: 40.082} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [363]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Strontium_REF' AND b.name = 'Chemicals (Pyrotechnics)' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.09, VAM_MApl: 9.4959} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [364]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Strontium_REF' AND b.name = 'Electrical and Electronics' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.09, VAM_MApl: 16.4331} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [365]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Strontium_REF' AND b.name = 'Alloys' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.03, VAM_MApl: 1.6629} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [366]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Strontium_REF' AND b.name = 'Chemicals (Paint, Adhesives)' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.03, VAM_MApl: 3.1653} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [367]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Strontium_REF' AND b.name = 'Metals-Basics' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.03, VAM_MApl: 1.6629} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [368]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Strontium_REF' AND b.name = 'Glass' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.03, VAM_MApl: 1.7178} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [369]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Sulphur_REF' AND b.name = 'Chemicals' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.71, VAM_MApl: 74.9121} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [370]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Sulphur_REF' AND b.name = 'Energy (Oil)' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.24, VAM_MApl: 4.1496} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [371]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Sulphur_REF' AND b.name = 'Metals-Basics' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.04, VAM_MApl: 2.2172} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [372]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Sulphur_REF' AND b.name = 'Chemicals (Paper)' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.01, VAM_MApl: 0.3891} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [373]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Talc_REF' AND b.name = 'Chemicals (Plastics)' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.34, VAM_MApl: 25.8332} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [374]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Talc_REF' AND b.name = 'Chemicals (Paper)' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.21, VAM_MApl: 8.1711} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [375]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Talc_REF' AND b.name = 'Chemicals (Paint, Adhesives)' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.18, VAM_MApl: 18.9918} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [376]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Talc_REF' AND b.name = 'Foods' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.08, VAM_MApl: 12.4704} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [377]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Talc_REF' AND b.name = 'Building & roads' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.07, VAM_MApl: 4.0082} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [378]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Talc_REF' AND b.name = 'Agriculture' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.04, VAM_MApl: 4.2204} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [379]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Talc_REF' AND b.name = 'Chemicals' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.04, VAM_MApl: 3.2072} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [380]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Talc_REF' AND b.name = 'Chemicals(Rubber)' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.02, VAM_MApl: 1.5196} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [381]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Talc_REF' AND b.name = 'Cosmetics' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.01, VAM_MApl: 0.8018} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [382]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Talc_REF' AND b.name = 'Pharmacy' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.01, VAM_MApl: 0.8018} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [383]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Tantalum_REF' AND b.name = 'Capacitors' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.40, VAM_MApl: 26.28} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [384]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Tantalum_REF' AND b.name = 'Electrical and Electronics' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.20, VAM_MApl: 13.14} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [385]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Tantalum_REF' AND b.name = 'Superalloys' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.14, VAM_MApl: 6.202} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [386]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Tantalum_REF' AND b.name = 'Chemicals' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.12, VAM_MApl: 12.6612} ]->(b) RETURN type(r)\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "EJECUTADA QRY [387]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Tantalum_REF' AND b.name = 'Hard materials (tools)' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.10, VAM_MApl: 18.259} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [388]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Tantalum_REF' AND b.name = 'Industry' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.04, VAM_MApl: 5.934} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [389]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Tellurium_REF' AND b.name = 'Energy (Solar)' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.40, VAM_MApl: 26.28} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [390]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Tellurium_REF' AND b.name = 'Thermo-electric devices' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.30, VAM_MApl: 19.71} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [391]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Tellurium_REF' AND b.name = 'Metals-Basics' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.15, VAM_MApl: 22.2525} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [392]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Tellurium_REF' AND b.name = 'Chemicals' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.10, VAM_MApl: 10.551} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [393]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Tellurium_REF' AND b.name = 'Chemicals(Rubber)' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.05, VAM_MApl: 3.799} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [394]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Terbium_REF' AND b.name = 'Electrical and Electronics' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.68, VAM_MApl: 54.91} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [395]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Terbium_REF' AND b.name = 'Electrical and Electronics' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.32, VAM_MApl: 47.472} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [396]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Tin_REF' AND b.name = 'Electrical and Electronics' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.47, VAM_MApl: 30.879} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [397]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Tin_REF' AND b.name = 'Chemicals' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.18, VAM_MApl: 18.9918} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [398]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Tin_REF' AND b.name = 'Tinplate' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.13, VAM_MApl: 19.2855} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [399]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Tin_REF' AND b.name = 'Chemicals' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.10, VAM_MApl: 14.835} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [400]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Tin_REF' AND b.name = 'Batteries (Lead)' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.06, VAM_MApl: 4.845} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [401]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Tin_REF' AND b.name = 'Alloys' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.06, VAM_MApl: 3.3258} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [402]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Titanium_REF' AND b.name = 'Chemicals (Paint, Adhesives)' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.54, VAM_MApl: 56.9754} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [403]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Titanium_REF' AND b.name = 'Chemicals (Plastics)' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.24, VAM_MApl: 18.2352} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [404]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Titanium_REF' AND b.name = 'Transport (Aerospace)' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.08, VAM_MApl: 3.544} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [405]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Titanium_REF' AND b.name = 'Medicine' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.06, VAM_MApl: 10.9554} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [406]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Titanium_REF' AND b.name = 'Transport (automotive)' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.03, VAM_MApl: 4.818} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [407]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Titanium_REF' AND b.name = 'Metal Prods.' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.02, VAM_MApl: 2.967} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [408]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Titanium_REF' AND b.name = 'Alloys' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.02, VAM_MApl: 1.1086} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [409]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Titanium_REF' AND b.name = 'Pharmacy' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.01, VAM_MApl: 0.8018} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [410]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Tungsten_REF' AND b.name = 'Industry' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.33, VAM_MApl: 60.2547} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [411]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Tungsten_REF' AND b.name = 'Industry' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.23, VAM_MApl: 41.9957} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [412]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Tungsten_REF' AND b.name = 'Industry' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.18, VAM_MApl: 32.8662} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [413]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Tungsten_REF' AND b.name = 'Catalysts' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.08, VAM_MApl: 8.4408} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [414]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Tungsten_REF' AND b.name = 'Electrical and Electronics' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.06, VAM_MApl: 3.942} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [415]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Tungsten_REF' AND b.name = 'Steels' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.06, VAM_MApl: 8.901} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [416]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Tungsten_REF' AND b.name = 'Aeronautics & energy' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.05, VAM_MApl: 9.1295} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [417]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Tungsten_REF' AND b.name = 'Chemicals' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.00, VAM_MApl: 0.0} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [418]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Vanadium_REF' AND b.name = 'Steels' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.60, VAM_MApl: 33.258} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [419]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Vanadium_REF' AND b.name = 'Special Steel' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.30, VAM_MApl: 44.505} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [420]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Vanadium_REF' AND b.name = 'Transport (automotive)' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.03, VAM_MApl: 4.818} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [421]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Vanadium_REF' AND b.name = 'Chemicals' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.03, VAM_MApl: 3.1653} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [422]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Vanadium_REF' AND b.name = 'Cast Iron for rigid structures' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.02, VAM_MApl: 0.886} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [423]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Vanadium_REF' AND b.name = 'Stainless Steel' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.01, VAM_MApl: 1.8259} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [424]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Vanadium_REF' AND b.name = 'Electrical and Electronics' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.01, VAM_MApl: 0.8075} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [425]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Yttrium_REF' AND b.name = 'Electrical and Electronics' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.50, VAM_MApl: 40.375} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [426]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Yttrium_REF' AND b.name = 'Ceramics' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.38, VAM_MApl: 21.7588} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [427]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Yttrium_REF' AND b.name = 'Alloys' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.08, VAM_MApl: 4.4344} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [428]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Yttrium_REF' AND b.name = 'Glass' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.04, VAM_MApl: 2.2904} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [429]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Yttrium_REF' AND b.name = 'Chemicals' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.00, VAM_MApl: 0.0} ]->(b) RETURN type(r)\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "EJECUTADA QRY [430]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Zinc_REF' AND b.name = 'Galvanising' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.52, VAM_MApl: 77.142} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [431]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Zinc_REF' AND b.name = 'Metals-Basics' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.17, VAM_MApl: 9.4231} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [432]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Zinc_REF' AND b.name = 'Metals-Basics' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.15, VAM_MApl: 8.3145} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [433]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Zinc_REF' AND b.name = 'Chemicals' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.10, VAM_MApl: 10.551} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [434]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Zinc_REF' AND b.name = 'Metals-Basics' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.06, VAM_MApl: 8.901} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [435]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Zirconium_REF' AND b.name = 'Ceramics' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.43, VAM_MApl: 24.6218} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [436]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Zirconium_REF' AND b.name = 'Industry' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.15, VAM_MApl: 8.589} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [437]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Zirconium_REF' AND b.name = 'Foundry' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.15, VAM_MApl: 8.3145} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [438]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Zirconium_REF' AND b.name = 'Chemicals' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.12, VAM_MApl: 12.6612} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [439]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Zirconium_REF' AND b.name = 'Chemicals' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.10, VAM_MApl: 6.57} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [440]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Zirconium_REF' AND b.name = 'Chemicals (Paint, Adhesives)' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.03, VAM_MApl: 3.1653} ]->(b) RETURN type(r)\n",
      "EJECUTADA QRY [441]> MATCH (a:MaterialREF), (b:GrupoAplicacion) WHERE a.name = 'Zirconium_REF' AND b.name = 'Energy (Nuclear)' CREATE (a)-[r :USADO_EN { SHR_MApl: 0.02, VAM_MApl: 1.1086} ]->(b) RETURN type(r)\n"
     ]
    }
   ],
   "source": [
    "# Crear la RELACIÓN en la BD , una por CADA FILA (****restantes ***) \n",
    "#relación USADO_EN\n",
    "## query para crea la relación con sus propiedades (en este caso no aplica)\n",
    "# VAMtmp contiene para cada fila el valor calculado para la propiedad VAM_MApl\n",
    "#\n",
    "inicio = nFilas\n",
    "nFilas = dfRelAplics.shape[0]\n",
    " \n",
    "for i in range(inicio, nFilas):\n",
    "    VAMtmp = round(float(dfRelAplics.ShareSectorApl[i].replace(',', '.')) *               \\\n",
    "                   float(dfRelAplics.ValorAnadidoSector[i].replace(',', '.')), 4)\n",
    "    strQry = \"MATCH \"                                           \\\n",
    "            + TipoNodoA + \", \" + TipoNodoB                      \\\n",
    "            + \" WHERE a.name = '\"                               \\\n",
    "            +  dfRelAplics.MaterialApl[i]                       \\\n",
    "            + \"_REF' AND b.name = '\"                            \\\n",
    "            +  dfRelAplics.GrupoAplicacion[i]                   \\\n",
    "            + \"'\"                                               \\\n",
    "            + \" CREATE (a)-[r\" + TipoRelacion                   \\\n",
    "            + \" { SHR_MApl: \"                                   \\\n",
    "            + dfRelAplics.ShareSectorApl[i].replace(',', '.')   \\\n",
    "            + \", VAM_MApl: \"                                    \\\n",
    "            + str( VAMtmp )                                     \\\n",
    "            + \"} ]->(b)\"                                        \\\n",
    "            + \" RETURN type(r)\"                                 \n",
    "#\n",
    "# ejecutar Query en BD abierta - Neo4j\n",
    "#\n",
    "    graph_test01.run(strQry)\n",
    "#Visualizar Query ejecutada \n",
    "    print(\"EJECUTADA QRY [\" + str(i) + \"]> \"+ strQry)\n",
    "# nodos creados"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 28,
   "id": "692a91c0",
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>name</th>\n",
       "      <th>Ntotal</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>MaterialB</td>\n",
       "      <td>78</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>MaterialREF</td>\n",
       "      <td>78</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Pais</td>\n",
       "      <td>91</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>GrupoAplicacion</td>\n",
       "      <td>88</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>SectorAplicacion</td>\n",
       "      <td>25</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "               name  Ntotal\n",
       "0         MaterialB      78\n",
       "1       MaterialREF      78\n",
       "2              Pais      91\n",
       "3   GrupoAplicacion      88\n",
       "4  SectorAplicacion      25"
      ]
     },
     "execution_count": 28,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#validamos que todos los nodos se han creado (hasta este paso)\n",
    "queryPRB= \"MATCH (n)                                    \\\n",
    "RETURN labels (n)[0] as name, count (n) as Ntotal       \\\n",
    "UNION MATCH (n)                                         \\\n",
    "WITH labels (n)[1] as name, count (n) as Ntotal         \\\n",
    "WHERE name IS NOT NULL                                  \\\n",
    "RETURN name, Ntotal                                     \\\n",
    "UNION MATCH (n)                                         \\\n",
    "WITH labels (n)[2] as name, count (n) as Ntotal         \\\n",
    "WHERE name IS NOT NULL                                  \\\n",
    "RETURN  name, Ntotal                                    \\\n",
    "UNION MATCH (n)                                         \\\n",
    "WITH labels (n)[3] as name, count (n) as Ntotal         \\\n",
    "WHERE name IS NOT NULL                                  \\\n",
    "RETURN  name, Ntotal                                    \\\n",
    "UNION MATCH (n)                                         \\\n",
    "WITH labels (n)[4] as name, count (n) as Ntotal         \\\n",
    "WHERE name IS NOT NULL                                  \\\n",
    "RETURN  name, Ntotal\"  \n",
    "                                  \n",
    "graph_test01.run(queryPRB).to_data_frame()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 30,
   "id": "e3abc6ce",
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>TipoRelacion</th>\n",
       "      <th>Ntotal</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>INCLUIDO_EN</td>\n",
       "      <td>442</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>USADO_EN</td>\n",
       "      <td>442</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "  TipoRelacion  Ntotal\n",
       "0  INCLUIDO_EN     442\n",
       "1     USADO_EN     442"
      ]
     },
     "execution_count": 30,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#validamos que todas las RELACIONES se han creado (hasta este paso)\n",
    "queryPRB= \"MATCH n=()-[r:INCLUIDO_EN]->()              \\\n",
    "RETURN type(r) as TipoRelacion, count (r) as Ntotal    \\\n",
    "UNION MATCH m=()-[p:USADO_EN]->()                      \\\n",
    "RETURN type(p) as TipoRelacion, count (p) as Ntotal\"       \n",
    "                                  \n",
    "graph_test01.run(queryPRB).to_data_frame()"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "aee44cef",
   "metadata": {},
   "source": [
    "# fin proceso - relación  \"INCLUIDO_EN\" - CREADA"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 81,
   "id": "df4c6f03",
   "metadata": {},
   "outputs": [],
   "source": [
    "# fin archivo"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.7.1"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
